{
    "WC5E" : {

        "Languages" : {
            "Common" : "Gemeinsprache",
            "Dwarven" : "Zwergisch",
            "Elven" : "Elfisch",
            "Eredun" : "Eredonisch"
        },

        "Character" : {
            "Strength" : "Stärke",
            "Agility" : "Gewandtheit",
            "Stamina" : "Ausdauer",
            "Intelligence" : "Intelligenz",
            "Spirit" : "Sinne",
            "Charisma" : "Charisma",
            "HitPoints" : "Lebenspunkte",
            "Level" : "Charakterstufe"
        },

        "Class" : {
            "Alchemist" : {
                "Name": "Alchemist",
                "Introduction": {
                    "1": "A forsaken stalks the ruins of a murloc village, picking eyes and bits of flesh. As a skulking murloc prepares to jump out at her, she casually tosses a potion at its chest without glancing at it, causing the skin to bubble and blacken with a terrible—the last thing it sees are the forsaken‘s fingers reaching forward to take out its light.“",
                    "2": "A gnome reaches down to his box of Alchemist‘s Supplies, picking a rare herb and some pinches of sea salt, before tossing them into a small battle-beaker warmed by a portable burner. With uncanny calm, he weighs the curative mixture, before delivering it to a dying friend, revivifying her.“",
                    "3": "Laughing maniacally as he consumes his potion, the troll rushes into the fight, fingertips mutating into razor-sharp claws. As his muscles grow larger, and as his skin hardens, his eyes gleam with the promise of pain.",
                    "4": "A goblin mercenary sits on the back of a drugged ogre, tossing explosive potions. Wincing as a human warrior stabs his giant homunculus, he pulls out a potion from his side pouch and jams it down the ogre‘s throat. The crunch of teeth against glass invigorates the ogre, and, with a burp, it tosses its arm forward with great strength, tossing the human away as the alchemist laughs in triumph."
                },
                "Description": "Whether by careful measuring, self-experimentation, explosive mixtures, or supportive potions, an alchemist utilizes their own mix of magic and science, alchemical science, to support and heal wounds, decimate enemies, manifest unusual effects, or augment themselves to wade into battle. These lightly armored individuals are experts in creating a variety of special effects, from temporary explosives to elixirs that revive the dead.",
                "Blocks": {
                    "1": {
                        "Title": "Magic and Science",
                        "Content": "In the Warcraft universe, alchemy is not merely pseudo-chemistry—it is an art that draws power from the primal elements of life, not unlike actual magic. An alchemist is a master of the art who takes it leaps and bounds further than their peers, who are limited in their alchemical products to mere healing poultices and anti-toxins, reaching heights of reviving the dead or manifesting massive explosives.<br>The greatest strength of an alchemist is their versatility. They can themselves adequately but can specialize in being battle-chemists who augment themselves with potions before tearing their enemies apart with their own hands. They can choose to focus on the augmentative powers of their mixtures, delaying harm and healing wounds, or to debilitate their enemies with negative status effects. Damage dealt by an alchemist‘s potions usually focus on concussive or poison damage, but they are also broad in scope, dealing fire or frost or lighting as required of them. The better they anticipate their opposition, the better the alchemist can prepare.<br>The success of alchemists relies greatly on the formulae and recipes they have in their formula books. They gain new formulae as they gain experience, study other formula books, or research independently."
                    },
                    "2": {
                        "Title": "The Weight of Knowledge",
                        "Content": "Alchemists' lives may appear mundane, starting as a sage, independent researcher under a mage tower, a plague researcher, or member of a military force‘s supply chain. Other alchemists focus on trade, opening alchemy shops and selling anything from curative mixtures to love potions. Others still have adapted their talents to violence, such as serving in mercenary forces or the military, sapping structural defenses and focusing on combat support.<br>>The weight of knowledge and the demand for versatile potions calls for even the most sedentary alchemists to venture out to investigate strange happenings, support their friends, or answer the call to heroism.<br><br>Alchemists are students, researchers, and scientists of the mysterious science of alchemy. To choose to alchemist class is to be more than a dabbler in the art of alchemy—they are utilizers of strange techniques that would empower themselves and their allies, experienced craftspeople who can make potions for fractions of the normal time and cost, and some have even modified their bodies to make full use of their skills.<br>Creating poisons, potions, special explosives, and empowering substances, alchemists are either curiosities, prized members of society, or reclusive, feared experts in unstable weird sciences. Alchemy itself does not fall strictly in one end between science and magic, but is a potent force nonetheless.<br>Alchemists support soldiers and adventurers, and could easily take to the field themselves, brewing and concocting potions, poisons, and poultices to support (or create) allies on the field. Some work to support their communities, others attempt to replicate (or surpass) the work of the Scourge's necromancers, and others focus on self-empowering through strange concoctions they imbibe."
                    }
                }
            },
            "DeathKnight" : {
                "Name" : "Todesritter"
            },
            "Druid" : {
                "Name" : "Druide"
            },
            "Hunter" : {
                "Name" : "Jäger"
            },
            "Mage" : {
                "Name" : "Magier"
            },
            "Paladin" : {
                "Name" : "Paladin"
            },
            "Priest" : {
                "Name" : "Priester"
            },
            "Shaman" : {
                "Name" : "Schamane"
            },
            "Warlock" : {
                "Name" : "Hexer"
            },
            "Warrior" : {
                "Name" : "Krieger",
                "Introduction": {
                    "1": "Der schwer gepanzerte Zwerg nimmt einen tiefen Atemzug und festigt den Griff um seinen Kriegshammer in der einen, und der Kriegsaxt in der anderen Hand, als er den Oger dabei beobachtet, wie er seine Bergheimat verwüstet. Der Bergkönig stößt einen Kriegsschrei aus und wächst dabei plötzlich auf die gleiche Größe an wie der Oger. Er schwingt seine Axt und versenkt sie tief in der Schulter des Ogers, bevor er seinen Kriegshammer nieder sausen lässt, wodurch er mit einer warmen Dusche aus frischem Blut benetzt wird.",
                    "2": "Ein Ork, der mit einer riesigen zweihändigen Klinge bewaffnet ist, stürmt zwei Naga entgegen, die er mit einem einzigen Hieb spaltet. Bei seinem Aufprall erzittert der Boden. Ohne mit der Wimper zu zucken, stürmt er dem nächsten Feind entgegen.",
                    "3": "Ein Tauren wandert ruhig über das von Fel gezeichnete Schlachtfeld, um einen würdigen Gegner zu finden. Natürlich findet er einen Herausforderer - eine blutrünstige Teufelswache. Mit Bedacht pariert er jeden einzelnen Schlag mit seinem gigantischen Kriegs-Totem. Als sich die Gelegenheit ergibt, stampft der Tauren-Krieger mit seinen gewaltigen Hufen auf den Boden auf und bringt die Teufelswache aus dem Gleichgewicht. Begleitet von einem lauten Kriegsschrei, bringt er den Gegner mit einem gewaltigen Hieb seines Totems zur Strecke und dessen lebloser Leib bleibt in einem kleinen Krater zurück."
                },
                "Description": "Krieger sind Kämpfer, die besonders in der Kampfkunst geschult sind. Der Kampf ist die stärkste Fähigkeit des Kriegers. Sie sind schnell und tödlich auf dem Schlachtfeld. Je nach ihrer Spezialisierung können Krieger sehr viel Schaden anrichten oder sehr schwer zu überwinden sein.",
                "Blocks": {
                    "1": {
                        "Title": "Trained for Battle",
                        "Content": "As long as war is waged on Azeroth, there will be men and women who fight those wars. Warriors are no mere sword-swingers; they are skilled combatants, combining strength of arm, knowledge of weaponry, and practiced maneuvers to slice or bludgeon their foes into little red bits. Warriors are the most versatile of the combat classes, and they supplement their fighting prowess with the ability to rally their allies and spur them to victory. They charge into the heart of the battle and survive the most grievous of wounds. Elven and dwarven warriors reach into their blood for innate magic, creating spellbreakers and mountain kings, respectively, while tauren and orcs lean naturally towards using a single large weapon and the Arms path, creating chieftains and blademasters, respectively.<br>Warriors are common in dwarf, forsaken, human, and orc societies, but many other species also fill their ranks with warriors. Masters of swords, spears, and weapons of all kinds, warriors share a common way of life on Azeroth. Using their abilities to deal pain and cause bloodshed, warriors are deadly adversaries and welcome friends in violent times (which seem to be all the time in recent decades). Anyone willing to take up arms to defend their people can be classed as a warrior. A knight is the warrior elite among humans."
                    },
                    "2": {
                        "Title": "Elite Fighters",
                        "Content": "Not every member of the city watch, village militia, or the queen‘s army is a warrior. Most of these troops are relatively untrained soldiers with only the most basic combat knowledge or drilled for a certain function. Veteran soldiers, military officers, trained bodyguards, dedicated knights, and similar figures are true warriors—it is all about the spirit, in truth.<br>Some warriors feel drawn to use their training as adventurers. The dungeon delving, monster slaying, and other dangerous work common among adventurers is second nature for a warrior, not all that different from the life he or she left behind. Other warriors live a more stable life, serving as elite members in an order or military force, answering assignments and missions that involve armed pacification of resistance or the escort of vulnerable charges."
                    },
                    "3": {
                        "Title": "Creating a Warrior",
                        "Content": "For as long as war has raged, heroes from every race have aimed to master the art of battle.<br> Warriors combine strength, leadership, and a vast knowledge of arms and armor to wreak havoc in glorious combat. Some protect from the front lines with shields, locking down enemies while allies support the warrior from behind with spell and bow. Others forgo the shield and unleash their rage at the closest threat with a variety of deadly weapons.<br>As you build your warrior, think about your character‘s background: Where did you get your combat training, and what sets you apart from the mundane soldiers around you? You might have enjoyed formal training in a noble‘s army or in a local militia. Perhaps you trained in a war academy, learning strategy, tactics, and military history. Or you might be self—taught—unpolished but well tested.<br>Were you particularly ruthless? Did you get extra help from a mentor, or did your spirit shine brightly enough to warrant the title due to exceptional dedication? What drove you to this training in the first place? Was it a threat to your homeland, a thirst for revenge, or a need to prove yourself? Did you take up the sword as a way to escape the limits of life on a farm, or are you following a proud family tradition? Where did you acquire your weapons and armor? They might have been military issue or family heirlooms, or perhaps you scrimped and saved for years to buy them. Your armaments are now among your most important possessions—the only things that stand between you and death's embrace."
                    }
                },
                "QuickBuild": "You can make a warrior quickly by following these suggestions. First, make Strength or Agility your highest ability score, depending on whether you want to focus on melee weapons or on archery (or finesse weapons). Your next-highest score should be Stamina. Second, choose the soldier background.",
                "Archetypes": {
                    "Arms": {
                        "Description": "You focus on wielding great weapons, breaking enemy lines, inflicting the first wounds in battle, and dealing massive amounts of damage. As they cleave through several creatures at once to soften up their foes for their allies, arms warriors become an inspiring sight on the battlefield, and are masters of their chosen weapons."
                    }
                }
            }
        },

        "RaceSheet" : {
            "AbilityScoreIncrease" : "Attributs-Modifikator",
            "Age" : "Alter",
            "Traits" : "Merkmale",
            "Affiliation" : "Zugehörigkeit",
            "Size" : "Größe",
            "Appearance" : "Erscheinung",
            "Speed" : "Tempo",
            "SpeedVal" : "Das Grund-Tempo beträgt ",
            "Languages" : "Sprachen",
            "Subrace" : "Unterarten",
            "SubraceChoice" : "Wähle eine der folgenden Unterarten.",
            "MaleNames" : "Männernamen",
            "FemaleNames" : "Frauennamen",
            "FamilyNames" : "Familiennamen"
        },

        "Race" : {
            "Draenei" : {
                "Name" : "Draenei",
                "Description" : "Die Draenei sind eine stämmig gebaute außerirdische Rasse, die vom Planeten Argus stammt. Sie sind sehr stark mit der Magie im Einklang und neigen zum ausgesprochen Guten oder Bösen. Draenei, die der Fel-Magie anheim fallen, bilden die Ränge der Eredar, den größten Generälen der brennenden Legion. Draenei, die wiederrum dem heiligen Licht dienen, sind unsterbliche Kreuzritter im Dienste der Gerechtigkeit - überall im Universum.",
                "AbilityScoreIncrease" : "Geist oder Intelligenz steigen um 1.",
                "Age" : "Ein typischer Draenei gilt ab 100 Jahren als erwachsen und kann bis zu 10.000 Jahre alt werden.",
                "Affiliation" : "Jede Draeneifraktion hat ihre eigene Zugehörigkeit.",
                "Size" : "Medium - Männliche Draenei werden zwischen 2,15 m und 2,50 m groß und wiegen im Durchschnitt zwischen 135 kg und 180 kg. Ihre weiblichen Gegenstücke werden nur zwischen 1,80 m und 2,10 m groß und wiegen zwischen 75 kg und 115 kg.",
                "Appearance" : "Passend zu ihrer Eredar-Herkunft haben Draenei anstelle von Füßen schwere Hufe, Ranken, die ihnen aus dem Nacken wachsen und kurze Schwänze. Ihre Hautfarbe wird geprägt von den magischen Einflüssen, denen sie ausgesetzt sind. Fel-Magie färbt ihre Haut rot, heilige Magie färmt sie blau bis violett und Leeren-Magie verdunkelt sie bis zu einem Braun-Ton. Die Schädel der Männer sind durchzogen von Knochenplatten der Stirn und dadurch sehr robust. Weiblichen Draenei hingegen wachsen lange geschwungene und anmutige Hörner. Die 'Zerschlagenen' sehen etwas anders aus als gewöhnliche Draenei. Aufgrund ihrer Mutationen haben sie flache Gesichter ohne Knochenplatten, ohne Nasen und ihre dicken Hände haben nur drei Finger.",
                "Language" : "Die eredonische Draenei-Sprache ist ein abgewandelter Dialekt, der weniger korrumpiert ist. Die Sprache verursacht daher keine Nachteile, wenn sie verwendet wird, kann allerdings von Dämonen verstanden werden.",
                "FamilyNames" : "Draenei tragen keine Familiennamen, aber sie erlangen Titel, die ihren namenhaften Taten entsprechen.",
                "Subrace" : "Längst vergangene Ereignisse teilen die Draenei in zwei Unterarten: Die \"Ungebrochenen\" und die \"Zerschlagenen\".",
                "Subraces" : {
                    "Broken" : {
                        "Name" : "Die Zerschlagenen (Krokul)",
                        "Quote" : "Ihr werdet unsere Wege kennen lernen...",
                        "Description" : "Die Zerschlagenen, auf eredonisch als die Krokul bekannt, sind eine mutierte und degenerierte Unterart der Draenei, die in der Scherbenwelt leben. So wie die meisten Orks fielen die Krokul dem Einfluss der finsteren Dämonen anheim und wurden durch die Verderbnis verändert. Obwohl sie einige ihrer ursprünglichen Kräfte verloren haben, stellen die Zerschlagenen noch immer eine Bedrohung für alle Lebewesen in der Scherbenwelt dar. Die größte bekannte Fraktion sind die Todeshörigen der Aschezungen, die von Akama angeführt werden. Sie sind vermutlich mit Illidan Sturmgrimm verbündet.",
                        "AbilityScoreIncrease" : "Gewandtheit steigt um 2.",
                        "Affiliation" : "Unabhängig - Trotz des größtenteils versehentlichen Rückschritts zu Zerschlagenen, wird dieser Unterart von den meisten Draenei nicht nur misstraut, es schlägt ihnen sogar offene Feindschaft entgegen. Obwohl das zumindest bei den Zerschlagenen verständlich ist, die noch unter dem Einfluss der Verderbnis stehen oder noch immer der brennenden Legion dienen, könnte man von den Ungebrochenen dennoch erwarten, dass sie ihre eigenen Leute nach dem Genozid der Orks willkommen heißen. Die meisten Zerschlagenen sind daher unabhängig, auch wenn es Bemühungen von Prophet Velen gibt, sie wieder zurück zu führen."
                    },
                    "Unbroken" : {
                        "Name" : "Die Ungebrochenen (wahre Draenei)",
                        "Quote" : "Das Ende der brennenden Legion rückt näher.",
                        "Description" : "Als erleuchtete Cousins der Eredar, sind die Draenei nach der erneuten Öffnung des dunklen Portals in Azeroth aufgetaucht. Da sie die letzten Jahrhunderte im Exil und auf der Flucht vor der brennenden Legion verbracht haben, sind die Draenei standhafte Streiter für das Licht und werden alles tun was in ihrer Macht steht, um zu verhindern, dass eine weitere Welt den Flammen anheim fällt.",
                        "AbilityScoreIncrease" : "Stärke steigt um 2.",
                        "Affiliation" : "Allianz - Die Ungebrochenen haben gemerkt, dass sie starke Bande mit den Menschen und Zwergen teilen, da sie ebenfalls das Licht anbeten. Außerdem fühlen sie mit den nun sterblichen Nachtelfen."
                    }
                }
            },
            "Dwarf" : {
                "Name" : "Zwerge",
                "Description" : "Zwerge sind kleine und kräftige Kreaturen, die hauptsächlich das Reich Khaz Modan bewohnen, welches in den östlichen Königreichen liegt. Sie sind kleiner als Menschen, aber größer als Gnome und verlassen sich - wenn sie können - auf ihre geringe Körpergröße, bzw. auf ihre Robustheit und Stärke, wenn die nicht hilft. Der durchschnittliche Zwerg ist zuverlässig, wachsam und ruhig.",
                "AbilityScoreIncrease" : "Ausdauer steigt um 2.",
                "Age" : "Zwerge altern genau so schnell wie Menschen, gelten aber als Jünglinge, bis sie das Alter von 40 erreichen. Im Durchschnitt werden Zwerge bis zu 450 Jahre alt.",
                "Affiliation" : "Jede Unterart hat ihre eigene Zugehörigkeit, seit das Volk der Zwerge im Krieg der drei Hämmer auseinander brach.",
                "Size" : "Medium - Zwerge werden zwischen 1,20 m und 1,50 m groß und wiegen zwischen 70 kg und 110 kg.",
                "Appearance" : "Männliche Zwerge neigen dazu, sich lange Haare und Bärte wachsen zu lassen, die sie in verzierte Zöpfe flechten. Weibliche Zwerge haben ebenfalls stabile, aber vor allem dralle Körper - allerdings ohne Bartwuchs, auch wenn andere Rassen das oft behaupten.",
                "SpeedAddition" : "Zwerge werden nicht durch das Tragen von schweren Rüstungen verlangsamt.",
                "Language" : "Zwergisch besteht zu Großteilen aus harten Konsonanten und kehligen Lauten. Diese Eigenarten übertragen sich auf alle weiteren Sprachen, die ein Zwerg sprechen könnte.",
                "Subrace" : "Drei Unterarten von Zwergen bevölkern die Welt von Azeroth: Die Hügelzwerge des Wildhammer-Clans, die Bergzwerge des Bronzebart-Clans und die dunklen Zwerge des Dunkeleisen-Clans.",
                "Subraces" : {
                    "Bronzebeard" : {
                        "Name" : "Bergzwerge (Bronzebart-Clan)",
                        "Quote" : "Für Khaz Modan!",
                        "Description" : "Die meisten Bergzwerge leben in Khaz Modan und stammen in der Regel vom Bronzebart-Clan und dessen Unter-Clans ab. Die Zwerge aus Eisenschmiede sind massig und kräftig gebaut. Sie haben kurze muskolöse Körper und tragen ihr Haar in verzierten Zöpfen.",
                        "AbilityScoreIncrease" : "Stärke steigt um 1.",
                        "Affiliation" : "Allianz - Obwohl die Zwerge aus Eisenschmiede die kriegerischen Fähigkeiten der Horde respektieren, misstrauen sie speziell den Orks, Trollen und Verlassenen. Auch die Elfen aus Quel'Thalas halten die Zwerge auf einer Armlänge Abstand, trotz der diplomatischen- und Handelsbeziehungen, die sie mit ihnen pflegen. Obwohl sie die gleiche Gefolgschaft mit den Nachtelfen teilen, betrachten begegnen die Zwerge ihnen mit Argwohn und Beklommenheit. Die Menschen hingegen sind zuverlässige und stete Verbündete des Zwergenvolks und stoßen auf deren Gunst und Güte, wenn sie im Zwergenreich willkommen geheißen werden.",
                        "FamilyNames" : "Donnerschmiede, Bronzebart, Hammergrim, Dornenstahl, Donnerleib"
                    },
                    "DarkIron" : {
                        "Name" : "Dunkelzwerge (Dunkeleisen-Clan)",
                        "Quote" : "Ihr sollt dienen.",
                        "Description" : "Dunkelzwerge stammen in der Regel vom Dunkeleisen-Clan ab, der vom Zauberer-Than Thaurissan angeführt wird. Als Verräter der eigenen Rasse beschimpft, leben sie als Sklaven des großen elementaren Herrn des Feuers, Ragnaros, in den Hallen des Schwarzfelsen. Dort dienen sie im Verborgenen dem Vulkan. Dunkelzwerge sehen den Zwergen des Bronzebart-Clans in ihrer Erscheinung sehr ähnlich, abgesehen davon, dass ihre Haut aschfahl bis grau ist und ihre Augen rot-golden leuchten. Zwerge des Dunkeleisen-Clans können oft in die Tiefen ihres Wesens vordringen und Flammen beschwören. Aufgrund ihrer rauen und heiseren Stimmen und ihrer mürrischen Neigung zu Gemecker, erwecken sie nicht gerade Vertrauen.",
                        "AbilityScoreIncrease" : "Intelligenz steigt um 1.",
                        "Affiliation" : "Allianz oder unabhängig - Hass gegenüber allen Rassen treibt die Zwerge des Dunkeleisen-Clans an. In ihrem Dienst für Ragnaros sehen sie ausschließlich Rivalen, Sklaven und Feinde. Einige wenige von ihnen haben Gemeinsamkeiten mit ihren Cousins des Wildhammer- und des Bronzebart-Clans gefunden und beschlossen, der Allianz beizutreten.",
                        "FamilyNames" : "Hassschmiede, Dunkelhändler, Feuerschlag, Schmiedezorn"
                    },
                    "Wildhammer" : {
                        "Name" : "Hügelzwerge (Wildhammer-Clan)",
                        "Quote" : "In die Lüfte!",
                        "Description" : "Hügelzwerge stammen vermutlich vom Wildhammer-Clan und dessen Unter-Clans ab. Sie leben auf dem Nistgipfel. Wildhammer-Zwerge gleichen im Erscheinungsbild ihren Cousins aus Eisenschmiede, viele rasieren sich aber die Köpfe kahl und insgesamt sind sie ein schmaler und größer. Das Leben an der Sonne und im stetigen böigen Wind hat ihre Haut dunkler und rauer gemacht. Zwerge des Wildhammer-Clans flechten Perlen und Federn als Glücksbringer in Haare und Bart, die zu den farbigen Tattoos auf ihren Körpern passen, die oft Totems und Kreaturen darstellen, mit denen sie sich verbunden fühlen.",
                        "AbilityScoreIncrease" : "Geist steigt um 1.",
                        "Affiliation" : "Allianz oder unabhängig - Die Wildhammer-Zwerge sind zwar kein Mitglied der Allianz, aber Verbündete die der Allianz im Kriegsfall vermutlich beistehen würden, so wie es in der Vergangenheit bereits geschah. Sie haben keinen guten Draht zu Menschen oder zu den anderen großen Zwergen-Clans. Früher teilten Sie die Liebe zur Natur und den Hass auf das Böse mit den Hochelfen, bevor diese sich zur Sorge der Wildhammer-Zwerge veränderten. Das einzige Volk, das diese Gemeinsamkeiten jetzt noch teilt, sind die Nachtelfen, zu denen dadurch eine gewisse Nähe besteht.",
                        "FamilyNames" : "Bestienklaue, Großbart, Donnerzähmer, Windsäer"
                    }
                }
            },
            "Elf" : {
                "Name" : "Elfen",
                "Description" : "Elfen gehören zu den am längsten bekannten Spezies in Azeroth. Sie sind besonders für ihre scharfen Sinne, unvergleichliche Anmut und Magiebegabung bekannt. Elfen galten einst als die erste Rasse, die die Welt bevölkert hat.",
                "AbilityScoreIncrease" : "Gewandtheit steigt um 2.",
                "Age" : "Obwohl Elfen genau so schnell altern wie Menschen, geht ihre Definition von Reife weit über die körperliche Erscheinung hinaus und bezieht weltliche Erfahrungen mit ein. Ein Hochelf erreicht das Erwachsenenalter in der Regel mit etwa 60 Jahren und wird um die 750 Jahre alt. Ein Nachtelf hingegen gilt ab etwa 300 Jahren als erwachsen, wird aber auch etwa 3.700 Jahre alt. Bis zur Zerstörung des Weltenbaumes waren die Nachtelfen unsterblich.",
                "Affiliation" : "Jede Unterart hat ihre eigene Zugehörigkeit seit den Geschehnissen im großen Krieg der Ahnen.",
                "Size" : "Hochelfen (und daher auch Blut- und Leerenelfen) werden in der Regel um die 1,80 m groß und wiegen je nach Geschlecht zwischen 45 kg und 80 kg. Nachtelfen (und daher auch Nachtgeborene) sind beeindruckende Geschöpfe und werden bis zu 2,15 m groß.",
                "Appearance" : "Männliche Kaldorei sind sehr muskolös. Anhand der kräftigen Oberkörper und breiten Schultern erkennt man ihre Stärke, die mit entsprechender Weisheit einher geht. Weibliche Nachtelfen sind gelenkig und kurvig und besitzen die Muskeln von Akrobaten.",
                "Language" : "Elfisch ist eine flüssige Sprache mit weichen Betonungen und komplizierter Grammatik, besonders auch durch die vielen Dialekte wie z.B. Nazja. Die elfische Literatur ist reichhaltig und abwechslungsreich und ihre Gedichte und Lieder sind unter anderen Rassen sehr beliebt.",
                "Subrace" : "Aufgrund des Mana-Vampirismus unter den Elfen zersplitterte ihre Kultur in verschiedene Unterarten: Hochelfen, Blutelfen, Leerenelfen, Nachtelfen und Nachtgeborene.",
                "Subraces" : {
                    "HighElf" : {
                        "Name" : "Hochelfen (Quel'dorei)",
                        "Quote" : "Für Quel'Thalas!",
                        "Description" : "Hochelfen stammen in der Regel aus Silbermond in Quel'Thalas oder aus Dalaran. Sie sind etwas höher gewachsen als Menschen und sehr schmal, mit scharfen symmetrisch geformten Merkmalen, die ihnen oft das Bild vollkommener Schönheit verleihen. Das Bild der Hochelfen ist sehr einheitlich und wenig komplex. Sie werden durch weiße bis flachsfarbene Haare und unglaublich intensive Augen geprägt, die für den Betrachter von innen heraus zu leuchten scheinen. Obwohl die meisten Hochelfen blaue oder grüne Augen haben, sind violett und rote Augen zumindest nicht unbekannt.",
                        "AbilityScoreIncrease" : "Intelligenz steigt um 1.",
                        "Affiliation" : "Allianz oder unabhängig - Die meisten Hochelfen haben sich in selbst auferlegtes Exil begeben, nachdem sie sich darüber klar wurden, welch Unheil sie durch ihren Missbrauch der arkanen Magie über die Welt von Lordaeron brachten. Während die Menschen die Hochelfen noch immer achten, weil die beiden Völker in den vergangenen Kriegen gegen die brennende Legion stets Seite an Seite kämpften, sind die meisten anderen Rassen nicht sonderlich gut auf die Quel'dorei zu sprechen. Das liegt vor allem auch an den Taten von Kael'thas Sonnenwanderer. Besonders die Nachtelfen meiden die Hochelfen wo sie nur können und begegnen ihren von der Sonne gesegneten Brüdern manchmal sogar mit offener Feindschaft. Die Zeit mag diese Wunden heilen, aber die Nutzung von arkaner Magie wird auf ewig einen Keil zwischen die beiden Arten der Elfen treiben.",
                        "FamilyNames" : "Astwanderer, Morgenklinge, Lichtbringer, Morgengrau, Sonnenschreiter"
                    },
                    "BloodElf" : {
                        "Name" : "Blutelfen (Sin'dorei)",
                        "Quote" : "Magie! Mein Volk ist süchtig danach... Eine Abhängigkeit, die geschaffen wurde, als der Sonnenbrunnen zerstört wurde. - Kael'Thas Sonnenwanderer",
                        "Description" : "Nach dem dritten Krieg waren die Todeszahlen der Hochelfen erdrückend. 90% von ihnen wurden während der Belagerung von Silbermond erschlagen als Quel'Thalas dem Erdboden gleich gemacht wurde. Prinz Kael'Thas Sonnenwanderer gab den Überlebenden seines Volkes nach diesem schrecklichen Ereignis den Namen \"Blutelfen\" (Sin'dorei). Nachdem ihre Heimat zerstört, ihre Wälder nieder gebrannt  und ihr geliebter Sonnenbrunnen besudelt wurde, erlitten die Blutelfen die schlimmste Form von Magie-Entzug. Aufgrund ihrer Abstammung sind Blutelfen und Hochelfen absolut identisch. Trotzdem wurde ihre Kultur durch ihren unstillbaren Durst nach Rache verzerrt. Die meisten von ihnen haben aufgehört, dem Licht zu huldigen, wodurch ihre Treue gegenüber der Allianz schwand. Die meisten von ihnen leiden unter starken psychologischen Auswirkungen des Mana-Vampirismus aufgrund der Zerstörung des Sonnenbrunnens. Spielleiter sollten die optionale Regel \"Magie-Entzug\" bei Blutelfen in Erwägung ziehen.",
                        "Affiliation" : "Horde oder unabhängig - Die meisten Blutelfen sind der Horde beigetreten, nachdem die Banshee-Königin Sylvanas Windläufer sie dazu eingeladen hat."
                    },
                    "NightElf" : {
                        "Name" : "Nachtelfen (Kal'dorei)",
                        "Quote" : "Das Horn hallte wider und ich kehre zurück, so wie es versprochen war. Ich rieche den Gestank von Verfall und Verderbnis in unserem Land. Das erzürnt mich. - Malfurion Stormrage",
                        "Description" : "Als Nachtelf stammst du aus Darnassus in Kalimdor. Die ausgeprägten Augenbrauen, langen spitzen Ohren und die von der Natur geprägte Erscheinung verleihen dieser Rasse eine wilde Anmut. Die Hautfarben der Kaldorei sind so vielfältig wie die Natur selbst. Sie reichen von blassem weiß über blau, bis hin zu rötlichem rot. Die Haare hingegen bewegen sich zwischen hellem weiß, naturbelassenem grün und schimmerndem schwarz.",
                        "AbilityScoreIncrease" : "Sinne steigen um 1.",
                        "Affiliation" : "Allianz oder unabhängig. Die Nachtelfen sind Mitglieder der Allianz, sind aber nicht die am meisten geschätzten Vertreter dieses Bundes und auch nicht die Rasse, denen das meiste Vertrauen entgegen gebracht wird. Obwohl sie sehr ehrenhaft und gerecht sind, hat das natürliche Misstrauen der Nachtelfen die Beziehungen zu den anderen Völkern stets belastet. Gepaart mit ihrer mystischen Erscheinung und rätselhaften Natur kann die Interaktion mit den anderen Mitgliedern der Allianz oft schwierig sein. Es gibt ein starkes Bedürfnis nach Isolation bei den Kaldorei, da sie nur ungern die grünen Nebel von Teldrassil verlassen.",
                        "FamilyNames" : "Mondklinge, Glevensturm, Stolzschreiter, Eichenläufer, Nachtschwinge, Hirschgeweih"
                    },
                    "Nightborne" : {
                        "Name" : "Nachtgeborene (Shal'dorei)",
                        "Quote" : "Meinem Volk steht ein ähnliches Schicksal bevor. Ich sah in alle möglichen Versionen der Zukunft und fand nur eine Antwort... Malfurion Sturmgrimm - Elisande, Großmagistrix der Nachtgeborenen",
                        "Description" : "Als Nachtgeborener stammst du aus der uralten Stadt Suramar und hast dein Leben im Schutze des Nachtbrunnens und seiner Macht verbracht. Der Nachtbrunnen selbst hat Ähnlichkeit mit dem Brunnen der Ewigkeit und ist das Zentrum der arkanen Macht von Großmagistrix Elisande. Die Nachtgeborenen ähneln den Nachtelfen in ihrer Erscheinung, wirken jedoch um einiges dunkler und düsterer. Ihre Haut hat nicht die helleren lila- und pink farbenen Töne der Nachtelfen, stattdessen ist ihre Haut blasser und von dunklem bläulichen oder gräulichen Ton. Die Haare der Shal'dorei sind ebenfalls weniger farbenfroh als die ihrer Vetter und bestehen hauptsächlich aus weißen, grauen, schwarzen und sehr blassen blauen Farben. Glühende Tattoos sind unter den Nachtgeborenen offenbar sehr populär, obwohl nicht bekannt ist, ob sie diese aus kosmetischen Gründen tragen oder ob sie Auswirkungen der magischen Energie des Nachtbrunnens sind. Ihre Augen leuchten in einem sanften blau.",
                        "AbilityScoreIncrease" : "Intelligenz steigt um 1.",
                        "Affiliation" : "Horde oder unabhängig. Als die schützende Kuppel, die Suramar umgab, nach der dritten Invasion der Legion begann, sich aufzulösen, beschlossen die Anführer der Nachtgeborenen gemeinsam, den Schutz aufzugeben und ihr Volk statt der Alternative dem gleichen Entzug auszusetzen, den auch die Hochelfen durchleiden mussten. Die Anführer beschlossen anschließend per Wahlverfahren, dasss sie der Horde beitreten würden und die Nachtgeborenen fanden neue und beständige Verbündete in den Blutelfen, als sie wieder in der Welt von Azeroth Fuß fassten. Die Freigeister unter ihnen streifen durch die Welt und versuchen Wege zu finden, ihren unstillbaren Durst nach Magie zu stillen, bevor er sich zur gleichen Sucht entwickelt, unter der die Blutelfen leiden.",
                        "FamilyNames" : "Moonblade, Glaivestorm, Proudstrider, Oakwalker, Nightwing, Staghorn"
                    }
                }
            }
        },

        "Rules" : {
            "Mechanics" : {
                "AbilityScoreSummary" : {
                    "Label" : "Übersicht der Attributspunkte",
                    "Content" : "",
                    "Blocks" : {
                        "1" : {
                            "Content" : "beschreibt natürliche Sportlichkeit und körperliche Kraft<br>besonders wichtig für: Todesritter, Paladin und Krieger"
                        },
                        "2" : {
                            "Content" : "beschreibt physische Geschicklichkeit, Reflexe, Gleichgewicht und Haltung<br>besonders wichtig für: Jäger, Mönch und Schurke"
                        },
                        "3" : {
                            "Content" : "beschreibt Gesundheitszustand, Ausdauer und Lebenskraft<br>besonders wichtig für: alle"
                        },
                        "4" : {
                            "Content" : "beschreibt mentalen Scharfsinn, Gedächtnis und analytisches Denken<br>besonders wichtig für: Alchemist, Magier, Tüftler"
                        },
                        "5" : {
                            "Content" : "beschreibt Wahrnehmung, Intuition und Weisheit<br>besonders wichtig für: Druide, Priester, Schamane"
                        },
                        "6" : {
                            "Content" : "beschreibt Selbstbewusstsein, Eloquenz und Führungsvermögen<br>besonders wichtig für: Hexer"
                        }
                    }
                },
                "DeterminingAbilityScores" : {
                    "Label" : "Attributspunkte bestimmen",
                    "Blocks" : {
                        "1" : {
                            "Label" : "Fokus und Schwachpunkt",
                            "Content" : "Diese Variante führt zu Charakteren mit klaren Stärken und sichtbaren Schwächen. Wähle einen Fokus (ein Attribut, das besonders hervor sticht) und eine Schwäche (ein Attribut, das besonders schwach ausgeprägt ist), bevor irgendwelche Modifikatoren (z.B. durch die Rasse) angewandt werden.<br><i>Fokus:</i> Setze dieses Attribut auf den Wert 18.<br><i>Schwäche:</i> Setze dieses Attribut auf den Wert 8.<br><br>Setze nun die restlichen Attributspunkte auf den Wert 10 und verteile anschließend 16 Punkte über all deine Attribute hinweg, so wie du es für richtig hältst. Du kannst bestehende Attribute um 2 Punkte verringern und die entsprechenden Punkte auf ein anderes Attribut verteilen."
                        },
                        "2" : {
                            "Label" : "Heroischer Wurf",
                            "Content" : "Diese Variante führt in der Regel zu etwas stärkeren Charakteren als das gewöhnliche Würfeln. Würfle für jeden Attributswert 2W6 + 6."
                        }
                    }
                },
                "Beyond1stLevel" : {
                    "Label" : "Über Stufe 1 hinaus",
                    "Content" : "<p>Die Regeln des \"World of Warcraft 5e RPG\" schließen ebenfalls Systeme für Handwerk und Handwerksklassen mit ein (z.B. den Tüftler oder den Alchemisten). Außerdem gibt es Wege, Reichtum in Charakterstärke zu übertragen (z.B. durch das Talent <a class=\"entity-link inline\" data-pack=\"warcraft5e.feats\" data-id=\"enBseIfaasp0D7xv\">Infusionist</a>). Wenn du einen Charakter über Stufe 1 erschaffen möchtest, halte dich an die folgenden Leitlinien, um den erwarteten Reichtum so zu generieren, dass alle Charaktere etwa den gleichen Stand aufweisen. Schlage in Kapitel 7 unter \"TODO LINK Herstellungskosten und -komplexität von Gegenständen\", um die Seltenheit zu bestimmen. Beachte, dass die Herstellung von Gegenständen etwa die Hälfte des Kaufpreises ausmacht.</p><p>Die Menge an Reichtum, die ein Charakter angehäuft haben kann, ist sehr unterschiedlich. Das hängt vor allem von den anfänglichen Ressourcen, unerwarteten Schätzen während des Abenteuers und von der entsprechenden Zeit ab, um seinem Handwerk oder anderen Verdienstmöglichkeiten nachzugehen, z.B. wenn einem Charakter ein kleines Unternehmen oder eine Siedlung gehört usw...</p>",
                    "Blocks" : {
                        "1" : {
                            "Label" : "Budget magischer Gegenstände",
                            "Content" : "Ein Spielleiter kann über die obige Tabelle den Gesamtwert von magischen Gegenständen ermitteln, die Charaktere besitzen, sofern nicht explizit welche verkauft wurden. In diesem Falle entspricht der Reichtum nicht dem erwarteten Reichtum des Charakters, sondern den Kosten der magischen Gegenstände, die der Charakter auf der entsprechenden Stufe haben sollte. Hiervon eingeschlossen sind unter anderem Geschenke, das Verzaubern von Gegenständen oder ein permanenter Segen oder eine Infusion in einen der Gegenstände im Besitz. Die zu erwartenden Kosten von magischen Gegenständen relativ zu ihrer Seltenheit werden in Kapitel 7 aufgeführt. TODO: Link"
                        },
                        "2" : {
                            "Label" : "Erwartete Ausfallzeiten",
                            "Content" : "Im Falle von Handwerksklassen (Alchemist und Tüftler) oder in Fällen, in denen Charaktere magische Gegenstände (durch das Talent <a class=\"entity-link inline\" data-pack=\"warcraft5e.feats\" data-id=\"enBseIfaasp0D7xv\">Infusionist</a>) herstellen, wird eine Ausfallzeit von etwa 5 Tagen bis zu einer Woche zwischen den Abenteuern (oder aller 3-5 Kämpfe) empfohlen, damit diese Klassen wettbewerbsfähig bleiben. Auf diese Weise können sehr komplexe Projekte, wie z.B. die Fertigung eines Mechs oder eines Fahrzeugs aller 2-3 Abenteuer fertig gestellt werden. Durch diese Balance profitieren Spieler stärker dadurch, Zeit und Geld zu investieren, um genau die Dinge zu kreieren, die sie benötigen. Hierbei ist egal, ob es sich um Schriftrollen, Tränke, Sprengstoffe, Zauber in Zauberbüchern oder um fortgeschrittene Konstruke und Fahrzeuge handelt - wie z.B. den Gyrokopter. Ein gutes Gespür ist dabei äußerst wichtig."
                        }
                    },
                    "TypicalWealth" : "Typischer Reichtum"
                },
                "Advantage" : {
                    "Label" : "Vorteile und Nachteile",
                    "Content" : "<p>Manchmal wird bei Fähigkeiten oder Zaubern angegeben, dass du einen Vorteil oder Nachteil bei einer Probe, einem Rettungswurf oder einem Angriffswurf hast. Das bedeutet, dass du einen zweiten Würfel zusätzlich wirfst. Im Falle eines Vorteils nimmst du anschließend den höheren der beiden Würfel, im Falle eines Nachteils den niedrigeren Wert. Ein Beispiel: Wenn du im Nachteil bist, und du wirfst eine 17 und eine 5, dann gilt die 5. Wenn du allerdings einen Vorteil hast, dann gilt die 17.</p><p>Wenn mehrere Situationen ein und den selben Wurf beeinflussen und du dadurch sozusagen mehrfach im Vorteil oder Nachteil wärest, wird niemals mehr als ein einziger zusätzlicher Würfel geworfen. Würden im oben Falle also zwei weitere Vorteile gelten, dann bliebe es dennoch bei 17 und 5.</p><p>Wenn Umstände dafür sorgen, dass ein einziger Wurf sowohl positiv als auch negativ beeinflusst wird, dann gilt weder ein Vorteil noch ein Nachteil und es wird ganz normal gewürfelt. Das gilt auch, wenn mehrere Umstände zu mehreren Nachteilen führen würden, aber nur ein einziger für einen Vorteil und umgedreht. In diesen Situationen wird normal gewürfelt.</p><p>Wenn du einen Vorteil oder Nachteil hast und eine Fähigkeit ermöglicht dir, deinen Wurf erneut zu würfeln, dann kannst du maximal einen der beiden Würfel erneut würfeln. Du kannst selbst entscheiden, welcher Würfel erneut geworfen wird. Wenn z.B. im obigen Beispiel ein Vorteil gelten würde, könntest du von der 5 und der 17 die 5 erneut Würfeln.</p><p>In der Regel erhältst du einen Vorteil oder Nachteil durch die Nutzung von Spezialfähigkeiten, Aktionen oder Zaubern. Inspiration kann einem Charakter ebenfalls Vorteile gewähren. Der Spielleiter kann ebenfalls entscheiden, dass bestimmte Situationen oder Handlungen zu einem Vor- oder Nachteil führen.</p>"
                },
                "Resistance" : {
                    "Label" : "Widerstand und Anfälligkeit",
                    "Content" : "<p>Manche Kreaturen und Objekte sind ausgesprochen schwer oder erstaunlich leicht mit bestimmten Schadenstypen zu verletzen.</p><p>Wenn solch eine Kreatur oder ein Objekt Widerstand gegenüber einem bestimmten Schadenstyp hat, dann wird der Schaden durch diese Quelle halbiert. Wenn eine Kreatur oder ein Objekt besonders anfällig für eine bestimmte Schadensart ist, wird der entsprechende Schaden dieses Typs verdoppelt.</p><p>Widerstand und Anfälligkeiten werden nach allen anderen Modifikatoren angewandt. Beispiel: Eine Kreatur hat Widerstand gegen Hiebschaden und würde für 25 Hiebschaden verwundet werden. Die Kreatur befindet sich außerdem innerhalb einer magischen Aura, die jeglichen erlittenen Schaden um 5 reduziert. Der Gesamtschaden von 25 wird nun erst um 5 Punkte reduziert, bevor er halbiert wird. Die Kreatur erleidet also 10 Schadenspunkte.</p><p>Mehrere Instanzen von Widerstand oder Anfälligkeit, die sich auf den gleichen Schadenstypen beziehen, zählen lediglich als ein einzelner Einfluss. Wenn eine Kreatur also z.B. Widerstand gegenüber Feuerschaden besitzt und zusätzlich Widerstand gegenüber allem nicht magischen Schaden, dann wird der Schaden trotzdem nur halbiert und nicht weiter reduziert.</p>"
                }
            }
        },

        "Feats" : {
            "CleavingStrike": {
                "Label": "Cleaving Strike",
                "Description": "When you successfully attack and damage a creature with a melee attack, you spend a bonus action to attack another creature you choose that is within 5 feet away from the first target."
            },
            "DieByTheSword" : {
                "Label" : "Die by the Sword",
                "Description" : "You are inspired by battlefield glories, and are able to react quickly to attacks. Whenever a target within 5 feet of you makes a successful attack against you, you gain a d6 Counterattack dice. You may spend the dice to make an attack as a reaction at any point out of your turn so long as the target dealt damage to you in the last minute, and may add the counterattack dice result to the total damage. Unlike with normal reactions, you may apply one strike effect to this attack. You can hold up to 3 Counterattack dice. They all fade within one minute if not consumed."
            },
            "FirstBlood": {
                "Label": "FirstBlood",
                "Description": "You gain a +2 bonus to your attack rolls and can add your Strength modifier to your damage rolls so long as you are targeting a creature that is above half their maximum hit points (or is not Bloodied). This is applied even if you normally add your Agility modifier to damage."
            },
            "Infusionist" : {
                "Label" : "Infusionist",
                "Description" : "You gain proficiency with the infusion skill and can make infused items."
            },
            "MasterOfArms" : {
                "Label" : "Master of Arms",
                "Description" : "When you use a strike effect, you can apply it to all your attacks until the start of your turn in the next round, so long as the strike has sufficient uses."
            },
            "MortalStrike" : {
                "Label" : "Mortal Strike",
                "Description" : "You may severely wound a creature‘s healing capabilities if you successfully apply a mortal strike. If a creature is affected by a Mortal Strike, they must succeed on a Stamina saving throw against a DC equal to 8 + your proficiency bonus + your Strength bonus or take 50% less healing from all sources for one minute. So long as a creature is affected this way, it is always treated as if it is Bloodied for the purposes of your First Blood feature. A creature cannot be affected by this ability more than once in 24 hours."
            },
            "Overpower" : {
                "Label" : "Overpower",
                "Description" : "You may, after successfully damaging an enemy with a melee attack, regain hit points equal to double your Proficiency bonus. You may instead grant half the benefit to any ally within 30 feet. This is a strike effect that costs a bonus action. The enemy must be a qualifying threat to you for you to use this ability. If the target of this strike was also successfully affected by your Mortal Strike feature, you gain double the normal amount of hit points."
            }
        },

        "Traits" : {
            "Adapter" : {
                "Label" : "Anpassungsfähig",
                "Description" : "Du kannst stets reagieren, wenn du im Kampf überrascht wirst (auch wenn deine Wahrnehmungs-Probe fehlgeschlagen ist). Du bist außerdem im <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">Vorteil</a>, wenn es um Wettereinflüsse und -beständigkeit geht."
            },
            "ArcaneAffinity" : {
                "Label" : "Arkane Affinität",
                "Description" : "Du bist besonders affin im Umgang mit arkaner Magie. Du kannst einen der folgenden Vorteile wählen:",
                "Options" : {
                    "1" : "<i>Verstärktes Zauberweben</i>. Du verursachst einen zusätzlichen Punkt Arkanschaden für jeden Würfel Schaden, den du mit deinen arkanen Zaubern verursachst. Dies gilt einmalig pro Zauber. Du kannst diesen Effekt auch bei Zaubern anwenden, die keinen Arkanschaden verursachen - allerdings nur ein einziges mal pro kurzer oder langer Rast.",
                    "2" : "<i>Arkanschlag</i>. Du kannst deine Angriffe mit einer arkanen Explosion verstärken. Dies ist eine \"TODO: Link zur Regel - Schlag-Fertigkeit\", bei der du 1W6 Punkte Arkanschaden zu deinem Nahkampf- oder Fernkampfangriff hinzufügen kannst. Aller 4 Charakter-Stufen erhältst du einen weiteren Würfel dazu. Du musst entscheiden, ob du diese alle für einen Angriff nutzt oder jeweils einen für jeden Angriff. Die Fähigkeit stellt sich nach einer kurzen oder langen Rast wieder her.",
                    "3" : "<i>Energie-Explosion</i>. Du bist in der Lage, eine: TODO: Gleich eigenes Feat dafür anlegen -> ist Schwachsinn mit 'like irgendwas'. You can release a blast of arcane force as if you possessed the Mystic Blast feat (arcane damage only). You may use this blast number of times equal to your Intelligence modifier before replenishing at a long rest. This deals a number of d4 dice equal to onequarter your level (minimum 1d4)."
                }
            },
            "ArcaneLegacy" : {
                "Label" : "Arkanes Erbe",
                "Description" : "Hochelfen besitzen ein einzigartiges Gespür für Magie. Du kannst einen der folgenden Vorteile wählen:",
                "Options" : {
                    "1" : "Du kannst deinen Mana-Pool um 2 Punkte erhöhen.",
                    "2" : "Du kannst einen zusätzlichen Zauberspruch zu [TODO:???????? You add an additional cantrip to your High Magic ability, chosen from the mage spell list.",
                    "3" : "[Nur für Jäger] - Du erhältst das Talent \"Durchdrungene Pfeile\"."
                }
            },
            "BlessingOfTheNightwell" : {
                "Label" : "Segen des Nachtbrunnens",
                "Description" : "Du besitzt natürlichen <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">Widerstand</a> gegen arkane Magie."
            },
            "BloodMagic" : {
                "Label" : "Blutmagie",
                "Description" : "Blutmagie funktioniert wie \"Hohe Magie\" der Hochelfen. Anstelle von blau beginnen bei Nutzung dieses Zaubers die Augen allerdings in sanftem \"Fel\"-grün zu leuchten. Du kannst entscheiden, anstelle der Zauber \"Taschenspielerei\" und \"Verstummen\" die Zauber \"Thaumaturgie\" und \"Manabrand\" zu erlernen."
            },
            "Bravery" : {
                "Label" : "Tapferkeit",
                "Description" : "Du bist bei allen Rettungswürfen gegen Angst im <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">Vorteil</a>."
            },
            "BronzebeardCombatTraining" : {
                "Label" : "Kampfausbildung",
                "Description" : "Du hast Erfahrung im Umgang mit Schusswaffen und Sprengstoffen aller Art, auch wenn du keine Tüftler-Qualitäten besitzt. Du bist geübt im Umgang mit leichter Rüstung."
            },
            "BurningHeart" : {
                "Label" : "Brennendes Herz",
                "Description" : "Du beherrschst den Zauber \"Flammen erzeugen\" (Die Zauberstufe entspricht der Charakter-Stufe). Dein Zauberattribut dafür ist Intelligenz."
            },
            "Darkvision" : {
                "Label" : "Dunkelsicht",
                "Description" : "Du kannst im Dämmerlicht innerhalb von 60 Fuß so sehen als wäre es hell. In Dunkelheit wiederum als würde es dämmern, allerdings kannst du in Dunkelheit keine Farben wahrnehmen."
            },
            "DraeneiCombatTraining" : {
                "Label" : "Kampfausbildung",
                "Description" : "Du hast Erfahrung im Umgang mit Langschwertern, Großhämmern, Gleven und schweren Armbrüsten."
            },
            "DwarvenCombatTraining" : {
                "Label" : "Kampfausbildung",
                "Description" : "Du hast Erfahrung im Umgang mit Kriegsäxten, Handäxten, leichten Hämmern und Kriegshämmern."
            },
            "ElvenCombatTraining" : {
                "Label" : "Kampfausbildung",
                "Description" : "Du hast Erfahrung im Umgang mit Langschwertern, Langbögen, Rapieren und Kurzbögen."
            },
            "ExtraLanguage" : {
                "Label" : "Zusätzliche Sprache",
                "Description" : "Du kannst eine weitere Sprache deiner Wahl sprechen, lesen und schreiben."
            },
            "FelResistance" : {
                "Label" : "Fel-Resistenz",
                "Description" : "Du besitzt natürlichen <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">Widerstand</a> gegen Fel-Magie."
            },
            "FireLordsFavor" : {
                "Label" : "Gunst des Herrn des Feuers",
                "Description" : "Du besitzt natürlichen <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">Widerstand</a> gegen Feuer-Magie."
            },
            "Gemcutting" : {
                "Label" : "Gemmenschneider",
                "Description" : "Du bist geübt im Umgang mit den Werkzeugen für die Edelsteinbearbeitung."
            },
            "GiftOfTheNaaru" : {
                "Label" : "Gabe der Naaru",
                "Description" : "Du kannst deine Aktion dafür verwenden, heilige Energie zu sammeln und den Zauber \"TODO (Link): Erneuerndes Licht (Stufe 1)\" zu wirken. Diese Aktion ist so Kräfte zehrend, dass du dich bei einer kurzen oder langen Rast ausruhen musst, um den Zauber erneut zu wirken. Während eine Kreatur unter dem Einfluss des Zaubers steht, hat sie ein blau glühendes Zeichen über der Stirn, das TODO: ... Licht ausstrahlt (wie \"dancing lights\"). Der entsprechende Zauber-Modifikator deiner Wahl ist Geist oder Charisma."
            },
            "HeroicPresence" : {
                "Label" : "Heroische Präsenz",
                "Description" : "Du kannst 10 Minuten aufwenden, um deine Gefährten zu inspirieren, damit sie mit mehr Zuversicht in den Kampf ziehen. Wähle dazu bis zu 6 befreundete Kreaturen (du kannst auch dich selbst wählen) innerhalb von 30 Fuß. Sie müssen dich sehen oder hören (und verstehen) können. Jede Kreatur erhält vorübergehende Lebenspunkte, die deiner Charakterstufe + der Hälfte deines Geist- oder Charisma-Modifikators entsprechen. Eine Kreatur kann auf diese Weise keine weiteren temporären Lebenspunkte erhalten, bis sie eine lange Rast hinter sich gebracht hat. Alternativ kannst du diese Fähigkeit einsetzen, wenn du einen kritischen Treffer im Kampf landest."
            },
            "HighMagic" : {
                "Label" : "Hohe Magie",
                "Description" : "Du beherrschst den Zauber \"Taschenspielerei\" (Die Zauberstufe entspricht deiner Charakter-Stufe). Mit Stufe 3 kannst du \"Magie erkennen\" als Stufe 1 Zauber wirken. Wenn du Stufe 5 erreichst, erlernst du den Zauber \"TODO: Verstummen\" als Stufe 2 Zauber. Das entsprechende Attribut für diese Zauber ist Intelligenz und du benutzt deinen normalen Mana-Pool, um diese Zauber zu wirken, auch wenn du normalerweise kein Zauberwirker bist. Sobald du diese Fähigkeiten nutzt, beginnen deine Augen für die nächste Stunde in einem blassen blau zu leuchten. Wenn du diese Zauber bereits anderweitig gelernt hast und die entsprechende Stufe erreicht hast, kannst du sie immer ohne Mana-Kosten vorbereiten."
            },
            "KeenSenses" : {
                "Label" : "Scharfe Sinne",
                "Description" : "Du bist geübt in der Fähigkeit Wahrnehmung."
            },
            "MountainBorn" : {
                "Label" : "Kind der Berge",
                "Description" : "Du kommst problemlos mit Höhen zurecht und bist es gewohnt in bis zu 6.000 m Höhe zu leben. Du bist außerdem an kaltes Wetter angepasst, daher bereitet es dir beim Erkunden der Wildnis keine Probleme."
            },
            "MaskOfTheWild" : {
                "Label" : "Verborgenheit der Natur",
                "Description" : "Du kannst versuchen dich zu verstecken, selbst wenn du eigentlich nur leicht von Laub, starkem Regen, fallendem Schnee, Nebel oder anderen natürlichen Phänomenen verdeckt wirst."
            },
            "MysticSenses" : {
                "Label" : "Mystische Sinne",
                "Description" : "Immer wenn du eine Probe auf die Herkunft von magischen Gegenständen, Überlieferungen oder Zaubern ablegst, giltst du als Experte für Zauberkunde."
            },
            "NaturalArmor" : {
                "Label" : "Natürliche Rüstung",
                "Description" : "Deine Haut ist so zäh wie gehärtetes Leder. Wenn du keine Rüstung trägst, entspricht dein Verteidigungswert 12 + Gewandtheits-Modifikator. Du kannst diesen natürlichen Bonus dazu verwenden, deinen Verteidigungswert zu ermitteln, wenn die Rüstung, die du trägst, einen geringeren Verteidigungswert verursachen würde. Die Vorteile von Schilden gelten uneingeschränkt."
            },
            "NaturalHandler" : {
                "Label" : "Händchen für Tiere",
                "Description" : "Du bist geübt im Umgang mit Tieren. Wenn du diese Fähigkeit bereits anderweitig erworben hast, hast du sie im Umgang mit Bergbewohnern, wie z.B. Greifen oder Berglöwen gemeistert."
            },
            "NatureResistance" : {
                "Label" : "Natur-Resistenz",
                "Description" : "Du bist im <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">Vorteil</a> bei Rettungswürfen gegen Gift und besitzt besonderen <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">Widerstand</a> gegen Blitz- und Giftschaden."
            },
            "NightfallenMagic" : {
                "Label" : "Nightfallen Magic",
                "Description" : "You know the mage hand cantrip and can cast it normally (caster level equal to your character level). When you reach 3rd level, you can also cast detect magic as a 1st level spell. When you reach 5th level, you can also cast the arcane explosion spell as a 2nd level spell. Intelligence is your spellcasting ability for these spells, and you use your mana pool for these abilities (even if you are not normally a spellcaster). While you use such abilities (and after using them for one hour), your eyes glow a light blue. If you can already cast such spells (and have a sufficiently high caster level), they are always prepared for free."
            },
            "Resilience" : {
                "Label" : "Unverwüstlich",
                "Description" : "Du bist im <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">Vorteil</a> gegen Gifte und besitzt besonderen <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">Widerstand</a> gegen Giftschaden."
            },
            "Shadowmeld" : {
                "Label" : "Mit den Schatten verschmelzen",
                "Description" : "Wenn du dich in schwachem Licht oder Dunkelheit befindest, erlangst du einen <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">Vorteil</a> bei Verstohlenheits-Proben. (TODO: Agility (Stealth))"
            },
            "Stalker" : {
                "Label" : "Pirscher",
                "Description" : "Du bist geübt in den Fähigkeiten Wahrnehmung und Verstohlenheit. Wenn du diese Fähigkeiten bereits anderweitig erworben hast, hast du sie hiermit gemeistert."
            },
            "Stonecunning" : {
                "Label" : "Steinschläue",
                "Description" : "Immer wenn du eine Intelligenz-Probe (Geschichte) oder Bergarbeits-Probe ablegst, die sich auf Steinarbeiten oder Mineralien bezieht, dann bist du geübt und Experte in Geschichte oder Bergarbeit. (Deine Wahl)"
            },
            "Stoneform" : {
                "Label" : "Steinform",
                "Description" : "Du kannst dich gelegentlich darauf konzentrieren, Wunden zu ignorieren. Wenn du Schaden erleidest, kannst du deine Reaktion nutzen, um einen W12 zu würfeln. Addiere deinen Ausdauer-Modifikator, um den Schaden um diese Summe zu reduzieren. Wenn der Wert noch andauernden Blutungsschaden übersteigt, wird auch die Blutung sofort gestillt. Diese Fertigkeit regeneriert sich bei einer kurzen oder langen Rast."
            },
            "ToolProficiency" : {
                "Label" : "Umgang mit Werkzeugen",
                "Description" : "Du bist geübt im Umgang mit den Werkzeugen für einen der folgenden Berufe: Schmied, Braumeister, Steinmetz oder Bergarbeiter."
            }
        },

        "SkillSheet" : {
            "Category" : "Kategorie"
        },

        "Skills" : {
            "SuffusedArrows" : {
                "Label" : "Durchdrungene Pfeile",
                "Description" : "Du hast die Fähigkeit gemeistert, Zauber durch deine Projektile wirken zu lassen oder Magie in diese einzubinden. Wähle eine der beiden Optionen:",
                "Options" : {
                    "1" : "Du bist geübt im Umgang mit Infusions-Werkzeug, kannst aber nur Pfeile oder [TODO: Wurfwaffen - stimmt das?] damit verzaubern. Du beginnst mit drei Infusions-Matrizen deiner Wahl (die du herstellen kannst) und kannst diese in Infusions-Anleitungen oder ähnlichen Handbüchern verewigen. Obwohl das aus dem Namen des Talents nicht hervor geht, bezieht sich die Fähigkeit auch auf alle anderen Arten von Munition und [TODO: Wurfwaffen???], wie z.B. Armbrustbolzen, Kugeln und ihre größeren Verwandten, wie z.B. Ballista-Bolzen oder Kanonenkugeln. TODO:Proficiency Link",
                    "2" : "Du erhältst das Talent \"TODO: Zauberschlag\" (nur für Fernkampfwaffen)."
                }
            }
        },

        "SkillCategories" : {
            "General" : "Allgemein"
        },

        "SpellSheet" : {
            "School" : "Zauberschule",
            "CastTime" : "Zauberzeit",
            "Range" : "Reichweite",
            "Components" : "Bestandteile",
            "Duration" : "Dauer",
            "Classes" : "Klassen",
            "Heightened" : "Erhöhte Wirkung"
        },

        "Spells" : {
            "DetectMagic" : {
                "Label" : "Magie erkennen",
                "Description" : "Solange der Zauber andauert, kannst du Magie innerhalb von 30 Fuß um dich herum spüren. Du kannst eine Aktion aufwenden, um eine schwache Aura um alle sichtbaren Kreaturen oder Objekte herum zu erkennen, die von Magie durchdrungen sind. Falls die Magie ihren Ursprung in einer der Zauberschulen hat, kannst du diesen Ursprung ergründen. Der Zauber durchdringt die meisten Barrieren, wird aber von 30 cm (1 Fuß) dicken Mauern, 2,5 cm dickem gewöhnlichem Metall, einer dünnen Bleiverkleidung oder z.B. 4,5 m (3 Fuß) dickem Holz oder Erde aufgehalten."
            },
            "ManaBurn" : {
                "Label" : "TODO: Mana Burn",
                "Description" : "You target a creature that has mana within 30 feet. A ray of black-purple anti-magic leaps out, and strikes the target, draining them of mana. You must make a ranged spell attack with the ray. On a success, the target loses 1d4 + 1 mana points. For every mana point lost, the target takes two points of arcane damage. The target is entitled a Spirit saving throw. On a success, the mana and hit points lost are halved.",
                "Heightened" : "The number of mana points drained increases by 1d4 points per every two levels above 2 (2d4 at level 4, 3d4 at level 6, 4d4 at level 8). Special: Demons always have active mana, and can always be targeted with mana burn. If they have no mana, they still take 2 points of arcane damage."
            },
            "Mute" : {
                "Label" : "Verstummen",
                "Description" : "Konzentriere dich bis zu einer Minute lang auf ein Ziel in Reichweite. Bei einem verpatzten Rettungswurf (Geist) wird das Ziel von allen Geräuschen isoliert, sodass es stumm und taub ist. Dadurch kann das Ziel keine verbalen Komponenten von Zaubern mehr nutzen. Das Ziel wird immun für die Effekte von Magie, die Donnerschaden verursacht, solange die Zauberstufe des Zaubers nicht die Stufe des \"Verstummen\"-Zaubers überschreitet.",
                "Heightened" : "Für alle zwei Zauberstufen kannst du ein weiteres Ziel innerhalb von 30 Fuß des ursprünglichen Ziels wählen, das den gleichen Effekt erleidet. (2 Kreaturen auf Stufe 4, 3 Kreaturen auf Stufe 6, 4 Kreaturen auf Stufe 8)"
            },
            "ProduceFlame" : {
                "Label" : "Flammen erzeugen",
                "Description" : "Eine flackernde Flamme erscheint in deiner Hand. Solange sie in deiner Hand tanzt, schadet sie weder dir noch deiner Ausrüstung. Die Flamme spendet Licht in einem Radius von 10 Fuß und schwaches Licht in weiteren 10 Fuß. Der Zauber endet, wenn du ihn als Aktion frei gibst oder ihn erneut wirkst. Du kannst die Flamme auch zum Angriff einsetzen. Auch hierbei erlischt die Flamme anschließend. In dem Moment, in dem du den Zauber wirkst, oder auf Kosten einer Aktion in einem späteren Zug, kannst du die Flamme auf eine Kreatur innerhalb von 30 Fuß Entfernung schleudern. Führe dazu einen Fernangriff aus. Bei einem Treffer erleidet das Ziel 1W8 Feuerschaden. Der Schaden steigt bei Stufe 5 auf 2W8, bei Stufe 11 auf 3W8 und bei Stufe 17 auf 4W8."
            },
            "Prestidigitation" : {
                "Label" : "Taschenspielerei",
                "Description" : "Dieser Zauber ist ein winziger magischer Trick, den Zauberlehrlinge zum Üben verwenden. Du kannst damit innerhalb von 10 Fuß einen der nachfolgenden Effekte erzielen. Wenn du diesen Zauber mehrere male wirkst, kannst du bis zu drei der nicht-spontanen Effekte gleichzeitig aufrecht erhalten. Einen dieser Effekte zu beenden, ist eine normale Aktion.",
                "Options" : {
                    "1" : "Du erzeugst spontan einen harmlosen Effekt, der die Sinne täuscht, wie z.B. Gänsehaut, einen Windhauch, ein leises Notenspiel oder einen seltsamen Duft.",
                    "2" : "Du kannst spontan eine kleine Flamme herbei zaubern oder löschen, um z.B. eine Kerze, eine Fackel oder ein kleines Lagerfeuer zu entzünden.",
                    "3" : "Du kannst spontan einen Gegenstand säubern oder beschmutzen, der nicht größer als ein 35 cm langer Würfel ist.",
                    "4" : "Du kannst nicht lebendige Materie abkühlen oder erwärmen, wenn sie nicht größer als ein 35 cm langer Würfel ist.",
                    "5" : "Du kannst eine Farbe, ein kleines Zeichen oder ein Symbol auf der Oberfläche eines beliebigen Gegenstandes erzeugen.",
                    "6" : "Du kannst ein nichtmagisches Schmuckstück oder ein illusorisches Bild beschwören, das in deine Hand passt. Du kannst es bis zum Ende deiner nächsten Runde aufrecht erhalten."
                }
            },
            "Silence" : {
                "Label" : "Stille",
                "Description" : "An einem Zielort innerhalb der Reichweite entsteht eine Sphäre mit 20 Fuß Durchmesser, die kein Geräusch durchdringt und in der Geräusche aufhören zu existieren, so als wären alle innerhalb des betreffenden Bereiches taub. Jede Kreatur, die sich komplett innerhalb der Sphäre befindet, ist immun gegen Donnerschaden. Einen Zauber zu wirken, der eine verbale Komponente beinhaltet, ist in der Sphäre unmöglich."
            },
            "Thaumaturgy" : {
                "Label" : "Thaumaturgie",
                "Description" : "Du manifestierst innerhalb der Reichweite ein geringes Wunder, ein Zeichen von übernatürlichen Kräften. Du kannst einen der folgenden magischen Effekte bewirken. Wenn du diesen Zauber mehrere male wirkst, kannst du bis zu drei der Effekte, die eine Minute andauern, gleichzeitig aufrecht erhalten. Einen dieser Effekte zu beenden, ist eine normale Aktion.",
                "Options" : {
                    "1" : "Deine Stimme hallt drei mal so laut wie gewöhnlich für bis zu einer Minute.",
                    "2" : "Du kannst bis zu eine Minute lang Flammen manipulieren. Du kannst Flammen zum flackern bringen, ihre Farbe ändern oder bewirken, dass sie stärker oder weniger hell leuchten.",
                    "3" : "Für bis zu einer Minute kannst du den Boden sanft zum Zittern bringen.",
                    "4" : "Du erzeugst sofort ein Geräusch, das von einem Punkt innerhalb deiner Reichweite ausgeht. z.B: Donnergrollen, das Krächzen eines Raben oder unheilvolles Flüstern.",
                    "5" : "Du kannst spontan dafür sorgen, dass sich eine nicht verschlossene Tür auf geschwungen oder zu geschlagen wird.",
                    "6" : "Du kannst für bis zu eine Minute lang die Farbe deiner Augen ändern."
                }
            }
        },

        "SpellRules" : {
            "SpellSchools" : {
                "Abjuration" : "Schutz",
                "Conjuration" : "Beschwörung",
                "Divination" : "Wahrsagerei",
                "Enchantment" : "Verzauberung",
                "Evocation" : "Elemente",
                "Illusion" : "Illusion",
                "Necromancy" : "Nekromantie",
                "Transmutation" : "Verwandlung"
            },
            "Range" : {
                "Self" : "du selbst"
            },
            "Components" : {
                "Somatic" : "Gesten",
                "Verbal" : "Geräusche"
            },
            "SpellCategories" : {
                "Strike" : "Strike spells modify a successful attack. See Chapter 9 for more details on strike effects. Strike and shot effects also usually a potential number of attacks equal to double the spell level. For instance, using kill shot as a 2nd level spell enhances 4 ranged attacks. The caster can have multiple potential strikes active, but cannot apply two shot or strike abilities to the same attack unless otherwise specified."
            }
        },

        "UI": {
            "Actions" : {
                "NoToken" : "Du hast kein Token ausgewählt. Bitte wähle ein gültiges Token.",
                "CastSpell" : "Du wirkst den Zauber",
                "CastSpellError" : "Du bist nicht in der Lage, diesen Zauber zu wirken: ",
                "CastSpellInvalidTarget" : "Ungültiges Ziel. Bitte wähle ein einzelnes feindliches Token.",
                "OutOfRange" : "Das Ziel befindet sich außer Reichweite. Distanz:"
            },
            "Units" : {
                "Action" : "Aktion",
                "Ft" : "Fuß",
                "Hour" : "Stunde",
                "Instant" : "Sofort",
                "Minute" : "Minute",
                "Minutes" : "Minuten",
                "Gp" : "Goldstücke"
            },
            "Phrases" : {
                "Skill" : "Fähigkeit",
                "Spell" : "Zauber"
            },
            "Dialogs" : {
                "CancelSkill" : "beenden",
                "CancelSkillDescription" : "Möchtest du die Auswirkungen der Fähigkeit wirklich beenden?"
            }
        }
    }
}