{
    "WC5E" : {

        "Languages" : {
            "Common" : "Gemeinsprache",
            "Dwarven" : "Zwergisch",
            "Elven" : "Elfisch",
            "Eredun" : "Eredonisch"
        },

        "CharacterSheet" : {
            "HitPoints" : "Lebenspunkte"
        },

        "Class" : {
            "Alchemist" : {
                "Name" : "Alchemist"
            },
            "DeathKnight" : {
                "Name" : "Todesritter"
            },
            "Druid" : {
                "Name" : "Druide"
            },
            "Hunter" : {
                "Name" : "Jäger"
            },
            "Mage" : {
                "Name" : "Magier"
            },
            "Paladin" : {
                "Name" : "Paladin"
            },
            "Priest" : {
                "Name" : "Priester"
            },
            "Shaman" : {
                "Name" : "Schamane"
            },
            "Warlock" : {
                "Name" : "Hexer"
            }
        },

        "RaceSheet" : {
            "AbilityScoreIncrease" : "Attributs-Modifikator",
            "Age" : "Alter",
            "Traits" : "Merkmale",
            "Affiliation" : "Zugehörigkeit",
            "Size" : "Größe",
            "Appearance" : "Erscheinung",
            "Speed" : "Tempo",
            "SpeedVal" : "Das Grund-Tempo beträgt ",
            "Languages" : "Sprachen",
            "Subrace" : "Unterarten",
            "SubraceChoice" : "Wähle eine der folgenden Unterarten.",
            "MaleNames" : "Männernamen",
            "FemaleNames" : "Frauennamen",
            "FamilyNames" : "Familiennamen"
        },

        "Race" : {
            "Draenei" : {
                "Description" : "Die Draenei sind eine stämmig gebaute außerirdische Rasse, die vom Planeten Argus stammt. Sie sind sehr stark mit der Magie im Einklang und neigen zum ausgesprochen Guten oder Bösen. Draenei, die der Fel-Magie anheim fallen, bilden die Ränge der Eredar, den größten Generälen der brennenden Legion. Draenei, die wiederrum dem heiligen Licht dienen, sind unsterbliche Kreuzritter im Dienste der Gerechtigkeit - überall im Universum.",
                "AbilityScoreIncrease" : "Geist oder Intelligenz steigen um 1.",
                "Age" : "Ein typischer Draenei gilt ab 100 Jahren als erwachsen und kann bis zu 10.000 Jahre alt werden.",
                "Affiliation" : "Jede Draeneifraktion hat ihre eigene Zugehörigkeit.",
                "Size" : "Medium - Männliche Draenei werden zwischen 2,15 m und 2,50 m groß und wiegen im Durchschnitt zwischen 135 kg und 180 kg. Ihre weiblichen Gegenstücke werden nur zwischen 1,80 m und 2,10 m groß und wiegen zwischen 75 kg und 115 kg.",
                "Appearance" : "Passend zu ihrer Eredar-Herkunft haben Draenei anstelle von Füßen schwere Hufe, Ranken, die ihnen aus dem Nacken wachsen und kurze Schwänze. Ihre Hautfarbe wird geprägt von den magischen Einflüssen, denen sie ausgesetzt sind. Fel-Magie färbt ihre Haut rot, heilige Magie färmt sie blau bis violett und Leeren-Magie verdunkelt sie bis zu einem Braun-Ton. Die Schädel der Männer sind durchzogen von Knochenplatten der Stirn und dadurch sehr robust. Weiblichen Draenei hingegen wachsen lange geschwungene und anmutige Hörner. Die 'Zerschlagenen' sehen etwas anders aus als gewöhnliche Draenei. Aufgrund ihrer Mutationen haben sie flache Gesichter ohne Knochenplatten, ohne Nasen und ihre dicken Hände haben nur drei Finger.",
                "Language" : "Die eredonische Draenei-Sprache ist ein abgewandelter Dialekt, der weniger korrumpiert ist. Die Sprache verursacht daher keine Nachteile, wenn sie verwendet wird, kann allerdings von Dämonen verstanden werden.",
                "FamilyNames" : "Draenei tragen keine Familiennamen, aber sie erlangen Titel, die ihren namenhaften Taten entsprechen.",
                "Subrace" : "Längst vergangene Ereignisse teilen die Draenei in zwei Unterarten: Die \"Ungebrochenen\" und die \"Zerschlagenen\".",
                "Subraces" : {
                    "Broken" : {
                        "Name" : "Die Zerschlagenen (Krokul)",
                        "Quote" : "Ihr werdet unsere Wege kennen lernen...",
                        "Description" : "Die Zerschlagenen, auf eredonisch als die Krokul bekannt, sind eine mutierte und degenerierte Unterart der Draenei, die in der Scherbenwelt leben. So wie die meisten Orks fielen die Krokul dem Einfluss der finsteren Dämonen anheim und wurden durch die Verderbnis verändert. Obwohl sie einige ihrer ursprünglichen Kräfte verloren haben, stellen die Zerschlagenen noch immer eine Bedrohung für alle Lebewesen in der Scherbenwelt dar. Die größte bekannte Fraktion sind die Todeshörigen der Aschezungen, die von Akama angeführt werden. Sie sind vermutlich mit Illidan Sturmgrimm verbündet.",
                        "AbilityScoreIncrease" : "Gewandtheit steigt um 2.",
                        "Affiliation" : "Unabhängig - Trotz des größtenteils versehentlichen Rückschritts zu Zerschlagenen, wird dieser Unterart von den meisten Draenei nicht nur misstraut, es schlägt ihnen sogar offene Feindschaft entgegen. Obwohl das zumindest bei den Zerschlagenen verständlich ist, die noch unter dem Einfluss der Verderbnis stehen oder noch immer der brennenden Legion dienen, könnte man von den Ungebrochenen dennoch erwarten, dass sie ihre eigenen Leute nach dem Genozid der Orks willkommen heißen. Die meisten Zerschlagenen sind daher unabhängig, auch wenn es Bemühungen von Prophet Velen gibt, sie wieder zurück zu führen."
                    },
                    "Unbroken" : {
                        "Name" : "Die Ungebrochenen (wahre Draenei)",
                        "Quote" : "Das Ende der brennenden Legion rückt näher.",
                        "Description" : "Als erleuchtete Cousins der Eredar, sind die Draenei nach der erneuten Öffnung des dunklen Portals in Azeroth aufgetaucht. Da sie die letzten Jahrhunderte im Exil und auf der Flucht vor der brennenden Legion verbracht haben, sind die Draenei standhafte Streiter für das Licht und werden alles tun was in ihrer Macht steht, um zu verhindern, dass eine weitere Welt den Flammen anheim fällt.",
                        "AbilityScoreIncrease" : "Stärke steigt um 2.",
                        "Affiliation" : "Allianz - Die Ungebrochenen haben gemerkt, dass sie starke Bande mit den Menschen und Zwergen teilen, da sie ebenfalls das Licht anbeten. Außerdem fühlen sie mit den nun sterblichen Nachtelfen."
                    }
                }
            },
            "Dwarf" : {
                "Name" : "Zwerge",
                "Description" : "Zwerge sind kleine und kräftige Kreaturen, die hauptsächlich das Reich Khaz Modan bewohnen, welches in den östlichen Königreichen liegt. Sie sind kleiner als Menschen, aber größer als Gnome und verlassen sich - wenn sie können - auf ihre geringe Körpergröße, bzw. auf ihre Robustheit und Stärke, wenn die nicht hilft. Der durchschnittliche Zwerg ist zuverlässig, wachsam und ruhig.",
                "AbilityScoreIncrease" : "Ausdauer steigt um 2.",
                "Age" : "Zwerge altern genau so schnell wie Menschen, gelten aber als Jünglinge, bis sie das Alter von 40 erreichen. Im Durchschnitt werden Zwerge bis zu 450 Jahre alt.",
                "Affiliation" : "Jede Unterart hat ihre eigene Zugehörigkeit, seit das Volk der Zwerge im Krieg der drei Hämmer auseinander brach.",
                "Size" : "Medium - Zwerge werden zwischen 1,20 m und 1,50 m groß und wiegen zwischen 70 kg und 110 kg.",
                "Appearance" : "Männliche Zwerge neigen dazu, sich lange Haare und Bärte wachsen zu lassen, die sie in verzierte Zöpfe flechten. Weibliche Zwerge haben ebenfalls stabile, aber vor allem dralle Körper - allerdings ohne Bartwuchs, auch wenn andere Rassen das oft behaupten.",
                "SpeedAddition" : "Zwerge werden nicht durch das Tragen von schweren Rüstungen verlangsamt.",
                "Language" : "Zwergisch besteht zu Großteilen aus harten Konsonanten und kehligen Lauten. Diese Eigenarten übertragen sich auf alle weiteren Sprachen, die ein Zwerg sprechen könnte.",
                "Subrace" : "Drei Unterarten von Zwergen bevölkern die Welt von Azeroth: Die Hügelzwerge des Wildhammer-Clans, die Bergzwerge des Bronzebart-Clans und die dunklen Zwerge des Dunkeleisen-Clans.",
                "Subraces" : {
                    "Bronzebeard" : {
                        "Name" : "Bergzwerge (Bronzebart-Clan)",
                        "Quote" : "Für Khaz Modan!",
                        "Description" : "Die meisten Bergzwerge leben in Khaz Modan und stammen in der Regel vom Bronzebart-Clan und dessen Unter-Clans ab. Die Zwerge aus Eisenschmiede sind massig und kräftig gebaut. Sie haben kurze muskolöse Körper und tragen ihr Haar in verzierten Zöpfen.",
                        "AbilityScoreIncrease" : "Stärke steigt um 1.",
                        "Affiliation" : "Allianz - Obwohl die Zwerge aus Eisenschmiede die kriegerischen Fähigkeiten der Horde respektieren, misstrauen sie speziell den Orks, Trollen und Verlassenen. Auch die Elfen aus Quel'Thalas halten die Zwerge auf einer Armlänge Abstand, trotz der diplomatischen- und Handelsbeziehungen, die sie mit ihnen pflegen. Obwohl sie die gleiche Gefolgschaft mit den Nachtelfen teilen, betrachten begegnen die Zwerge ihnen mit Argwohn und Beklommenheit. Die Menschen hingegen sind zuverlässige und stete Verbündete des Zwergenvolks und stoßen auf deren Gunst und Güte, wenn sie im Zwergenreich willkommen geheißen werden.",
                        "FamilyNames" : "Donnerschmiede, Bronzebart, Hammergrim, Dornenstahl, Donnerleib"
                    },
                    "DarkIron" : {
                        "Name" : "Dunkelzwerge (Dunkeleisen-Clan)",
                        "Quote" : "Ihr sollt dienen.",
                        "Description" : "Dunkelzwerge stammen in der Regel vom Dunkeleisen-Clan ab, der vom Zauberer-Than Thaurissan angeführt wird. Als Verräter der eigenen Rasse beschimpft, leben sie als Sklaven des großen elementaren Herrn des Feuers, Ragnaros, in den Hallen des Schwarzfelsen. Dort dienen sie im Verborgenen dem Vulkan. Dunkelzwerge sehen den Zwergen des Bronzebart-Clans in ihrer Erscheinung sehr ähnlich, abgesehen davon, dass ihre Haut aschfahl bis grau ist und ihre Augen rot-golden leuchten. Zwerge des Dunkeleisen-Clans können oft in die Tiefen ihres Wesens vordringen und Flammen beschwören. Aufgrund ihrer rauen und heiseren Stimmen und ihrer mürrischen Neigung zu Gemecker, erwecken sie nicht gerade Vertrauen.",
                        "AbilityScoreIncrease" : "Intelligenz steigt um 1.",
                        "Affiliation" : "Allianz oder unabhängig - Hass gegenüber allen Rassen treibt die Zwerge des Dunkeleisen-Clans an. In ihrem Dienst für Ragnaros sehen sie ausschließlich Rivalen, Sklaven und Feinde. Einige wenige von ihnen haben Gemeinsamkeiten mit ihren Cousins des Wildhammer- und des Bronzebart-Clans gefunden und beschlossen, der Allianz beizutreten.",
                        "FamilyNames" : "Hassschmiede, Dunkelhändler, Feuerschlag, Schmiedezorn"
                    },
                    "Wildhammer" : {
                        "Name" : "Hügelzwerge (Wildhammer-Clan)",
                        "Quote" : "In die Lüfte!",
                        "Description" : "Hügelzwerge stammen vermutlich vom Wildhammer-Clan und dessen Unter-Clans ab. Sie leben auf dem Nistgipfel. Wildhammer-Zwerge gleichen im Erscheinungsbild ihren Cousins aus Eisenschmiede, viele rasieren sich aber die Köpfe kahl und insgesamt sind sie ein schmaler und größer. Das Leben an der Sonne und im stetigen böigen Wind hat ihre Haut dunkler und rauer gemacht. Zwerge des Wildhammer-Clans flechten Perlen und Federn als Glücksbringer in Haare und Bart, die zu den farbigen Tattoos auf ihren Körpern passen, die oft Totems und Kreaturen darstellen, mit denen sie sich verbunden fühlen.",
                        "AbilityScoreIncrease" : "Geist steigt um 1.",
                        "Affiliation" : "Allianz oder unabhängig - Die Wildhammer-Zwerge sind zwar kein Mitglied der Allianz, aber Verbündete die der Allianz im Kriegsfall vermutlich beistehen würden, so wie es in der Vergangenheit bereits geschah. Sie haben keinen guten Draht zu Menschen oder zu den anderen großen Zwergen-Clans. Früher teilten Sie die Liebe zur Natur und den Hass auf das Böse mit den Hochelfen, bevor diese sich zur Sorge der Wildhammer-Zwerge veränderten. Das einzige Volk, das diese Gemeinsamkeiten jetzt noch teilt, sind die Nachtelfen, zu denen dadurch eine gewisse Nähe besteht.",
                        "FamilyNames" : "Bestienklaue, Großbart, Donnerzähmer, Windsäer"
                    }
                }
            },
            "Elf" : {
                "Description" : "Elfen gehören zu den am längsten bekannten Spezies in Azeroth. Sie sind besonders für ihre scharfen Sinne, unvergleichliche Anmut und Magiebegabung bekannt. Elfen galten einst als die erste Rasse, die die Welt bevölkert hat.",
                "AbilityScoreIncrease" : "Gewandtheit steigt um 2.",
                "Age" : "Obwohl Elfen genau so schnell altern wie Menschen, geht ihre Definition von Reife weit über die körperliche Erscheinung hinaus und bezieht weltliche Erfahrungen mit ein. Ein Hochelf erreicht das Erwachsenenalter in der Regel mit etwa 60 Jahren und wird um die 750 Jahre alt. Ein Nachtelf hingegen gilt ab etwa 300 Jahren als erwachsen, wird aber auch etwa 3.700 Jahre alt. Bis zur Zerstörung des Weltenbaumes waren die Nachtelfen unsterblich.",
                "Affiliation" : "Jede Unterart hat ihre eigene Zugehörigkeit seit den Geschehnissen im großen Krieg der Ahnen.",
                "Size" : "Hochelfen (und daher auch Blut- und Leerenelfen) werden in der Regel um die 1,80 m groß und wiegen je nach Geschlecht zwischen 45 kg und 80 kg. Nachtelfen (und daher auch Nachtgeborene) sind beeindruckende Geschöpfe und werden bis zu 2,15 m groß.",
                "Appearance" : "Männliche Kaldorei sind sehr muskolös. Anhand der kräftigen Oberkörper und breiten Schultern erkennt man ihre Stärke, die mit entsprechender Weisheit einher geht. Weibliche Nachtelfen sind gelenkig und kurvig und besitzen die Muskeln von Akrobaten.",
                "Language" : "Elfisch ist eine flüssige Sprache mit weichen Betonungen und komplizierter Grammatik, besonders auch durch die vielen Dialekte wie z.B. Nazja. Die elfische Literatur ist reichhaltig und abwechslungsreich und ihre Gedichte und Lieder sind unter anderen Rassen sehr beliebt.",
                "Subrace" : "Aufgrund des Mana-Vampirismus unter den Elfen zersplitterte ihre Kultur in verschiedene Unterarten: Hochelfen, Blutelfen, Leerenelfen, Nachtelfen und Nachtgeborene.",
                "Subraces" : {
                    "HighElf" : {
                        "Name" : "Hochelf (Quel'dorei)",
                        "Quote" : "Für Quel'Thalas!",
                        "Description" : "Hochelfen stammen in der Regel aus Silbermond in Quel'Thalas oder aus Dalaran. Sie sind etwas höher gewachsen als Menschen und sehr schmal, mit scharfen symmetrisch geformten Merkmalen, die ihnen oft das Bild vollkommener Schönheit verleihen. Das Bild der Hochelfen ist sehr einheitlich und wenig komplex. Sie werden durch weiße bis flachsfarbene Haare und unglaublich intensive Augen geprägt, die für den Betrachter von innen heraus zu leuchten scheinen. Obwohl die meisten Hochelfen blaue oder grüne Augen haben, sind violett und rote Augen zumindest nicht unbekannt.",
                        "AbilityScoreIncrease" : "Intelligenz steigt um 1.",
                        "Affiliation" : "Allianz oder unabhängig - Die meisten Hochelfen haben sich in selbst auferlegtes Exil begeben, nachdem sie sich darüber klar wurden, welch Unheil sie durch ihren Missbrauch der arkanen Magie über die Welt von Lordaeron brachten. Während die Menschen die Hochelfen noch immer achten, weil die beiden Völker in den vergangenen Kriegen gegen die brennende Legion stets Seite an Seite kämpften, sind die meisten anderen Rassen nicht sonderlich gut auf die Quel'dorei zu sprechen. Das liegt vor allem auch an den Taten von Kael'thas Sonnenwanderer. Besonders die Nachtelfen meiden die Hochelfen wo sie nur können und begegnen ihren von der Sonne gesegneten Brüdern manchmal sogar mit offener Feindschaft. Die Zeit mag diese Wunden heilen, aber die Nutzung von arkaner Magie wird auf ewig einen Keil zwischen die beiden Arten der Elfen treiben.",
                        "FamilyNames" : "Astwanderer, Morgenklinge, Lichtbringer, Morgengrau, Sonnenschreiter"
                    }
                }
            }
        },

        "Traits" : {
            "Adapter" : {
                "Label" : "Anpassungsfähig",
                "Description" : "Du kannst stets reagieren, wenn du im Kampf überrascht wirst (auch wenn deine Wahrnehmungs-Probe fehlgeschlagen ist). Du bist außerdem wetterbeständiger."
            },
            "ArcaneLegacy" : {
                "Label" : "Arkanes Erbe",
                "Description" : "Hochelfen besitzen ein einzigartiges Gespür für Magie. Du kannst einen der folgenden Vorteile wählen:",
                "Options" : {
                    "1" : "Du kannst deinen Mana-Pool um 2 Punkte erhöhen.",
                    "2" : "Du kannst einen zusätzlichen Zauberspruch zu ???????? You add an additional cantrip to your High Magic ability, chosen from the mage spell list.",
                    "3" : "[Nur für Jäger] - Du erhältst das Talent \"TODO: Link Durchdringende Pfeile\"."
                }
            },
            "Bravery" : {
                "Label" : "Tapferkeit",
                "Description" : "Du bist besonders widerstandsfähig gegen Angst."
            },
            "BronzebeardCombatTraining" : {
                "Label" : "Kampfausbildung",
                "Description" : "Du hast Erfahrung im Umgang mit Schusswaffen und Sprengstoffen aller Art, auch wenn du keine Tüftler-Qualitäten besitzt. Du bist geübt im Umgang mit leichter Rüstung."
            },
            "BurningHeart" : {
                "Label" : "Brennendes Herz",
                "Description" : "Du beherrschst den Zauber \"Flammen erzeugen\" (Die Zauberstufe entspricht der Charakter-Stufe). Dein Zauberattribut dafür ist Intelligenz."
            },
            "Darkvision" : {
                "Label" : "Dunkelsicht",
                "Description" : "Du kannst im Dämmerlicht innerhalb von 60 Fuß so sehen als wäre es hell. In Dunkelheit wiederum als würde es dämmern, allerdings kannst du in Dunkelheit keine Farben wahrnehmen."
            },
            "DraeneiCombatTraining" : {
                "Label" : "Kampfausbildung",
                "Description" : "Du hast Erfahrung im Umgang mit Langschwertern, Großhämmern, Gleven und schweren Armbrüsten."
            },
            "DwarvenCombatTraining" : {
                "Label" : "Kampfausbildung",
                "Description" : "Du hast Erfahrung im Umgang mit Kriegsäxten, Handäxten, leichten Hämmern und Kriegshämmern."
            },
            "ElvenCombatTraining" : {
                "Label" : "Kampfausbildung",
                "Description" : "Du hast Erfahrung im Umgang mit Langschwertern, Langbögen, Rapieren und Kurzbögen."
            },
            "ExtraLanguage" : {
                "Label" : "Zusätzliche Sprache",
                "Description" : "Du kannst eine weitere Sprache deiner Wahl sprechen, lesen und schreiben."
            },
            "FelResistance" : {
                "Label" : "Fel-Resistenz",
                "Description" : "Du besitzt natürlichen Widerstand gegen Fel-Magie."
            },
            "FireLordsFavor" : {
                "Label" : "Gunst des Herrn des Feuers",
                "Description" : "Du besitzt natürlichen Widerstand gegen Feuer-Magie."
            },
            "Gemcutting" : {
                "Label" : "Gemmenschneider",
                "Description" : "Du bist geübt im Umgang mit den Werkzeugen für die Edelsteinbearbeitung."
            },
            "GiftOfTheNaaru" : {
                "Label" : "Gabe der Naaru",
                "Description" : "Du kannst deine Aktion dafür verwenden, heilige Energie zu sammeln und den Zauber \"TODO (Link): Erneuerndes Licht (Stufe 1)\" zu wirken. Diese Aktion ist so Kräfte zehrend, dass du dich bei einer kurzen oder langen Rast ausruhen musst, um den Zauber erneut zu wirken. Während eine Kreatur unter dem Einfluss des Zaubers steht, hat sie ein blau glühendes Zeichen über der Stirn, das TODO: ... Licht ausstrahlt (wie \"dancing lights\"). Der entsprechende Zauber-Modifikator deiner Wahl ist Geist oder Charisma."
            },
            "HeroicPresence" : {
                "Label" : "Heroische Präsenz",
                "Description" : "Du kannst 10 Minuten aufwenden, um deine Gefährten zu inspirieren, damit sie mit mehr Zuversicht in den Kampf ziehen. Wähle dazu bis zu 6 befreundete Kreaturen (du kannst auch dich selbst wählen) innerhalb von 30 Fuß. Sie müssen dich sehen oder hören (und verstehen) können. Jede Kreatur erhält vorübergehende Lebenspunkte, die deiner Charakterstufe + der Hälfte deines Geist- oder Charisma-Modifikators entsprechen. Eine Kreatur kann auf diese Weise keine weiteren temporären Lebenspunkte erhalten, bis sie eine lange Rast hinter sich gebracht hat. Alternativ kannst du diese Fähigkeit einsetzen, wenn du einen kritischen Treffer im Kampf landest."
            },
            "HighMagic" : {
                "Label" : "High Magic",
                "Description" : "Magie. Du kennst den Zauber \"Taschenspielerei\" und kannst ihn ganz normal zaubern (Die Zauberstufe entspricht deiner Charakter-Stufe). Mit Stufe 3 kannst du \"TODO: Magie erkennen\" als Stufe 1 Zauber wirken. Wenn du Stufe 5 erreichst, erlernst du den Zauber \"TODO: Stille\" auf Stufe 2. Das entsprechende Attribut für diese Zauber ist Intelligenz und du benutzt deinen normalen Mana-Pool, um diese Zauber zu wirken, auch wenn du normalerweise kein Zauberwirker bist. Sobald du diese Fähigkeiten nutzt, beginnen deine Augen für die nächste Stunde in einem böassen blau zu leuchten. Wenn du diese Zauber bereits anderweitig gelernt hast und die entsprechende Stufe erreicht hast, kannst du sie immer ohne Mana-Kosten vorbereiten."
            },
            "KeenSenses" : {
                "Label" : "Scharfe Sinne",
                "Description" : "Du bist geübt in der Fähigkeit Wahrnehmung."
            },
            "MountainBorn" : {
                "Label" : "Kind der Berge",
                "Description" : "Du kommst problemlos mit Höhen zurecht und bist es gewohnt in bis zu 6.000 m Höhe zu leben. Du bist außerdem an kaltes Wetter angepasst, daher bereitet es dir beim Erkunden der Wildnis keine Probleme."
            },
            "MysticSenses" : {
                "Label" : "Mystische Sinne",
                "Description" : "Immer wenn du eine Probe auf die Herkunft von magischen Gegenständen, Überlieferungen oder Zaubern ablegst, giltst du als Experte für Zauberkunde."
            },
            "NaturalArmor" : {
                "Label" : "Natürliche Rüstung",
                "Description" : "Deine Haut ist so zäh wie gehärtetes Leder. Wenn du keine Rüstung trägst, entspricht dein Verteidigungswert 12 + Gewandtheits-Modifikator. Du kannst diesen natürlichen Bonus dazu verwenden, deinen Verteidigungswert zu ermitteln, wenn die Rüstung, die du trägst, einen geringeren Verteidigungswert verursachen würde. Die Vorteile von Schilden gelten uneingeschränkt."
            },
            "NaturalHandler" : {
                "Label" : "Händchen für Tiere",
                "Description" : "Du bist geübt im Umgang mit Tieren. Wenn du diese Fähigkeit bereits anderweitig erworben hast, hast du sie im Umgang mit Bergbewohnern, wie z.B. Greifen oder Berglöwen gemeistert."
            },
            "Resilience" : {
                "Label" : "Unverwüstlich",
                "Description" : "Du bist sehr widerstandsfähig gegen Gifte."
            },
            "Stalker" : {
                "Label" : "Pirscher",
                "Description" : "Du bist geübt in den Fähigkeiten Wahrnehmung und Verstohlenheit. Wenn du diese Fähigkeiten bereits anderweitig erworben hast, hast du sie hiermit gemeistert."
            },
            "Stonecunning" : {
                "Label" : "Steinschläue",
                "Description" : "Immer wenn du eine Intelligenz-Probe (Geschichte) oder Bergarbeits-Probe ablegst, die sich auf Steinarbeiten oder Mineralien bezieht, dann bist du geübt und Experte in Geschichte oder Bergarbeit. (Deine Wahl)"
            },
            "Stoneform" : {
                "Label" : "Steinform",
                "Description" : "Du kannst dich gelegentlich darauf konzentrieren, Wunden zu ignorieren. Wenn du Schaden erleidest, kannst du deine Reaktion nutzen, um einen W12 zu würfeln. Addiere deinen Ausdauer-Modifikator, um den Schaden um diese Summe zu reduzieren. Wenn der Wert noch andauernden Blutungsschaden übersteigt, wird auch die Blutung sofort gestillt. Diese Fertigkeit regeneriert sich bei einer kurzen oder langen Rast."
            },
            "ToolProficiency" : {
                "Label" : "Umgang mit Werkzeugen",
                "Description" : "Du bist geübt im Umgang mit den Werkzeugen für einen der folgenden Berufe: Schmied, Braumeister, Steinmetz oder Bergarbeiter."
            }
        },

        "SpellSheet" : {
            "School" : "Zauberschule",
            "CastTime" : "Zauberzeit",
            "Range" : "Reichweite",
            "Components" : "Bestandteile",
            "Duration" : "Dauer",
            "Classes" : "Klassen"
        },

        "Spells" : {
            "DetectMagic" : {
                "Label" : "Detect Magic",
                "Description" : "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
            },
            "ProduceFlame" : {
                "Label" : "Flammen erzeugen",
                "Description" : "Eine flackernde Flamme erscheint in deiner Hand. Solange sie in deiner Hand tanzt, schadet sie weder dir noch deiner Ausrüstung. Die Flamme spendet Licht in einem Radius von 10 Fuß und schwaches Licht in weiteren 10 Fuß. Der Zauber endet, wenn du ihn als Aktion frei gibst oder ihn erneut wirkst. Du kannst die Flamme auch zum Angriff einsetzen. Auch hierbei erlischt die Flamme anschließend. In dem Moment, in dem du den Zauber wirkst, oder auf Kosten einer Aktion in einem späteren Zug, kannst du die Flamme auf eine Kreatur innerhalb von 30 Fuß Entfernung schleudern. Führe dazu einen Fernangriff aus. Bei einem Treffer erleidet das Ziel 1W8 Feuerschaden. Der Schaden steigt bei Stufe 5 auf 2W8, bei Stufe 11 auf 3W8 und bei Stufe 17 auf 4W8."
            },
            "Prestidigitation" : {
                "Label" : "Taschenspielerei",
                "Description" : "Dieser Zauber ist ein winziger magischer Trick, den Zauberlehrlinge zum Üben verwenden. Du kannst damit innerhalb von 10 Fuß einen der nachfolgenden Effekte erzielen. Wenn du diesen Zauber mehrere male wirkst, kannst du bis zu drei der nicht-spontanen Effekte gleichzeitig aufrecht erhalten. Einen dieser Effekte zu beenden, ist eine normale Aktion.",
                "Options" : {
                    "1" : "Du erzeugst spontan einen harmlosen Effekt, der die Sinne täuscht, wie z.B. Gänsehaut, einen Windhauch, ein leises Notenspiel oder einen seltsamen Duft.",
                    "2" : "Du kannst spontan eine kleine Flamme herbei zaubern oder löschen, um z.B. eine Kerze, eine Fackel oder ein kleines Lagerfeuer zu entzünden.",
                    "3" : "Du kannst spontan einen Gegenstand säubern oder beschmutzen, der nicht größer als ein 35 cm langer Würfel ist.",
                    "4" : "Du kannst nicht lebendige Materie abkühlen oder erwärmen, wenn sie nicht größer als ein 35 cm langer Würfel ist.",
                    "5" : "Du kannst eine Farbe, ein kleines Zeichen oder ein Symbol auf der Oberfläche eines beliebigen Gegenstandes erzeugen.",
                    "6" : "Du kannst ein nichtmagisches Schmuckstück oder ein illusorisches Bild beschwören, das in deine Hand passt. Du kannst es bis zum Ende deiner nächsten Runde aufrecht erhalten."
                }
            }
        },

        "SpellRules" : {
            "SpellSchools" : {
                "Abjuration" : "Schutz",
                "Conjuration" : "Beschwörung",
                "Divination" : "Wahrsagerei",
                "Enchantment" : "Verzauberung",
                "Evocation" : "Elemente",
                "Illusion" : "Illusionen",
                "Necromancy" : "Nekromantie",
                "Transmutation" : "Verwandlung"
            },
            "Range" : {
                "Self" : "du selbst"
            },
            "Components" : {
                "Somatic" : "Gesten",
                "Verbal" : "Geräusche"
            }
        },

        "UI": {
            "Actions" : {
                "NoToken" : "Du hast kein Token ausgewählt. Bitte wähle ein gültiges Token.",
                "CastSpell" : "Du wirkst den Zauber",
                "CastSpellError" : "Du bist nicht in der Lage, diesen Zauber zu wirken: ",
                "CastSpellInvalidTarget" : "Ungültiges Ziel. Bitte wähle ein einzelnes feindliches Token.",
                "OutOfRange" : "Das Ziel befindet sich außer Reichweite. Distanz:"
            },
            "Units" : {
                "Action" : "Aktion",
                "Ft" : "Fuß",
                "Minutes" : "Minuten",
                "Hour" : "Stunde"
            }
        }
    }
}
