{
    "WC5E": {

        "Languages": {
            "Common": "Common",
            "Dwarven": "Dwarven",
            "Elven": "Elven",
            "Eredun": "Eredun"
        },

        "Character": {
            "Strength": "Strength",
            "Agility": "Agility",
            "Stamina": "Stamina",
            "Intelligence": "Intelligence",
            "Spirit": "Spirit",
            "Charisma": "Charisma",
            "HitPoints": "Hit Points",
            "Level": "Level"
        },

        "Class": {
            "Alchemist": {
                "Name": "Alchemist",
                "Introduction": {
                    "1": "A forsaken stalks the ruins of a murloc village, picking eyes and bits of flesh. As a skulking murloc prepares to jump out at her, she casually tosses a potion at its chest without glancing at it, causing the skin to bubble and blacken with a terrible—the last thing it sees are the forsaken‘s fingers reaching forward to take out its light.“",
                    "2": "A gnome reaches down to his box of Alchemist‘s Supplies, picking a rare herb and some pinches of sea salt, before tossing them into a small battle-beaker warmed by a portable burner. With uncanny calm, he weighs the curative mixture, before delivering it to a dying friend, revivifying her.“",
                    "3": "Laughing maniacally as he consumes his potion, the troll rushes into the fight, fingertips mutating into razor-sharp claws. As his muscles grow larger, and as his skin hardens, his eyes gleam with the promise of pain.",
                    "4": "A goblin mercenary sits on the back of a drugged ogre, tossing explosive potions. Wincing as a human warrior stabs his giant homunculus, he pulls out a potion from his side pouch and jams it down the ogre‘s throat. The crunch of teeth against glass invigorates the ogre, and, with a burp, it tosses its arm forward with great strength, tossing the human away as the alchemist laughs in triumph."
                },
                "Description": "Whether by careful measuring, self-experimentation, explosive mixtures, or supportive potions, an alchemist utilizes their own mix of magic and science, alchemical science, to support and heal wounds, decimate enemies, manifest unusual effects, or augment themselves to wade into battle. These lightly armored individuals are experts in creating a variety of special effects, from temporary explosives to elixirs that revive the dead.",
                "Blocks": {
                    "1": {
                        "Title": "Magic and Science",
                        "Content": "In the Warcraft universe, alchemy is not merely pseudo-chemistry—it is an art that draws power from the primal elements of life, not unlike actual magic. An alchemist is a master of the art who takes it leaps and bounds further than their peers, who are limited in their alchemical products to mere healing poultices and anti-toxins, reaching heights of reviving the dead or manifesting massive explosives.<br>The greatest strength of an alchemist is their versatility. They can themselves adequately but can specialize in being battle-chemists who augment themselves with potions before tearing their enemies apart with their own hands. They can choose to focus on the augmentative powers of their mixtures, delaying harm and healing wounds, or to debilitate their enemies with negative status effects. Damage dealt by an alchemist‘s potions usually focus on concussive or poison damage, but they are also broad in scope, dealing fire or frost or lighting as required of them. The better they anticipate their opposition, the better the alchemist can prepare.<br>The success of alchemists relies greatly on the formulae and recipes they have in their formula books. They gain new formulae as they gain experience, study other formula books, or research independently."
                    },
                    "2": {
                        "Title": "The Weight of Knowledge",
                        "Content": "Alchemists' lives may appear mundane, starting as a sage, independent researcher under a mage tower, a plague researcher, or member of a military force‘s supply chain. Other alchemists focus on trade, opening alchemy shops and selling anything from curative mixtures to love potions. Others still have adapted their talents to violence, such as serving in mercenary forces or the military, sapping structural defenses and focusing on combat support.<br>The weight of knowledge and the demand for versatile potions calls for even the most sedentary alchemists to venture out to investigate strange happenings, support their friends, or answer the call to heroism.<br><br>Alchemists are students, researchers, and scientists of the mysterious science of alchemy. To choose to alchemist class is to be more than a dabbler in the art of alchemy—they are utilizers of strange techniques that would empower themselves and their allies, experienced craftspeople who can make potions for fractions of the normal time and cost, and some have even modified their bodies to make full use of their skills.<br>Creating poisons, potions, special explosives, and empowering substances, alchemists are either curiosities, prized members of society, or reclusive, feared experts in unstable weird sciences. Alchemy itself does not fall strictly in one end between science and magic, but is a potent force nonetheless.<br>Alchemists support soldiers and adventurers, and could easily take to the field themselves, brewing and concocting potions, poisons, and poultices to support (or create) allies on the field. Some work to support their communities, others attempt to replicate (or surpass) the work of the Scourge's necromancers, and others focus on self-empowering through strange concoctions they imbibe."
                    },
                    "3": {
                        "Title": "Creating an Alchemist",
                        "Content": "As you make your alchemist character, consider the origins of their knowledge: were they selftaught, a student of another alchemist, or did they gain this mastery by esoteric means? Alchemy is a difficult discipline—how did you accomplish the challenge to gain your status? Were you motivated by war, fortune, or by something else entirely, such as the lack of magical talent to become a spellcaster?<br>Perhaps you preferred the reliable mundane science of alchemy over the unexpected extraordinary power of magic, or took comfort in the fact that you were in demand in an urban setting—there is no lack of adventurers who might need your aid as an alchemist if you do not wish to go out and adventure. Do you have any peers among alchemists? Do they perceive your approach to science as calm and intellectual, or rash but with great breakthroughs or a dangerous form of meddling with life and death that should not be tolerated? Do you have a special ambition or goal to achieve as an alchemist—such as making magic-like effects accessible to the mundane public, providing affordable healing, and counters to common ailments, or are your creations for your own monetary benefit?"
                    }
                },
                "QuickBuild": "You can make an alchemist quickly by following these suggestions. First, Intelligence should be your highest ability score. Make Agility your next-highest if you want to use ranged or finesse weapons, or focus on throwing potions and explosives. Use Strength instead if you wish to empower yourself in battle and engage in combat via the mutate spell. Second, choose the guild artisan or scholar backgrounds. Third, choose the noxious fumes (poison spray), minor alchemy, and fire bolt cantrips, along with the following 1st-level spells for your formula book: <i>burning hands</i>, <i>explosion</i>, <i>mutate</i>, and <i>rejuvenation</i>.",
                "Paths": {
                    "Bomber": {
                        "Title": "Bomber",
                        "Description": "You appreciate the controlled destruction behind a bomb, terrible surprise beneath a mine, and the terror a rocket invokes. Bomber tinkers often makes use of mortars and rocket or mine launchers, to deny enemy mobility as well as to deal massive damage to their enemies. Bombers are also known as grenadiers, and often take to the skies on gyrocopters to unleash their fury from above."
                    },
                    "Gunner": {
                        "Title": "Gunner",
                        "Description": "You are not only a renowned gunsmith, but also an excellent marksman. Gunners are often called gunslingers or musketeers, and are usually employed in battlefields."
                    },
                    "Gadgeteer": {
                        "Title": "Gadgeteer",
                        "Description": "You appreciate the versatility gadgets provide, or prefer to craft and control constructs such as mechs and vehicles of all types. Gadgeteers are often the drivers of their own devices, such as the engines of goblin balloons, dwarf steam tanks, or gnomish submarines and gyrocopters."
                    }
                }
            },
            "DeathKnight": {
                "Name": "Death Knight"
            },
            "Druid": {
                "Name": "Druid"
            },
            "Hunter": {
                "Name": "Hunter"
            },
            "Mage": {
                "Name": "Mage"
            },
            "Paladin": {
                "Name": "Paladin"
            },
            "Priest": {
                "Name": "Priest"
            },
            "Shaman": {
                "Name": "Shaman"
            },
            "Tinker": {
                "Name": "Tinker",
                "Introduction": {
                    "1": "A dwarf holds out his rifle, standing watch over his position atop defensive walls. In the distance, he hears the explosion in a mine. Mentally calculating the distance, he turns to a nearby mortar, adjusting a few settings. He pulls the primer, smirking as the mortar lobs the explosive shell somewhere into the woods behind cover, releasing panicked screams and another blast.",
                    "2": "A large mechanical construct with arms of steel and razorsharp claws approaches a keep‘s shut portcullis. The construct digs its claws under the steel of the gate, and begins pulling it upwards, as a small voice from inside the construct urges its fellows to pass quickly. From the walls, an arrow clangs on the construct‘s shoulder, causing the driver of the mecha to turn, lift an arm, and release a rocket barrage against the hapless archer. From within, a gnome squeaks out an apology.",
                    "3": "The goblin‘s green skin seems almost black from the soot of her explosives as she ducks behind the ruined door frame, evading sling bullets and bolts of frost. She rests her back on the wall for a moment, and unhooks a mechanical wheel from her back. She revs up a rip-tire, packs a few pieces of dynamite into it, and releases it. With a roar, the wheel charges into the open gateway and lets out a resounding blast. The goblin then smirks at the silence, and hearing a groan, she pulls out her flamethrower, and moves in to clean up."
                },
                "Description": "For the tinker, innovation is both the tool and the end. Having the brain and the tools give them the nearly limitless capacity to solve any problem. These engineers are lightly armored, and are proficient with the skills to create a variety of tools and machines to help them achieve their goals.",
                "Blocks": {
                    "1": {
                        "Title": "Consummate Innovators",
                        "Content": "Tinkers among the smartest and most creative of the adventurers setting out to explore and conquer Azeroth. As a creator of incredible inventions from steam saws to siege engines, your devices allow them to overcome nearly any situation — and if you don‘t have the device they need, you just might be able to design and create a new one on the spot.<br>>Tinkers are born of necessity—economic or military. Many gnomish and goblin engineers chose to take up the path of the tinker because of its demand in peace and wartime, and to satisfy their creativity. Tinkers tend to carry about packs and pouches full of heavy tools, spare parts and inventions both finished and incomplete. In doing so, they quickly develop the ability to shoulder casually otherwise crushing burdens. Furthermore, the tinker‘s ability to put together devices out of random piles of spare parts or whatever wires and gears they happen to be carrying is a valuable asset, allowing a tinker to address problems and improvise even when they would otherwise be stumped.<br>From developing vehicles such as the zeppelin or the steam engine to reliable weapons and explosives, tinkers are increasingly needed innovators in the changing World of Warcraft. "
                    },
                    "2": {
                        "Title": "Adaptable Combatants",
                        "Content": "Tinkers prefer to spend days, weeks or even months constructing the devices they design. When adventuring, though, tinkers are often forced to throw together a device more quickly or adapt  pieces of fallen technology to their purposes. A tinker can arrive onto a battlefield with many tools, ranging from firearms, explosives, strange gadgets, to even personal vehicles and mecha. A tinker always balances what they can bring with what they should bring, as relying on technology that is too young could result in a crisis like the destruction of Gnomregan. They also look forward to repurposing enemy technology, and a tinker‘s strength can grow the more developed their opposition is.<br>Tinkers have a reputation for being dangerous companions before specializing, born mainly of reckless goblins experimenting with explosives, or using gadgets made and owned by others. However, the true heart of the tinker profession can be found in the steady craftsmanship of the dwarves and the wild-eyed curiosity of the gnomes."
                    },
                    "3": {
                        "Title": "Creating a Tinker",
                        "Content": "When you create a tinker, consider where you learned your craft. Are you self-taught or a student of a well-established guild, university, or master tinker? How has that affected your starting devices and formulae? Another thing to consider is your specialty—many gnomes and draenei prefer to rely on gadgets, while goblins lean towards explosives, and dwarves would swear on a reliable firearm.<br>Are the components and parts of your devices usually supplied and numbered or scavenged and repurposed from other devices?<br>Do you have qualms of repurposing technology (seeing it as a mark of poverty) or revel in it (seeing it as a proof of your power and skill)? Have you ever worked for an engineering society or guild— how have they treated you or used your inventions?"
                    }
                },
                "QuickBuild": "You can make a tinker quickly by following these suggestions. First. Intelligence should be your highest ability score. Make Agility your next-highest if you want to excel at using firearms and explosives. Choose Stamina or Strength instead if you plan to emphasize using constructs and mecha. Second, choose the guild artisan background. Third, choose the following starting devices in your engineer‘s notebook: boomstick (or auto-crossbow), fog machine (gadget), flamethrower (gadget), and hand grenade (or iron rockets, iron bombs, or iron mines).",
                "Paths": {
                    "Bomber": {
                        "Title": "Bomber",
                        "Description": "You appreciate the controlled destruction behind a bomb, terrible surprise beneath a mine, and the terror a rocket invokes. Bomber tinkers often makes use of mortars and rocket or mine launchers, to deny enemy mobility as well as to deal massive damage to their enemies. Bombers are also known as grenadiers, and often take to the skies on gyrocopters to unleash their fury from above."
                    },
                    "Gunner": {
                        "Title": "Gunner",
                        "Description": "You are not only a renowned gunsmith, but also an excellent marksman. Gunners are often called gunslingers or musketeers, and are usually employed in battlefields."
                    },
                    "Gadgeteer": {
                        "Title": "Gadgeteer",
                        "Description": "You appreciate the versatility gadgets provide, or prefer to craft and control constructs such as mechs and vehicles of all types. Gadgeteers are often the drivers of their own devices, such as the engines of goblin balloons, dwarf steam tanks, or gnomish submarines and gyrocopters."
                    }
                }
            },
            "Warlock": {
                "Name": "Warlock"
            },
            "Warrior": {
                "Name": "Warrior",
                "Introduction": {
                    "1": "The heavily-armored dwarf takes a deep breath, tightening his grip on a war-hammer in one hand and a battleaxe in the other, facing down the ogre warlord raiding his mountain home. The mountain king shouts a battle-cry, suddenly increasing in size to equal the ogre, and swings his axe to dig deeply into the ogre‘s shoulder, before bringing down the war-hammer, causing a bloody shower to erupt onto his face.",
                    "2": "An orc armed with a great two-handed blade leaps towards two naga, cleaving through both with a single strike and shaking the ground where he fell. Not breaking a sweat, he charges ahead to the next foe.",
                    "3": "A tauren calmly strides across the fel-suffused battlefield, seeking a worthy opponent. Eventually, he finds his match, a bloodthirsty felguard. Treading carefully, he parries every blow with his giant battle-totem. Noticing an opportunity, the tauren warrior slams his hooves into the ground, knocking the felguard down, and then bringing down his mighty totem down, caving the fiend‘s torso inward with a furious war-cry."
                },
                "Description": "Warriors are fighters highly trained in the art of weaponry. Combat is the warrior's strongest skill. They are strong and quick on the battlefield. Depending on their specialization, a warrior can often deal very high damage or be tough to kill.",
                "Blocks": {
                    "1": {
                        "Title": "Trained for Battle",
                        "Content": "As long as war is waged on Azeroth, there will be men and women who fight those wars. Warriors are no mere sword-swingers; they are skilled combatants, combining strength of arm, knowledge of weaponry, and practiced maneuvers to slice or bludgeon their foes into little red bits. Warriors are the most versatile of the combat classes, and they supplement their fighting prowess with the ability to rally their allies and spur them to victory. They charge into the heart of the battle and survive the most grievous of wounds. Elven and dwarven warriors reach into their blood for innate magic, creating spellbreakers and mountain kings, respectively, while tauren and orcs lean naturally towards using a single large weapon and the Arms path, creating chieftains and blademasters, respectively.<br>Warriors are common in dwarf, forsaken, human, and orc societies, but many other species also fill their ranks with warriors. Masters of swords, spears, and weapons of all kinds, warriors share a common way of life on Azeroth. Using their abilities to deal pain and cause bloodshed, warriors are deadly adversaries and welcome friends in violent times (which seem to be all the time in recent decades). Anyone willing to take up arms to defend their people can be classed as a warrior. A knight is the warrior elite among humans."
                    },
                    "2": {
                        "Title": "Elite Fighters",
                        "Content": "Not every member of the city watch, village militia, or the queen‘s army is a warrior. Most of these troops are relatively untrained soldiers with only the most basic combat knowledge or drilled for a certain function. Veteran soldiers, military officers, trained bodyguards, dedicated knights, and similar figures are true warriors—it is all about the spirit, in truth.<br>Some warriors feel drawn to use their training as adventurers. The dungeon delving, monster slaying, and other dangerous work common among adventurers is second nature for a warrior, not all that different from the life he or she left behind. Other warriors live a more stable life, serving as elite members in an order or military force, answering assignments and missions that involve armed pacification of resistance or the escort of vulnerable charges."
                    },
                    "3": {
                        "Title": "Creating a Warrior",
                        "Content": "For as long as war has raged, heroes from every race have aimed to master the art of battle.<br> Warriors combine strength, leadership, and a vast knowledge of arms and armor to wreak havoc in glorious combat. Some protect from the front lines with shields, locking down enemies while allies support the warrior from behind with spell and bow. Others forgo the shield and unleash their rage at the closest threat with a variety of deadly weapons.<br>As you build your warrior, think about your character‘s background: Where did you get your combat training, and what sets you apart from the mundane soldiers around you? You might have enjoyed formal training in a noble‘s army or in a local militia. Perhaps you trained in a war academy, learning strategy, tactics, and military history. Or you might be self—taught—unpolished but well tested.<br>Were you particularly ruthless? Did you get extra help from a mentor, or did your spirit shine brightly enough to warrant the title due to exceptional dedication? What drove you to this training in the first place? Was it a threat to your homeland, a thirst for revenge, or a need to prove yourself? Did you take up the sword as a way to escape the limits of life on a farm, or are you following a proud family tradition? Where did you acquire your weapons and armor? They might have been military issue or family heirlooms, or perhaps you scrimped and saved for years to buy them. Your armaments are now among your most important possessions—the only things that stand between you and death's embrace."
                    }
                },
                "QuickBuild": "You can make a warrior quickly by following these suggestions. First, make Strength or Agility your highest ability score, depending on whether you want to focus on melee weapons or on archery (or finesse weapons). Your next-highest score should be Stamina. Second, choose the soldier background.",
                "Archetypes": {
                    "Arms": {
                        "Title": "Arms",
                        "Description": "You focus on wielding great weapons, breaking enemy lines, inflicting the first wounds in battle, and dealing massive amounts of damage. As they cleave through several creatures at once to soften up their foes for their allies, arms warriors become an inspiring sight on the battlefield, and are masters of their chosen weapons."
                    },
                    "Fury": {
                        "Title": "Fury",
                        "Description": "You equip yourself with two weapons, and slice your enemies to ribbons while shouting vengeance. Fury warriors make good party members, as inspiring shouts aid their allies."
                    },
                    "Protection": {
                        "Title": "Protection",
                        "Description": "You are the forward vanguard, decking yourself with heavy armors and a reliable shield. Protection warriors deflect and guarding their allies from attacks, and return damage with interest."
                    }
                }
            }
        },

        "Items": {
            "AlchemistsSupplies": {
                "Title": "Alchemist‘s Supplies"
            },
            "EngineersTools": {
                "Title": "Engineer‘s Tools"
            },
            "PoisonersKit": {
                "Title": "Poisoner‘s Kit"
            },
            "ThievesTools": {
                "Title": "Thieves‘ Tools"
            }
        },

        "RaceSheet": {
            "AbilityScoreIncrease": "Ability Score Increase",
            "Age": "Age",
            "Traits": "Traits",
            "Affiliation": "Affiliation",
            "Size": "Size",
            "Appearance": "Appearance",
            "Speed": "Speed",
            "SpeedVal": "Your base walking speed is ",
            "Languages": "Languages",
            "Subrace": "Subrace",
            "SubraceChoice": "Choose one of these subraces.",
            "MaleNames": "Male Names",
            "FemaleNames": "Female Names",
            "FamilyNames": "Family Names"
        },

        "Race": {
            "Draenei": {
                "Name": "Draenei",
                "Description": "The draenei are a powerfully-build alien race that originates from Argus. They are powerfully magically-attuned, and have the potential for exceptional good or evil. Draenei who succumb to fel magic form the ranks of the Eredar, the greatest generals of the Burning Legion, while draenei who serve the Holy Light are immortal crusaders for justice across the cosmos.",
                "AbilityScoreIncrease": "Your Spirit or Intelligence increases by 1.",
                "Age": "A typical draenei claims adulthood around 100 years old, and can live to about ten thousand years old.",
                "Affiliation": "Each sub-race is inclined to its own affiliations.",
                "Size": "Their size is Medium. Males range anywhere from seven feet tall to eight feet tall and weigh on average around 300 or 400 pounds. Females stand at six to seven feet tall and only weigh around 170 or 250 pounds when fully grown.",
                "Appearance": "As befitting their Eredar heritage, Draenei have hooved feet, tendrils that grow from the neck and short tails, and their skin color is affected by the magic they naturally absorb (with fel magic reddening them, holy magic rendering their skins blue to violet, and void magic darkening them to brown). Males' skulls are rigid (giving the appearance of a bone plate under their skin), while females grow foot-long, graceful curved horns. Broken draenei look distinctly different from normal Draenei, having flat, noseless faces and having thick, three-fingered hands, and lose their bone-like plates.",
                "Language": "The Eredun Draenei speak is an altered dialect that is less corrupt, and thus does not impose penalties when speaking, but is perfectly understandable by fiends.",
                "FamilyNames": "Draenei do not have family names, but take a title according to their deeds.",
                "Subrace": "Ancient events divide the draenei into two sub-races: unbroken and broken.",
                "Subraces": {
                    "Broken": {
                        "Name": "Broken (Krokul)",
                        "Quote": "You will learn our ways...",
                        "Description": "The Broken, also known as Krokul in Draenei, are a mutated and devolved subrace of draenei who lived in Outland. They, like most of the orcs, fell prey to the demons' sinister influence and were changed by the corruption. Though they lost some of their former powers, the Broken still present a clear danger to all races through Outland. The largest known faction of Broken in Outland, the Ashtongue Deathsworn, is currently led by Akama. They are supposedly allied with Illidan Stormrage.",
                        "AbilityScoreIncrease": "Your Agility increases by 2.",
                        "Affiliation": "Independent. Despite the (mostly) accidental regression into broken, many unbroken draenei not only distrust them but despise them. Although understandable of those broken who remain corrupted or in service to the Legion, one would think that the unbroken would be willing to welcome any of their people that survived the orcs' genocide. Most broken are independent as a result, although the Prophet Velen, the leader of the unbroken, does extend a hand to broken to help them find their way back."
                    },
                    "Unbroken": {
                        "Name": "Unbroken (True Draenei)",
                        "Quote": "The Legion's end draws near.",
                        "Description": "As one of the enlightened cousins of the Eredar, the Draenei arrived in Azeroth after the reopening of the Dark Portal. Living out the last centuries in exile and escape from the Burning Legion, the Draenei are steadfast champions of the Light, and will do anything in their power to prevent another world from falling to the Flame.",
                        "AbilityScoreIncrease": "Your Strength increases by 2.",
                        "Affiliation": "Alliance. Unbroken draenei have found that they have strong bonds with humanity and dwarvenkind due to their shared worship of the Light, and kinship with the now-mortal night elves."
                    }
                }
            },
            "Dwarf": {
                "Name": "Dwarf",
                "Description": "Dwarves are short and stout creatures mostly inhabiting Khaz Modan in the Eastern Kingdoms. They are shorter than humans but taller than gnomes, taking advantage of their size when possible and relying on their robustness and strength when not. The average dwarf is steady, observant and composed.",
                "AbilityScoreIncrease": "Your Stamina score increases by 2.",
                "Age": "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 40. On average, they live to be 450 years old.",
                "Affiliation": "Each sub-race is inclined to its own affiliations ever since the great War of the Three Hammers.",
                "Size": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
                "Appearance": "Male dwarves tend to have long hair, and beards or facial hair often tied in ornate braids. Female dwarves also have sturdy muscular frames, but they are buxom and lack facial hair, despite the claims of some of the less educated sages of other races.",
                "SpeedAddition": "Your speed is not reduced by wearing heavy armor.",
                "Language": "Dwarven is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak.",
                "Subrace": "Three main subraces of dwarves populate the worlds of Azeroth: Hill dwarves (Wildhammer Clan), Mountain dwarves (Bronzebeard Clan), and Dark dwarves (Dark Iron Clan).",
                "Subraces": {
                    "Bronzebeard": {
                        "Name": "Mountain Dwarf (Bronzebeard)",
                        "Quote": "For Khaz Modan!",
                        "Description": "As a mountain dwarf, you probably hail from the Bronzebeard clan and its allies, and live in Khaz Modan. Ironforge dwarves are stout and powerful, with short muscular bodies, and prefer tying their hair (male or female) in ornate braids.",
                        "AbilityScoreIncrease": "Your Strength score increases by 1.",
                        "Affiliation": "Alliance. While the dwarves of Ironforge appreciate the fighting skill of the Horde, it is with grim eyes that they look upon the orcs and their allies, the trolls and the Forsaken. Although the dwarves have held dealings of commerce and diplomacy with the high elves, they keep the people of Quel‘Thalas at an arm‘s distance. While the night elves may share the same allegiances, the dwarves look upon them with suspicion and some trepidation. Humans, however, are the staunch and constant allies of the dwarven people and find welcome, favor and kindness when in dwarven lands.",
                        "FamilyNames": "Thunderforge, Bronzebeard, Hammergrim, Thornsteel, Chunderstout"
                    },
                    "DarkIron": {
                        "Name": "Darklands Dwarf (Dark Iron)",
                        "Quote": "You shall serve.",
                        "Description": "As a darklands dwarf, you probably hail from the Dark Iron clans, lead by the Sorcerer-thane Thaurissan. Reviled as betrayers of their fellow dwarves, and living in the mountain-halls of Blackrock Mountain, Dark Iron dwarves are slaves to the great elemental Firelord Ragnaros, and serve him in the latent volcanic mountain. Dark Irons seem identical to Ironforge dwarves, except that their skin tones are ashen and gray, and their eyes are golden-red. Dark Irons who adventure can often reach into the power in their bloodline and spontaneously conjure flames. Hoarse of voice and prone to undertone muttering, Dark Irons do not inspire trust easily.",
                        "AbilityScoreIncrease": "Your Intelligence score increases by 1.",
                        "Affiliation": "Alliance or Independent. Hatred comes to Dark Iron dwarves against all races, and in their service to Ragnaros, they see only rivals, thralls, and enemies. Some dark irons have found kinship with their cousins the Wildhammers and the Bronzebeards, and chose to join the Alliance.",
                        "FamilyNames": "Angerforge, Darkbargainer, Firesmite, Forgewright"
                    },
                    "Wildhammer": {
                        "Name": "Hill Dwarf (Wildhammer)",
                        "Quote": "To the skies!",
                        "Description": "As a hill dwarf, you probably hail from the Wildhammer clan and its allies, and live in the Aerie Peak. Wildhammer dwarves are similar in appearance to their Ironforge kin, though many shave their heads and they are slightly taller and leaner. Exposure to sun and high winds darkens and toughens their skin. Wildhammers string beads and feathers into their hair and beards as good luck charms, and paint tattoos on their bodies in homage to the totems, ideas and creatures they revere.",
                        "AbilityScoreIncrease": "Your Spirit score increases by 1.",
                        "Affiliation": "Alliance or independent. The Wildhammer clan is not a member of the Alliance, but Wildhammer dwarves are allies of the Alliance and would certainly help it in a war (and have done so in the past). They are distant with humans and Ironforge dwarves, but have formed a kinship with high elves. Wildhammers and high elves shared much in common in the past, including a love of nature and hatred of evil. Many high elves have grown introverted and brooding of late, which concerns the Wildhammers. The dwarves are appalled at the defection of the blood elves, an event which has caused them to see their high elf allies with new eyes. They also get along well with night elves, as the two races share much in common.",
                        "FamilyNames": "Beastclaw, Greatbeard, Thundertamer, Windseer"
                    }
                }
            },
            "Elf": {
                "Name": "Elf",
                "Description": "An elf is a member of one of the longest lived species on Azeroth known for keen perception, grace, and great spellwork. Elves were once believed to be the first race to awaken on Azeroth.",
                "AbilityScoreIncrease": "Your Agility score increases by 2.",
                "Age": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. A high elf typically claims adulthood around the age of 60 and can live to be 750 years old. A night elf claims adulthood and live up to five times said age (adulthood at 300 and live up to 3,750 years old). Until the World Tree was destroyed, the Night Elves were immune to aging effects.",
                "Affiliation": "Each sub-race is inclined to its own affiliations ever since the Great War of the Ancients.",
                "Size": "A high elf (and hence a blood and void elf) is usually a little over 6 feet in height and weighs between 100 to 175 pounds, depending on gender. Night elves (and hence Nightborne) are imposing in stature, males being on average 7 feet tall.",
                "Appearance": "Male Kaldorei are very muscular, with broad chests and shoulders, indicative of the strength that lies within both their minds and bodies. Female night elves are lithe and curvaceous, yet still muscular and strong.",
                "SpeedAddition": "Your speed is not reduced by wearing heavy armor.",
                "Language": "Elven is fluid, with subtle intonations and intricate grammar, even with strange dialects such as Nazja. Elven literature is rich and varied, and their songs and poems are famous among other races.",
                "Subrace": "Ancient divides and use of mana siphoning (or mana vampirism) among the elven people resulted in several main sub-races: high elves (and the blood and void elves), and night elves (and the Nightborne).",
                "Subraces": {
                    "HighElf": {
                        "Name": "High Elf (Quel'dorei)",
                        "Quote": "For Quel‟Thalas!",
                        "Description": "As a high elf, you hail from Silvermoon in Quel‘Thalas or Dalaran. High elves stand slightly taller than humans do. The elves are slim, with sharp symmetrical features, often an exaggeration of perfect beauty. The high elves are uniformly fair in complexion, with white to flaxen colored hair. Their eyes are incredibly intense in color, seeming to glow with an inner light. While many high elves have blue or green eyes, violet and red are not unheard of.",
                        "AbilityScoreIncrease": "Your Intelligence score increases by 1.",
                        "Affiliation": "Alliance or independent. Most of the high elves have placed themselves under a self-imposed exile, ashamed of the damage that they have wrought upon the world of Lordaeron with their abuse of arcane magic. While humans still accept the high elves because of the aid that both races provided each other during the most recent attacks of the Burning Legion, many of the other races will only deal with the high elves if absolutely necessary. This is especially true after the acts of Kael‘thas Sunstrider. The night elves in particular do not care for the company of high elves and in some cases can be openly hostile toward their sun-blessed brethren. The passing of time may heal these wounds, but the use of arcane magic will always draw a rift between these two breeds of elf.",
                        "FamilyNames": "Boughstrider, Dawnblade, Lightbringer, Morningray, Suntreader"
                    },
                    "BloodElf": {
                        "Name": "Blood Elf (Sin'dorei)",
                        "Quote": "Power! My people are addicted to it... a dependence made manifest after the Sunwell was destroyed. - Kael'Thas Sunstrider",
                        "Description": "Following the Third War, 90% of the High Elven population was slain during the Siege of Silvermoon and the Razing of Quel‘Thalas. Prince Kael‘Thas Sunstrider renamed his people the Blood Elves (Sin‘dorei) following this terrible event. With their homeland destroyed, their forests burned and corrupted, and their beloved sacred Sunwell sullied, the Blood Elves underwent mana withdrawal. Blood Elves are identical to High Elves in racial bonuses and names. However, their culture is more warped due to their insatiable thirst for vengeance: most have abandoned worship of the Light, and their allegiances have also changed, and most suffer psychologically from extensive use of mana siphoning, due to the Sunwell‘s corruption and subsequent destruction. A DM should consider applying the mana withdrawal optional rule with Blood Elves.",
                        "Affiliation": "Horde or independent. Most of the blood elves have joined the New Horde, invited to do so by the Banshee Queen Sylvanas Windrunner."
                    },
                    "NightElf": {
                        "Name": "Night Elf (Kal'dorei)",
                        "Quote": "The horn has sounded, and I have come as promised. I smell the stench of decay and corruption in our land. That angers me greatly. - Malfurion Stormrage",
                        "Description": "As a night elf, you hail from Darnassus in Kalimdor. The race‘s prominent eyebrows, long pointed ears and natural aspects imply a feral grace. Skin tones range from pale white to blue or even ruddy red, and their hair ranges in color from bright white to woodland green to lustrous black.",
                        "AbilityScoreIncrease": "Your Spirit score increases by 1.",
                        "Affiliation": "Alliance or independent. The night elves are members of the Alliance, but they are not the most trusted or highly regarded members of this group of races. Although honorable and just, the night elves‘ natural distrust has tainted their relations somewhat. Combined with their mystical appearances and mysterious natures, interactions with other races become uncomfortable at times. There is a strong streak of isolationism in the Kaldorei, for they are uncomfortable leaving the verdant mists of Teldrassil.",
                        "FamilyNames": "Moonblade, Glaivestorm, Proudstrider, Oakwalker, Nightwing, Staghorn"
                    },
                    "Nightborne": {
                        "Name": "Nightborne (Shal'dorei)",
                        "Quote": "My people face a similar dilemma. I peered into all possible futures in search for an answer... and found only one - Malfurion Stormrage - Elisande, Grand Magistrix of the Nightborne",
                        "Description": "As a Nightborne, you hail from the ancient city of Suramar, and have spent your life sheltered by the power of the Nightwell (a simulacrum of the Well of Eternity), and the dome of arcane power weaved by Elisande, the Grand Magistrix. The nightborne look similar to night elves, but their overall appearance is darker. Their skin does not have the brighter skin tones of purple and pink that night elves do, instead having more pale skin with dark blue-purplish tones. A Shal'dorei's hair is also far less colorful than the Kal'dorei's, having only white, gray, black, or very pale-blue hair colors. Glowing tattoos seem common among nightborne, though whether these are cosmetic or a result of the Nightwell's energy is unknown. Their eyes glow a light blue.",
                        "AbilityScoreIncrease": "Your Intelligence score increases by 1.",
                        "Affiliation": "Horde or Independent. When the dome began unweaving after the Battle of Nighthold during the third Burning Legion invasion of Azeroth, the leaders of the Nightborne elected to let it fade, subjecting the Nightborne to the same withdrawal the High Elves face, rather than face the alternative. Electing to join the Horde, the Nightborne found new and steadfast allies in the Blood Elves when they re-appeared in the world of Azeroth. Nightborne that are more independentminded also roam the world, searching for ways to satiate their thirst for magic before it becomes an obsession like the Blood Elves"
                    },
                    "VoidElf": {
                        "Name": "TODO",
                        "Quote": "TODO",
                        "Description": "TODO",
                        "AbilityScoreIncrease": "TODO",
                        "Affiliation": "TODO"
                    }
                }
            }
        },

        "Rules": {
            "Mechanics": {
                "AbilityScoreSummary": {
                    "Label": "Ability Score Summary",
                    "Blocks": {
                        "1": {
                            "Content": "Measures: Natural athleticism, bodily power<br>Important for: Death Knight, Paladin, and Warrior"
                        },
                        "2": {
                            "Content": "Measures: Physical agility, reflexes, balance, poise<br>Important for: Hunter, Monk, Rogue"
                        },
                        "3": {
                            "Content": "Measures: Health, constitution, vital force<br>Important for: Everyone"
                        },
                        "4": {
                            "Content": "Measures: Mental acuity, information recall, analytical skill<br>Important for: Alchemist, Mage, Tinker"
                        },
                        "5": {
                            "Content": "Measures: Awareness, intuition, wisdom<br>Important for: Druid, Priest, Shaman"
                        },
                        "6": {
                            "Content": "Measures: Confidence, eloquence, leadership<br>Important for: Warlock"
                        }
                    }
                },
                "DeterminingAbilityScores": {
                    "Label": "Determining Ability Scores",
                    "Blocks": {
                        "1": {
                            "Label": "Focus and Foible",
                            "Content": "This method leads to more focused characters with clearer weaknesses. Before applying modifiers, choose a one focus (an ability score you‘re good at) and one foible (an ability score you‘re bad at).<br><i>Focus</i>. Mark this attribute as 18<br><i>Foible</i>. Mark this attribute as 8<br><br>Set your remaining attributes at 10, and distribute 16 points among the ability scores in any way you desire. You may reduce an existing attribute by up to 2 points to gain 2 points to add to another attribute."
                        },
                        "2": {
                            "Label": "Heroic Roll",
                            "Content": "This method leads to generally stronger characters than by normal rolling. For each ability score, roll 2d6 + 6."
                        }
                    }
                },
                "Beyond1stLevel": {
                    "Label": "Beyond 1st Level",
                    "Content": "<p>The rules in the World of Warcraft 5e RPG also include crafting sub-systems and classes (such as the Alchemist and Tinker), and various options (such as the <a class=\"entity-link inline\" data-pack=\"warcraft5e.feats\" data-id=\"enBseIfaasp0D7xv\">Infusionist</a> feat) that can translate wealth into character power. When creating a character from above 1st level, refer to the following guidelines for expected wealth for level to give a general idea how to keep characters on the same general level of wealth. Refer to the Item Creation Complexity and Cost Table on Chapter 7 to calculate item rarity. Note that crafting an item costs onehalf the cost of buying it.</p><p>The amount of wealth carried by a character can vary significantly depending on starting resources, unexpected loot gained in the campaign, whether or not characters have downtime to gather additional wealth, inherited gold, or even  ossessing companies and strongholds under their control.</p>",
                    "Blocks": {
                        "1": {
                            "Label": "Magical Item Budget",
                            "Content": "A DM may refer to the above chart to determine the total worth of magic items the characters have, without actually explicit magic items to be sold. In this case, the wealth is not the expected wealth of the character, but the cost of the magic items the player should have by the appropriate level. This can come in the form of quest gifts, a normal item improving into a magical one, or a permanent blessing or infusion upon a held item. The expected cost of magic items relative to rarity is present in Chapter 7."
                        },
                        "2": {
                            "Label": "Expected Downtime",
                            "Content": "In case of crafting classes (Alchemist and Tinker), or in cases where characters can create magical items (taking the Infusionist feat), a good amount of downtime to allow the classes to function at a competitive rate is usually 5 days to 1 week between adventures (or the same time for every 3-5 combat encounters). That way, very complex projects (2 weeks) like building a mecha or vehicle can be done every two adventures. With such options available, players benefit more from wealth and time to build the exact items they need, from scrolls, potions, explosives, and more spells in a mage's spellbook, to advanced constructs and vehicles such as gyrocopters, so exercising judgment is key."
                        }
                    },
                    "TypicalWealth": "Typical Wealth"
                },
                "Advantage": {
                    "Label": "Advantages and Disadvantages",
                    "Content": "<p>Sometimes a special ability or spell tells you that you have advantage or disadvantage on an ability check, a saving throw, or an attack roll. When that happens, you roll a second d20 when you make the roll. Use the higher of the two rolls if you have advantage, and use the lower roll if you have disadvantage. For example, if you have disadvantage and roll a 17 and a 5, you use the 5. If you instead have advantage and roll those numbers, you use the 17.</p><p>If multiple situations affect a roll and each one grants advantage or imposes disadvantage on it, you don't roll more than one additional d20. If two favorable situations grant advantage, for example, you still roll only one additional d20.</p><p>If circumstances cause a roll to have both advantage and disadvantage, you are considered to have neither of them, and you roll one d20. This is true even if multiple circumstances impose disadvantage and only one grants advantage or vice versa. In such a situation, you have neither advantage nor disadvantage.</p><p>When you have advantage or disadvantage and something in the game, such as the halfling's Lucky trait, lets you reroll the d20, you can reroll only one of the dice. You choose which one. For example, if a halfling has advantage or disadvantage on an ability check and rolls a 1 and a 13, the halfling could use the Lucky trait to reroll the 1.</p><p>You usually gain advantage or disadvantage through the use of special abilities, actions, or spells. Inspiration can also give a character advantage. The GM can also decide that circumstances influence a roll in one direction or the other and grant advantage or impose disadvantage as a result.</p>"
                },
                "Resistance": {
                    "Label": "Damage Resistance and Vulnerability",
                    "Content": "<p>Some creatures and objects are exceedingly difficult or unusually easy to hurt with certain types of damage.</p><p>If a creature or an object has resistance to a damage type, damage of that type is halved against it. If a creature or an object has vulnerability to a damage type, damage of that type is doubled against it.</p><p>Resistance and then vulnerability are applied after all other modifiers to damage. For example, a creature has resistance to bludgeoning damage and is hit by an attack that deals 25 bludgeoning damage. The creature is also within a magical aura that reduces all damage by 5. The 25 damage is first reduced by 5 and then halved, so the creature takes 10 damage.</p><p>Multiple instances of resistance or vulnerability that affect the same damage type count as only one instance. For example, if a creature has resistance to fire damage as well as resistance to all nonmagical damage, the damage of a nonmagical fire is reduced by half against the creature, not reduced by three-quarters.</p>"
                }
            }
        },

        "Feats": {
            "AbilityScoreImprovement": {
                "Label": "Ability Score Improvement",
                "Description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can‘t increase an ability score above 20 using this feature."
            },
            "AbilityScoreImprovementWarrior": {
                "Label": "Ability Score Improvement (Warrior)",
                "Description": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can‘t increase an ability score above 20 using this feature."
            },
            "Alchemy": {
                "Label": "Alchemy",
                "Description": "When starting with this class, you have proficiency with Alchemist‘s Supplies and can use them with uncanny skill. You can create alchemical mixtures from any spell that belongs to the alchemist spell list, so long as you have the alchemical formula. This does not allow you to cast spells, only to know them enough to create potions. Each level in the alchemist class provides you with 1 caster level to access alchemical formulae, as appropriate to the alchemist spell list.<br><br><h4>Cantrips</h4>At 1st level, you know a number of cantrips equal to your proficiency bonus. As normal for alchemist spells, you cannot cast them, but can turn them into potions. Cantrips do not require a formula book, and are always memorized.<br><br><h4>Conjuring and Binding</h4>An alchemist can conjure and bind aberrations, constructs, elementals, oozes, plants, and undead, as well homunculi creatures (creatures with the homunculus template). This is usually done by crafting miniature versions and preparing them in potions or globes of alchemical mixtures.<br><br><h4>Preparing and Casting Spells</h4>Each alchemist level provides you with one caster level in the alchemist class (minimum 1). You follow the normal progression to unlock spell levels (see the table under the Mana section). You may not prepare spells, but can brew them into potions, so long as you have your formulae book or have memorized the formula. When you level up, you can exchange a spell known with another you qualify for. You cannot otherwise change your alchemist spells other than by leveling up and exchanging them, or by training under another alchemist, fiend, celestial, or undead creature (see tutorship under magic).<br><br><h4>Spellcasting Ability</h4>Intelligence is your spellcasting ability for your alchemist spells and abilities, since your powers draw upon your scientific prowess. You use your Intelligence modifier whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for an alchemist effect you create and when making an attack roll with one.<br><br><strong>Spell save DC</strong> = 8 + your proficiency bonus + your Intelligence modifier<br><strong>Spell attack modifier</strong> = your proficiency bonus + your Intelligence modifier<br><br><h4>Spellbook – Formula Book</h4>At 1st level, your formula book contains four 1st-level alchemist spells of your choice. When you level up, you gain 2 additional alchemist spells of your choice. You may also acquire new spells by  research, tutelage, or by deriving formulae from the spellbooks and scrolls of spellcasters who have spell versions of the formulae on your spell list. Your formula book is effectively your spellbook, and you may add spells by studying with it and replicating experiments found in other formula books."
            },
            "BattleCommands": {
                "Label": "Battle Commands",
                "Description": "You gain the Shout talent for free (if you don‘t already have it). Furthermore, whenever you attack with your off-hand weapon as a bonus action, you can maintain a shout or apply one strike effect."
            },
            "BattleTested": {
                "Label": "Battle-Tested",
                "Description": "Your innovated creations that have been used at least three times without breaking down can be kept unused indefinitely (instead of breaking down after 5 minutes). If you choose to make the item into a permanent creation, you must pay the normal crafting cost, but the item‘s malfunction rate is 1 point lower (minimum 0). This improved model can be shared and scribed down as a new innovation. You cannot battle-test a base design more than once.<br>You may also deal double damage to objects and constructs with your melee attacks as a strike effect.<br><br><i>Special</i>: For the purposes of the Superfunction ability, battle-tested creations act as if its malfunction rate is 1 point higher instead of 1 point lower."
            },
            "BlockAndTackle": {
                "Label": "Block and Tackle",
                "Description": "You may use a reaction to block a weapon attack that hits you, reducing the damage taken by 1d12 + your Stamina modifier. This requires a shield. If this reduces the damage to 0 points, you may use the same reaction to attack the target with an opportunity attack. You can use this feature a number of times equal to your Stamina bonus (minimum 2 uses). Once all uses are expended, they are restored after a short rest.<br>You may expend two uses of this ability and benefit an ally within 5 feet of you with this ability instead of you, reducing the damage on them as described (and targeting whoever harmed them with an opportunity attack). If whoever struck your ally is not within your melee range for the opportunity attack, you may move up to 5 feet to deliver it."
            },
            "BloodThirst": {
                "Label": "Blood Thirst",
                "Description": "You may attack again if you miss an attack. This does not require a separate action from the one used to make the attack. If you make use of this ability, the target is not counted as if they were hit for the purposes of the Strike the Wound ability unless you also successfully hit them. You may use this number of times equal to your Stamina modifier, which replenishes upon completing a short or long rest.<br>Furthermore, if you miss an attack roll against an enemy, you are treated as if you successfully landed a hit for the purposes of the Strike the Wound ability."
            },
            "BloodyRibbons": {
                "Label": "Bloody Ribbons",
                "Description": "Whenever you spend a Bonus Action to make an attack with your off-hand weapon, you can instead make two attacks. Also, whenever you would gain an action (such as by the haste spell or Action Surge ability), you double the attacks you can normally make with your Bonus Action.<br>Bloody Ribbons expends a use of your Bloodthirst ability."
            },
            "CleavingStrike": {
                "Label": "Cleaving Strike",
                "Description": "When you successfully attack and damage a creature with a melee attack, you spend a bonus action to attack another creature you choose that is within 5 feet away from the first target."
            },
            "ConsistentInnovations": {
                "Label": "Consistent Innovations",
                "Description": "You have advantage to any tool check to maintain an innovated device, and the maximum duration increases from 5 minutes to 1 hour. You lessen the malfunction rate of innovated devices by 2 points (to a base increase of only 2 points)."
            },
            "CoolnessUnderFire": {
                "Label": "Coolness under Fire",
                "Description": "You may spend 4 Crafting Points to take 10 on any attack roll with an engineered device or ability check with Engineer‘s Tools."
            },
            "CornerBlastStrike": {
                "Label": "Corner Blast Strike",
                "Description": "Whenever you use an explosive, you may center it against one creature in the area of effect, dealing two additional dice of damage. This is a strike effect that can target only one creature within the blast. If the explosive already affects only a single creature (either by design or by fact), this is applied automatically without using a bonus action.<br>You also gain the mortar, rocket launcher, cluster launcher and mine launcher blueprints for no cost, and they consume half the normal fuel."
            },
            "DieByTheSword": {
                "Label": "Die by the Sword",
                "Description": "You are inspired by battlefield glories, and are able to react quickly to attacks. Whenever a target within 5 feet of you makes a successful attack against you, you gain a d6 Counterattack dice. You may spend the dice to make an attack as a reaction at any point out of your turn so long as the target dealt damage to you in the last minute, and may add the counterattack dice result to the total damage. Unlike with normal reactions, you may apply one strike effect to this attack. You can hold up to 3 Counterattack dice. They all fade within one minute if not consumed."
            },
            "EfficientEngineering": {
                "Label": "Efficient Engineering",
                "Description": "Your ability to whip up devices increases your efficiency in creating normal devices. You reduce the base crafting cost for technological devices from one-half to one-quarter buying price. This does not affect the costs of material components for spells nor does it affect the crafting costs for your Innovation ability. Normally crafting a device is also one step of complexity faster. This does not also reduce the cost of spell material components.<br>Starting at 15th level, this ability also halves the cost of spell material components for your gadget devices."
            },
            "Engineering": {
                "Label": "Engineering",
                "Description": "Starting when you gain your first level in this class, you are a master of engineering in the making.<br>You gain an engineer‘s notebook and can perform marvels with the skill that few can even imagine.<br><br><i>Notebook</i><br>At 1st level, your notebook contains four blueprints of your choice that detail the specifications of any device you can create. When you level up, you gain 2 additional blueprints of your choice. You may also acquire new blueprints by research, tutelage, or from the notebooks and blueprints of tinkers who have devices you can create."
            },
            "EngineeringMastery": {
                "Label": "Engineering Mastery",
                "Description": "You may identify the weaknesses and command triggers for any device you see. You gain the ability to deduce the operation and design of any device you operate or have one hour to study, and have a 20% chance to recreate it from memory. You can also spend a reaction if hit by a weapon attack made from a construct, trap, or engineered device (except firearms and crossbows) to halve the amount of damage you take from it. This does not stack with the bonus from your Evasion ability."
            },
            "Evasion": {
                "Label": "Evasion",
                "Description": "You can nimbly dodge out of the way of certain area effects, such as a red dragon‘s fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make an Agility saving throw to take only half damage, you instead take no damage if you succeed  on the saving throw, and only half damage if you fail. You regain 2 Crafting Points if you suffer no damage from a successful saving throw. If you make a saving throw versus an effect made by you, you can either take half damage automatically or make a saving throw. If you choose to make a saving throw, you take no damage on a successful save, but take normal (full) damage on a failed save. After gaining 2 Crafting Points, you cannot gain more unless you complete a short rest."
            },
            "ExplosiveMastery": {
                "Label": "Explosive Mastery",
                "Description": "Starting when you choose this archetype at 3rd level, you increase the range of your bombs and rockets by 15 feet, and the range of your mine‘s detection to its blast radius (beyond its actual position). Also, any explosive you use is automatically modified by the Careful Explosion modification, with no cost to the modification. If you roll a careen on mishap with an explosive, you may roll twice and choose the second result (even if it‘s worse)."
            },
            "ExplosiveResistance": {
                "Label": "Explosive Resistance",
                "Description": "You gain resistance to concussive, thunder, and bludgeoning damage.<br>Also, whenever you are in the area of concussive damage or the blast radius of an explosion, you can ‘ride the blast‘ and move up to one-half your speed away from the center of the blast, even if you otherwise took no damage from it (such as by using the Evasion ability). This can propel you upward if the explosion takes place under you. This distance is added to the distance the explosion already moves you (if possible)."
            },
            "ExtensiveDesigning": {
                "Label": "Extensive Designing",
                "Description": "Whenever you apply the Quick Use modification to your devices (as described under Quick Cooldown above), you reduce it by a further step.<ul><li>Gadgets that replicate spell levels above 3rd level have their cooldown reduced to 1 minute instead of 1 hour.</li><li>Gadgets that replicate spell levels above 6th level have their cooldown reduced to 1 hour instead of 8 hours.</li></ul> You may also add your proficiency bonus to attack rolls with your constructs."
            },
            "ExtraAttackWarrior": {
                "Label": "Extra Attack (Warrior)",
                "Description": "You can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
            },
            "FavoredCreations": {
                "Label": "Favored Creations",
                "Description": "you gain increased proficiency in innovation. Choose up to four devices. These devices have half the Crafting Point cost, and their formulae are memorized. You may change a single favored creation with one week of downtime."
            },
            "FightingStyle": {
                "Label": "Fighting Style",
                "Description": "<p>You adopt a particular style of fighting as your specialty. Choose one of the following options. You can‘t take a Fighting Style option more than once, even if you later get to choose again.</p><br><h4>Archery</h4><p>You gain a +2 bonus to attack rolls you make with ranged weapons.</p><br><h4>Defense</h4><p>While you are wearing armor, you gain a +1 bonus to AC.</p><br><h4>Dueling</h4><p>When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.</p><br><h4>Great Weapon Fighting</h4><p>When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.</p><br><h4>Protection</h4><p>When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.</p><br><h4>Two-Weapon Fighting</h4><p>When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.</p>"
            },
            "FirearmImprovement": {
                "Label": "Firearm Improvement",
                "Description": "Firearms you create always benefit from one free modification (equivalent to 1 EP point), chosen from any modification that applies to firearms. Also, whenever you apply an add-on to your firearms and suffer a malfunction, you can choose to let only the add-on suffer the condition."
            },
            "FirstBlood": {
                "Label": "First Blood",
                "Description": "You gain a +2 bonus to your attack rolls and can add your Strength modifier to your damage rolls so long as you are targeting a creature that is above half their maximum hit points (or is not Bloodied). This is applied even if you normally add your Agility modifier to damage."
            },
            "FlashBomberTinker": {
                "Label": "Flash Bomber (Tinker)",
                "Description": "You gain the Flash Bomber talent, but may only use it for explosives."
            },
            "GreaterFlashBomber": {
                "Label": "Greater Flash Bomber",
                "Description": "You double the amount of times you may use the Flash Bomber talent before a rest, and can use any explosive (not just in bomb form). You also gain the remote blueprint for free if you didn‘t already have it, and may employ it to trigger any number of your explosives normally, and can use it with a reaction."
            },
            "Hellscream": {
                "Label": "Hellscream",
                "Description": "All hostile creatures within range of your shouts take Thunder damage equal to half your level whenever you shout or maintain one. They are entitled a Stamina saving throw to half damage contested by your own Stamina saving throw.<br>Also, your critical range for your Strike the Wound ability becomes 15-20. "
            },
            "Infusionist": {
                "Label": "Infusionist",
                "Description": "You gain proficiency with the infusion skill and can make infused items."
            },
            "Innovation": {
                "Label": "Innovation",
                "Description": "You gain the ability to craft temporary and unstable technological creations at certain levels. Such creations have limitations compared to normal crafting (as described in Chapter 7), but are more accessible and useable in combat. You also need the required tools at hand (Engineer's Tools).<br>Creating temporary technological device costs an Action if a Consumable, 3 turns if a use-item (such as a firearm), or 1 minute if a Creature (such as turret or combat armor).<br><br><table><tr><th>Level</th><th>Rarity</th><th>Point Cost<sup>1</sup></th><th>Material Cost<sup>2</sup></th></tr><tr><td>1</td><td>Common</td><td>5</td><td>1 gp<sup>3</sup></td></tr><tr><td>1</td><td>Uncommon</td><td>7</td><td>4 gp</td></tr><tr><td>5</td><td>Rare</td><td>9</td><td>16 gp</td></tr><tr><td>9</td><td>Epic</td><td>11</td><td>64 gp</td></tr><tr><td>13</td><td>Legendary</td><td>13</td><td>256 gp</td></tr><tr><td>17</td><td>Artifact</td><td>15</td><td>1024 gp</td></tr></table><br>1) You reduce the crafting point cost by your proficiency bonus. You may reduce the point cost by your proficiency bonus (not applied above). Common items can have their point cost reduced to 0.<br>2) The crafting cost is unaffected by the Efficient Alchemy feature. Unlike normal crafting, the base crafting cost in materials is not modified for crafting class (x25 for Creatures), and thus innovating a Consumable costs the same as a Creature.<br>3) Starting at 5th level, your Common-level temporary creations do not consume crafting materials, but still require access to your tools (Engineer's Tools).<br><br><h3>Crafting Point Cost</h3>Your ability to do such rapid and innovative creations strains your mind and creative capabilities. You are afforded a pool of Crafting Points (which act as Mana Points). Similarly to Mana Points, you spend points to spontaneously craft items, and regain such points by resting. This is subject to the following points of difference, however:<ul><li>You have a number of Crafting Points equal to your Intelligence score (not modifier) plus your proficiency bonus plus one-half your Tinker level (round down). Unlike mana points, your pool is unaffected by the spell level you can access. As this power is not magical in nature, you are unaffected by any anti-magic effects such as an antimagic field or mana burn effects.</li><li>You do not regain points by mana-restorative effects, such as Mana Potions or resting near mana fountains. However, so long as you are in a relevant resource node or crafting area (such as an engineering workshop or your stronghold), you regain points with a +50% increase, as you draw inspiration from them.</li><li>Your creation costs scale by the item‘s rarity and your ability to craft them; and are thus limited by the Rarity column in your class chart. You can craft anything you have memorized or if you refer to the formula of in your possession (such as in your formulae book). A temporary creation that breaks down, fails, or expires can be harvested for one-half the crafting materials invested. This does not apply to Consumables that were successfully used.  Your temporary creations can be made permanent by paying the rest of the crafting cost.</li></ul><br><h3>Material Cost</h3>As well as consuming Crafting Points, temporary creations also cost material costs appropriate to their rarity, as detailed above.<br><br><h3>Temporary Item Duration</h3>Once created, the temporary item remains until used (if a Consumable), until it breaks down (if a Use-Item or Creature), or up to 5 minutes. Temporary creations are not stable, and if the item is not a consumable in nature, you must succeed on a tool check (Engineer's Tools) against a DC of 15 after a successful use (if a Use-Item), 1 minute (if a Creature), or the creation breaks down.  If the item is not being used by you (or a creature bound to you), it has a +4 increase to its malfunction rate. You may maintain multiple temporary creations, but they all begin expiring starting from the round they were crafted.<br><br><h3>At Higher Levels</h3> As you increase in levels, creations of certain rarity require less time and effort. The time it takes for you to innovate or craft temporary versions of your creations is reduced to a Bonus Action or 3 turns at the following levels for each rarity.<br><br><table><tr><th>Level</th><th>Rarity</th><th>Consumable</th><th>Use-Item</th><th>Creature</th></tr><tr><td>2nd</td><td>Common</td><td>Bonus Action</td><td>1 turn</td><td>3 turns</td></tr><tr><td>9th</td><td>Uncommon</td><td>Bonus Action</td><td>1 turn</td><td>3 turns</td></tr><tr><td>17th</td><td>Rare</td><td>Bonus Action</td><td>1 turn</td><td>3 turns</td></tr></table>"
            },
            "Inurement": {
                "Label": "Inurement",
                "Description": "You also gain the ability to craft temporary and unstable alchemical creations at certain levels. Such creations have limitations compared to normal crafting (as described in Chapter 7), but are more accessible and useable in combat. You also need the required tools at hand (Alchemist‘s Supplies). Creating temporary alchemical creations costs an Action if a Consumable, or 1 minute if a Creature (such as an alchemical homunculus or an Ooze).<br><br><table><tr><th>Level</th><th>Rarity</th><th>Point Cost<sup>1</sup></th><th>Material Cost<sup>2</sup></th></tr><tr><td>1</td><td>Common</td><td>5</td><td>1 gp<sup>3</sup></td></tr><tr><td>1</td><td>Uncommon</td><td>7</td><td>4 gp</td></tr><tr><td>5</td><td>Rare</td><td>9</td><td>16 gp</td></tr><tr><td>9</td><td>Epic</td><td>11</td><td>64 gp</td></tr><tr><td>13</td><td>Legendary</td><td>13</td><td>256 gp</td></tr><tr><td>17</td><td>Artifact</td><td>15</td><td>1,024 gp</td></tr></table><br><br>1) You reduce the crafting point cost by your proficiency bonus. You may reduce the point cost by your proficiency bonus (not applied above). Common items can have their point cost reduced to 0.<br>2) The crafting cost is unaffected by the Efficient Alchemy feature. Unlike normal crafting, the base crafting cost in materials is not modified for crafting class (x25 for Creatures), and thus innovating a Consumable costs the same as a Creature.<br>3) Starting at 5th level, your Common-level temporary creations do not consume crafting materials, but still require access to your tools (Alchemist‘s Supplies).<br><br><h3>Crafting Point Cost</h3>Your ability to do such rapid and innovative creations strains your mind and creative capabilities. You are afforded a pool of Crafting Points (which act as Mana Points). Similarly to Mana Points, you spend points to spontaneously craft items and regain such points by resting. This is subject to the following points of difference, however:<br><ul><li>You have a number of Crafting Points equal to your Intelligence score (not modifier) plus your proficiency bonus plus one-half your Alchemist level (round down). Unlike mana points, your pool is unaffected by the spell level you can access. As this power is not magical in nature, you are unaffected by any anti-magic effects such as an antimagic field or mana burn effects.</li><li>You do not regain points by mana-restorative effects, such as Mana Potions or resting near mana fountains. However, so long as you are in a relevant resource node or crafting area (such as an alchemical grove or your stronghold), you regain points with a +50% increase, as you draw inspiration from them.</li><li>Your creation costs scale by the item‘s rarity and your ability to craft them; and are thus limited by the Rarity column in your class chart. You can craft anything you have memorized or if you refer to the formula of in your possession (such as in your formulae book).</li></ul><br>A temporary creation that breaks down, fails, or expires can be harvested for one-half of the crafting materials invested. This does not apply to Consumables that were successfully used. Your temporary creations can be made permanent by paying the rest of the crafting cost.<br><br><h3>Material Cost</h3>As well as consuming Crafting Points, temporary creations also cost material costs appropriate to their rarity, as detailed above.<br><br><h3>Temporary Item Duration</h3>Once created, the temporary item remains until used (if a Consumable), until it breaks down (if a Creature), or up to 5 minutes. Temporary creations are not stable, and if the item is not a consumable in nature, you must succeed on a tool check (Alchemist‘s Supplies) against a DC of 15 after 1 minute (if a Creature), or the creation breaks down. If the item is not being used by you (or a creature bound to you), it has a 50% failure rate. You may maintain multiple temporary creations, but they all begin expiring starting from the round they were crafted.<br><br><h3>At Higher Levels</h3>As you increase in levels, creations of certain rarity require less time and effort. The time it takes for you to inure or craft temporary versions of your creations is reduced to a Bonus Action or 3 turns at the following levels for each rarity.<table><tr><th>Level</th><th>Rarity</th><th>Consumable</th><th>Creature</th></tr><tr><td>2nd</td><td>Common</td><td>Bonus Action</td><td>3 turns</td></tr><tr><td>9th</td><td>Uncommon</td><td>Bonus Action</td><td>3 turns</td></tr><tr><td>17th</td>Rare</td><td>Bonus Action</td><td>3 turns</td></tr></table>"
            },
            "KnackForIt": {
                "Label": "Knack for It",
                "Description": "You can use your bonus action to make an Agility (Sleight of Hand) check or use your Thieves‘ Tools to disarm a trap or open a lock.<br>Furthermore, you can choose to lower the malfunction rating of all devices you create by 2 points (minimum 1)."
            },
            "MasterOfArms": {
                "Label": "Master of Arms",
                "Description": "When you use a strike effect, you can apply it to all your attacks until the start of your turn in the next round, so long as the strike has sufficient uses."
            },
            "MortalStrike": {
                "Label": "Mortal Strike",
                "Description": "You may severely wound a creature‘s healing capabilities if you successfully apply a mortal strike. If a creature is affected by a Mortal Strike, they must succeed on a Stamina saving throw against a DC equal to 8 + your proficiency bonus + your Strength bonus or take 50% less healing from all sources for one minute. So long as a creature is affected this way, it is always treated as if it is Bloodied for the purposes of your First Blood feature. A creature cannot be affected by this ability more than once in 24 hours."
            },
            "Overpower": {
                "Label": "Overpower",
                "Description": "You may, after successfully damaging an enemy with a melee attack, regain hit points equal to double your Proficiency bonus. You may instead grant half the benefit to any ally within 30 feet. This is a strike effect that costs a bonus action. The enemy must be a qualifying threat to you for you to use this ability. If the target of this strike was also successfully affected by your Mortal Strike feature, you gain double the normal amount of hit points."
            },
            "Patent": {
                "Label": "Patent",
                "Description": "You gain increased mastery over a single engineered device of your creation that is not a consumable. Your Patented device does not malfunction when being used.<br>Furthermore, if a construct or gadget, it takes one-quarter the fuel as normally required for a single use. This stacks with the reduction for certain devices (such as strike effect gadgets).<br>The device may malfunction condition from other circumstances or abilities. This bonus only applies to your Patent device, and does not extend to Innovated devices (even if they are of your Patented device)."
            },
            "PracticedPrecision": {
                "Label": "Practiced Precision",
                "Description": "You do not take disadvantage to your ranged attack roll while being within 5 feet of a hostile creature, even if you don‘t attack them in melee first. You also gain the Sharpshooter feat for free. If you already had it, you gain the Archery fighting style (applicable to firearms only)."
            },
            "PrecisionGuesswork": {
                "Label": "Precision Guesswork",
                "Description": "You spend half the required Crafting Points for the Coolness under Fire, Works as Intended, and Shutdown abilities."
            },
            "ProtectiveShell": {
                "Label": "Protective Shell",
                "Description": "All your constructs always benefit from the Coated Interior and Efficient Fuel modifications (for a total fuel reduction of 1/8 the normal cost for constructs). You may also double the Construct‘s Challenge Rating to its maximum hit points.<br>Also, whenever you activate a gadget that requires a harness or concentration, you gain temporary hit points equal to 1d10 + your Tinker level, which remain until the gadget stops operating. This does not stack with the benefit of the Coated Interior modification."
            },
            "QuickCooldown": {
                "Label": "Quick Cooldown",
                "Description": "Starting when you choose this archetype at 3rd level, your gadgets and constructs always benefit from the Quick Use and Quick Startup modifications, respectively. This has no cost."
            },
            "QuickReload": {
                "Label": "Quick Reload",
                "Description": "Starting when you choose this archetype at 3rd level, you may use a bonus action to reload a firearm instead of an action. If you perform the Touch-Blast Strike special attack or attack with your firearm as a melee attack, you can also reload as part of the action, and you may add your proficiency bonus to attacks with firearms without bayonets. If you use a bayonet, you deal 2 extra points of damage with melee attacks with them."
            },
            "QuickTech": {
                "Label": "Quick Tech",
                "Description": "You may use your innovate ability on a device of equal rarity, and permanently alter the properties of the device. This device does not have to be built by you, nor does it have to be temporarily-created. This costs the same number of Crafting Points as well as the same time."
            },
            "RestoredStrength": {
                "Label": "Restored Strength",
                "Description": "You may use the Second Wind talent three times before requiring rest. Furthermore, whenever you use Second Wind, you gain resistance to any damage you take for one round after use, and advantage against any saving throw made against the first spell that affects you in the next minute.<br>If you don‘t already have the Second Wind talent, you gain it as a talent instead of improving it."
            },
            "Scavenge": {
                "Label": "Scavenge",
                "Description": "When you gather raw materials for use with engineering, you gain triple the total value. This applies when harvesting existing devices, nodes, creatures, and deconstructing devices. If dismantling an item, this cannot exceed one-half the value of creating the item itself (counting any reductions)."
            },
            "Shutdown": {
                "Label": "Shutdown",
                "Description": "You may expend 2 Crafting Points and a bonus action to increase the malfunction rate of any device within 10 feet of you by 5 points for up to 1 hour. You can target your own devices to increase the risk of malfunction and Superfunction (up to a 50% chance for either). If you attempt to apply this feature to another device while it is active, its benefits end for the previous one."
            },
            "SolidEngineering": {
                "Label": "Solid Engineering",
                "Description": "Your devices do not lose charges when they are damaged, and all your devices (except bombs and firearms) consume half the normal fuel (this may stack with the Efficient Fuel modification).<br>Also, you memorize the formula for phlogiston, gaining proficiency in Alchemist‘s Supplies if you don‘t already have it."
            },
            "SpecialBullets": {
                "Label": "Special Bullets",
                "Description": "You gain the Suffused Arrows talent (gaining proficiency as appropriate), and can create special infused bullets. You also deal 3 extra points of damage with any unmodified bullets."
            },
            "StrikeTheWound": {
                "Label": "Strike the Wound",
                "Description": "You gain momentary clarity towards causing further wounds after landing the first. If you make a successful melee attack roll against a target, your weapon attack can score a critical hit on a lower result of the dice (on a natural 19 or 20 instead of only 20). This effect stacks to a maximum roll of 17-20, and ends at the start of your turn in the next round.<br>Also, you gain the Dual Wielder feat if you didn‘t already have it. If you already have it, you add +1 to your weapon damage rolls with either weapon."
            },
            "SunderingStrike": {
                "Label": "Sundering Strike",
                "Description": "You may sunder an enemy‘s armor, reducing their AC by 1 point per strike (up to -5, but never below that of their AC if unarmored). This effect remains until the armor is tended to with the appropriate artisans‘ tools and 1 hour of work.<br>This can be applied to natural armor. In this case, the AC is restored upon completing a short rest."
            },
            "Superfunction": {
                "Label": "Superfunction",
                "Description": "Your genius allows you to use malfunction rates to your benefit. Whenever you use a device, there is a chance it performs unexpectedly well—thus the greater the malfunction rate, the greater the superfunction rate. A Superfunction can stack with a critical hit (if using a weapon-based engineered device).<br><br><i>Superfunction Rate = 20 - Malfunction Rate</i><br><br>For instance, an explosive that has a malfunction rate of 2 has a Superfunction rate of 18-20.<br><br>When a device superfunctions, it does not roll for a malfunction for the duration of the effect (see below, affected by energy source). It also gains a bonus depending on its energy source. Choose one benefit the device qualifies for.<br><ul><li><i>Better</i>: The next malfunction condition is negated, and the next use of the device consumes no fuel charges (so long as it doesn‘t have only one use)</li><li><i>Faster</i>: The device gains a 25% increase in movement speed (if a construct or vehicle) for 1 hour</li><li><i>Harder</i>: The device cannot lose charges by taking damage or suffer any negative effects that would normally cause it to loses charges (such as overcharging) for 1 hour</li><li><i>Stronger</i>: The device deals maximum damage (no need to roll) with the next (or current) damage roll it makes.</li></ul><br><i>Note</i>: Since your Patent device cannot malfunction, it can only Superfunction at a natural 20 use."
            },
            "TinkerPath": {
                "Label": "Tinker Path",
                "Description": "At 3rd level, you choose a path that you emulate in the exercise of your tinker abilities: Bomber who focuses on creating explosives, the Gunner who focuses on creating and shooting with firearms, and Gadgeteer who focuses on creating wondrous gadgets, all detailed at the end of the class description.<br>Your path choice grants you features at 3rd level and then again at 6th, 10th, and 14th levels."
            },
            "UnarmoredDefense": {
                "Label": "Unarmored Defense",
                "Description": "While you are not wearing any armor, your Armor Class equals 10 + your Agility modifier + your Stamina modifier. You can use a shield and still gain this benefit."
            },
            "Vanguard": {
                "Label": "Vanguard",
                "Description": "Whenever you start your round in a turn with below half your maximum hit points, and have no temporary hit points, you gain a number of temporary hit points equal to 1d12 + your Stamina modifier."
            },
            "Vigilance": {
                "Label": "Vigilance",
                "Description": "Starting at 10th level, your block and tackle ability blocks an additional 1d12 (for a total of 2d12 + your Stamina modifier). Whenever you perform an opportunity attack derived from your Block and Tackle ability, you can add one of the following effects. ",
                "Options": {
                    "1": "<i>Destructive Counter</i>: Your opportunity attack deals an additional 2d6 damage.",
                    "2": "<i>Disarming Counter</i>: Your opportunity attack drops the enemy‘s weapon. If they reach for it while threatened by you, you can make another attack of opportunity.",
                    "3": "<i>Pushing Counter</i>: Your opportunity attack pushes the enemy 5 feet away.",
                    "4": "<i>Repositioning Counter</i>: Your opportunity attack allows you to exchange places with an ally within 5 feet of you."
                }
            },
            "WarriorArchetype": {
                "Label": "Warrior Archetype",
                "Description": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose between the Arms Warrior, a champion in using great-weapons, the Fury Warrior, who focuses on bleeding his enemies and debilitating them tactically, or the Protection Warrior who focuses on defense while reflecting physical damage. All are detailed at the end of the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
            },
            "WarriorTalent": {
                "Label": "Warrior Talent",
                "Description": "Starting at 1st level, you gain a class talent, representing your preferred tactics and adaptability on the field of battle. See Class Talents at the end of the Chapter 3 for options.<br>Whenever you qualify for another talent (as detailed in the talent column), you can choose another talent or gain another use of an existing talent."
            },
            "WorksAsIntended": {
                "Label": "Works as Intended",
                "Description": "Starting at 11th level, you may spend 2 Crafting Points to remove the Malfunctioned condition of a device you are touching. This costs a bonus action or reaction. Also, removing the Malfunctioned condition requires 2d4 minutes instead of 1 hour (or the end of a short rest).<br>In both cases, this does not require you being familiar with the device."
            }
        },

        "Traits": {
            "Adapter": {
                "Label": "Adapter",
                "Description": "You may always act when surprised at a combat encounter (even if you failed your Perception check to notice it). You also have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> versus weather effects."
            },
            "ArcaneAffinity": {
                "Label": "Arcane Affinity",
                "Description": "You have increased affinity with arcane magic. You can choose one of the following two features:",
                "Options": {
                    "1": "<i>Augment Weave</i>. You deal one additional point of arcane damage for each damage dice with your arcane spells. This applies once per spell. You may apply this to spells that do not deal arcane damage, but only once per short or long rest",
                    "2": "<i>Arcane Strike</i>. You can enhance your attacks with a blast of arcane damage. As a [strike] effect, you can add 1d6 points of arcane damage to your melee or ranged weapon attacks. For every four character levels you gain, you gain an additional dice of damage. You may choose to spend them all at once or one for each attack. You regain all spent dice at the end of a short rest",
                    "3": "<i>Energy Blast</i>. You can release a blast of arcane force as if you possessed the Mystic Blast feat (arcane damage only). You may use this blast number of times equal to your Intelligence modifier before replenishing at a long rest. This deals a number of d4 dice equal to onequarter your level (minimum 1d4)."
                }
            },
            "ArcaneLegacy": {
                "Label": "Arcane Legacy",
                "Description": "The high elves are uniquely attuned to magic. You can choose one of the below abilities.",
                "Options": {
                    "1": "You increase your mana pool size by 2 mana points.",
                    "2": "You add an additional cantrip to your High Magic ability, chosen from the mage spell list.",
                    "3": "You gain the Suffused Arrows talent. You may only take this if your first level is a hunter."
                }
            },
            "BlessingOfTheNightwell": {
                "Label": "Blessing of the Nightwell",
                "Description": "You have resistance to arcane damage."
            },
            "BloodMagic": {
                "Label": "Blood Magic",
                "Description": "This acts as High Magic. While you use abilities granted by this ability, your eyes glow a pale fel green instead of High Elves‘ blue. Instead of the prestidigitation cantrip, you may choose the thaumaturgy cantrip instead, and may cast the mana burn spell instead of mute."
            },
            "Bravery": {
                "Label": "Bravery",
                "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> to all saves against fear."
            },
            "BronzebeardCombatTraining": {
                "Label": "Dwarven Combat Training",
                "Description": "You have proficiency with firearms and explosives of all types, even if you do not have proficiency in engineering, and gain proficiency with light armor."
            },
            "BurningHeart": {
                "Label": "Burning Heart",
                "Description": "You know the produce flame cantrip (caster level equal to your character level). Intelligence is your spellcasting ability for it."
            },
            "Darkvision": {
                "Label": "Darkvision",
                "Description": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            "DraeneiCombatTraining": {
                "Label": "Draenei Combat Training",
                "Description": "You have proficiency with the longsword, greathammer, glaive, and the heavy crossbow."
            },
            "DwarvenCombatTraining": {
                "Label": "Dwarven Combat Training",
                "Description": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
            },
            "ElvenCombatTraining": {
                "Label": "Elven Combat Training",
                "Description": "You have proficiency with the longsword, longbow, rapier, and shortbow."
            },
            "ExtraLanguage": {
                "Label": "Extra Language",
                "Description": "You can speak, read and write one extra language of your choice."
            },
            "FelResistance": {
                "Label": "Fel Resistance",
                "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">resistance</a> to fel damage."
            },
            "FireLordsFavor": {
                "Label": "Fire Lord's Favor",
                "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">resistance</a> to fire damage."
            },
            "Gemcutting": {
                "Label": "Gemcutting",
                "Description": "You are proficient with artisan's tools (jewelcrafting kit)."
            },
            "GiftOfTheNaaru": {
                "Label": "Gift of the Naaru",
                "Description": "You can use your action to channel holy energy, casting the renewing light spell as if cast as a 1st level spell. This can be used once, replenishing on a short or long rest. While a creature benefits from this ability, they have a glowing blue mark above their forehead (shedding light equal to dancing lights). Your spellcasting ability modifier is Spirit or Charisma (your choice)."
            },
            "HeroicPresence": {
                "Label": "Heroic Presence",
                "Description": "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + half your Charisma or Spirit modifier. A creature can't gain temporary hit points from this feature again until it has finished a long rest. Alternatively, you may declare use of this ability upon landing a critical hit."
            },
            "HighMagic": {
                "Label": "High Magic",
                "Description": "Magic. You know the prestidigitation cantrip and can cast it normally (caster level equal to your character level). When you reach 3rd level, you can also cast detect magic as a 1st level spell. When you reach 5th level, you can also cast the mute spell as a 2nd level spell. Intelligence is your spellcasting ability for these spells, and you use your mana pool for these abilities (even if you are not normally a spellcaster). While you use such abilities (and after using them for one hour), your eyes glow a pale blue. If you can already cast such spells (and have a sufficiently high caster level), they are always prepared for free."
            },
            "KeenSenses": {
                "Label": "Keen Senses",
                "Description": "You are proficient with the Perception skill."
            },
            "MaskOfTheWild": {
                "Label": "Mask of the Wild",
                "Description": "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
            },
            "MountainBorn": {
                "Label": "Mountain Born",
                "Description": "You're acclimated to high altitude, including elevations above 20,000 feet. You're also naturally adapted to cold weather in the wilderness or while exploring."
            },
            "MysticSenses": {
                "Label": "Mystic Senses",
                "Description": "Whenever you make any check related to the origin of magical items, lore, or spells, you are treated as if you have Expertise in the Arcana skill."
            },
            "NaturalArmor": {
                "Label": "Natural Armor",
                "Description": "Your skin is as hardened leather in toughness. When you aren't wearing armor, your AC is 12 + your Agility modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
            },
            "NaturalHandler": {
                "Label": "Natural Handler",
                "Description": "You have proficiency with Animal Handling. If handling beasts that naturally live in mountains such as gryphons or mountain lions, you gain Expertise instead."
            },
            "NatureResistance": {
                "Label": "Nature Resistance",
                "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> on saving throws against poisons, and have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">resistance</a> against lightning and poison damage."
            },
            "NightfallenMagic": {
                "Label": "Nightfallen Magic",
                "Description": "You know the mage hand cantrip and can cast it normally (caster level equal to your character level). When you reach 3rd level, you can also cast detect magic as a 1st level spell. When you reach 5th level, you can also cast the arcane explosion spell as a 2nd level spell. Intelligence is your spellcasting ability for these spells, and you use your mana pool for these abilities (even if you are not normally a spellcaster). While you use such abilities (and after using them for one hour), your eyes glow a light blue. If you can already cast such spells (and have a sufficiently high caster level), they are always prepared for free."
            },
            "Resilience": {
                "Label": "Resilience",
                "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> against poisons and <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">resistance</a> to poison damage."
            },
            "Shadowmeld": {
                "Label": "Shadowmeld",
                "Description": "When you are in dim or dark light, you gain <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> on Agility (Stealth) checks."
            },
            "Stalker": {
                "Label": "Stalker",
                "Description": "You have proficiency with the Perception and Stealth skills. If you already have proficiency with one of these skills, you gain Expertise instead."
            },
            "Stonecunning": {
                "Label": "Stonecunning",
                "Description": "Whenever you make an Intelligence (History) check or Mining checks related to stonework and minerals, you are considered both proficient and as if having Expertise in either History or Mining (choose one)."
            },
            "Stoneform": {
                "Label": "Stoneform",
                "Description": "You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Stamina modifier to the number rolled, and reduce the damage by that total. If the damage exceeds any ongoing bleed damage you take, you end the effect as well. After you use this trait, you can't use it again until you finish a short or long rest."
            },
            "ToolProficiency": {
                "Label": "Tool Proficiency",
                "Description": "You gain proficiency with one artisan's tool of your choice: smith's tools, brewer's supplies, mason's tools, or mining tools."
            }
        },

        "SkillSheet": {
            "Category": "Category"
        },

        "Skills": {
            "SuffusedArrows": {
                "Label": "Suffused Arrows",
                "Description": "You master the art of spell-casting through arrows or infusing them. Choose:",
                "Options": {
                    "1": "You may choose to gain proficiency in the Infusion Kit, but can only infuse ranged weapons or arrows. If you choose to gain proficiency with the kit, you start with three infusion matrices of your choice that you can craft, and may store them in infusion manuals or similar books. Despite the talent‘s name, this can also cover other types of ranged weapons and ammunition, such as crossbow bolts and bullets, as well as larger samples (such as ballistae bolts or cannonballs).",
                    "2": "You gain the Spell Strike feat (but only for ranged weapons)"
                }
            }
        },

        "SkillCategories": {
            "General": "General",
            "Strike": "Strike"
        },

        "SpellSheet": {
            "School": "School",
            "CastTime": "Casting Time",
            "Range": "Range",
            "Components": "Components",
            "Duration": "Duration",
            "Classes": "Classes",
            "Heightened": "Heightened"
        },

        "Spells": {
            "AbandonmentAura": {
                "Label": "Abandonment Aura",
                "Description": "Destructive energy radiates from you in an aura with a 15-foot radius. Until the spell ends, the aura moves with you, centered on you. Each creature hostile to you that is in the aura takes 1 extra point of damage from all weapon attacks. A creature can negate this effect if they succeed on a Spirit saving throw once within the aura‘s area.<br> This spell is suppressed by the protection from good and evil (and similar abjurations). This is an aura bonus.",
                "Heightened": "For each spell level above 1st, the extra damage increases by 1 point (up to 5 extra points of damage at spell level 5).<br> Note. This spell suppresses and is suppressed by the devotion aura spell."
            },
            "DetectMagic": {
                "Label": "Detect Magic",
                "Description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
            },
            "MageHand": {
                "Label": "Mage Hand",
                "Description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the Duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again. You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it. The hand can't Attack, activate magical items, or carry more than 10 pounds."
            },
            "ManaBurn": {
                "Label": "Mana Burn",
                "Description": "You target a creature that has mana within 30 feet. A ray of black-purple anti-magic leaps out, and strikes the target, draining them of mana. You must make a ranged spell attack with the ray. On a success, the target loses 1d4 + 1 mana points. For every mana point lost, the target takes two points of arcane damage. The target is entitled a Spirit saving throw. On a success, the mana and hit points lost are halved.",
                "Heightened": "The number of mana points drained increases by 1d4 points per every two levels above 2 (2d4 at level 4, 3d4 at level 6, 4d4 at level 8). Special: Demons always have active mana, and can always be targeted with mana burn. If they have no mana, they still take 2 points of arcane damage."
            },
            "Mute": {
                "Label": "Mute",
                "Description": "Concentration, up to 1 minute You target a creature within range, forcing it to make a Spirit saving throw. If it fails, the target is isolated from all sound, causing it to be silenced and deafened. This prevents it from performing the verbal components of spells, and rendering it immune to Thunder damage and effects of a spell equal to the spell's level or lower.",
                "Heightened": "You may target another creature within 30 feet of the original target for every 2 spell levels above 2nd (2 creatures at level 4, 3 at level 6, and 4 at level 8)."
            },
            "ProduceFlame": {
                "Label": "Produce Flame",
                "Description": "A flickering flame appears in your hand. The flame remains there for the Duration and harms neither you nor your Equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again. You can also Attack with the flame, although doing so ends the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell Attack. On a hit, the target takes 1d8 fire damage. This spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
            },
            "Prestidigitation": {
                "Label": "Prestidigitation",
                "Description": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical Effects within range. If you cast this spell multiple times, you can have up to three of its non-instantaneous Effects active at a time, and you can dismiss such an Effect as an action.",
                "Options": {
                    "1": "You create an Instantaneous, harmless sensory Effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.",
                    "2": "You instantaneously light or snuff out a Candle, a torch, or a small campfire.",
                    "3": "You instantaneously clean or soil an object no larger than 1 cubic foot.",
                    "4": "You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.",
                    "5": "You make a color, a small mark, or a Symbol appear on an object or a surface for 1 hour.",
                    "6": "You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn."
                }
            },
            "Silence": {
                "Label": "Silence",
                "Description": "For the Duration, no sound can be created within or pass through a 20-foot-radius Sphere centered on a point you choose within range. Any creature or object entirely inside the Sphere is immune to thunder damage, and creatures are Deafened while entirely inside it. Casting a Spell that includes a verbal component is impossible there. "
            },
            "Thaumaturgy": {
                "Label": "Thaumaturgy",
                "Description": "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical Effects within range. If you cast this spell multiple times, you can have up to three of its 1-minute Effects active at a time, and you can dismiss such an Effect as an action.",
                "Options": {
                    "1": "Your voice booms up to three times as loud as normal for 1 minute.",
                    "2": "You cause flames to flicker, brighten, dim, or change color for 1 minute.",
                    "3": "You cause harmless tremors in the ground for 1 minute.",
                    "4": "You create an Instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.",
                    "5": "You instantaneously cause an unlocked door or window to fly open or slam shut.",
                    "6": "You alter the Appearance of your eyes for 1 minute."
                }
            }
        },

        "SpellRules": {
            "SpellSchools": {
                "Abjuration": "Abjuration",
                "Conjuration": "Conjuration",
                "Divination": "Divination",
                "Enchantment": "Enchantment",
                "Evocation": "Evocation",
                "Illusion": "Illusion",
                "Necromancy": "Necromancy",
                "Transmutation": "Transmutation"
            },
            "Range": {
                "Self": "self"
            },
            "Components": {
                "Somatic": "Somatic",
                "Verbal": "Verbal"
            },
            "SpellCategories": {
                "Strike": "Strike spells modify a successful attack. See Chapter 9 for more details on strike effects. Strike and shot effects also usually a potential number of attacks equal to double the spell level. For instance, using kill shot as a 2nd level spell enhances 4 ranged attacks. The caster can have multiple potential strikes active, but cannot apply two shot or strike abilities to the same attack unless otherwise specified."
            }
        },

        "UI": {
            "Actions": {
                "NoToken": "You have not selected a valid token. Please select a valid token.",
                "CastSpell": "You cast the Spell",
                "CastSpellError": "You're not able to cast the spell",
                "CastSpellInvalidTarget": "Invalid Target. Please select one hostile token.",
                "OutOfRange": "The target is out of range. Distance:"
            },
            "Units": {
                "Action": "action",
                "Ft": "ft",
                "Hour": "hour",
                "Instant": "instant",
                "Minute": "minute",
                "Minutes": "minutes",
                "Gp": "gp"
            },
            "Phrases": {
                "Skill": "skill",
                "Spell": "spell"
            },
            "Dialogs": {
                "CancelSkill": "Release",
                "CancelSkillDescription": "Do you really want to release the skill?"
            }
        }
    }
}