{
    "WC5E" : {

        "Languages" : {
            "Common" : "Common",
            "Eredun" : "Eredun"
        },

        "RaceSheet" : {
            "AbilityScoreIncrease" : "Ability Score Increase",
            "Age" : "Age",
            "Traits" : "Traits",
            "Affiliation" : "Affiliation",
            "Size" : "Size",
            "Appearance" : "Appearance",
            "Speed" : "Speed",
            "SpeedVal" : "Your base walking speed is ",
            "Languages" : "Languages",
            "Subrace" : "Subrace",
            "SubRaceChoice" : "Choose one of these subraces.",
            "MaleNames" : "Male Names",
            "FemaleNames" : "Female Names",
            "FamilyNames" : "Family Names"
        },

        "Race" : {
            "DarkIron" : {
                "Name" : "Dwarf - Dark Iron"
            },
            "Draenei" : {
                "Description" : "The draenei are a powerfully-build alien race that originates from Argus. They are powerfully magically-attuned, and have the potential for exceptional good or evil. Draenei who succumb to fel magic form the ranks of the Eredar, the greatest generals of the Burning Legion, while draenei who serve the Holy Light are immortal crusaders for justice across the cosmos.",
                "AbilityScoreIncrease" : "Your Spirit or Intelligence increases by 1.",
                "Age" : "A typical draenei claims adulthood around 100 years old, and can live to about ten thousand years old.",
                "Affiliation" : "Each sub-race is inclined to its own affiliations.",
                "Size" : "Their size is Medium. Males range anywhere from seven feet tall to eight feet tall and weigh on average around 300 or 400 pounds. Females stand at six to seven feet tall and only weigh around 170 or 250 pounds when fully grown.",
                "Appearance" : "As befitting their Eredar heritage, Draenei have hooved feet, tendrils that grow from the neck and short tails, and their skin color is affected by the magic they naturally absorb (with fel magic reddening them, holy magic rendering their skins blue to violet, and void magic darkening them to brown). Males‘ skulls are rigid (giving the appearance of a bone plate under their skin), while females grow foot-long, graceful curved horns. Broken draenei look distinctly different from normal Draenei, having flat, noseless faces and having thick, three-fingered hands, and lose their bone-like plates.",
                "Language" : "The Eredun Draenei speak is an altered dialect that is less corrupt, and thus does not impose penalties when speaking, but is perfectly understandable by fiends.",
                "FamilyNames" : "Draenei do not have family names, but take a title according to their deeds.",
                "Subrace" : "Ancient events divide the draenei into two sub-races: unbroken and broken.",
                "Subraces" : {
                    "Broken" : {
                        "Name" : "Broken (Krokul)",
                        "Quote" : "You will learn our ways...",
                        "Description" : "The Broken, also known as Krokul in Draenei, are a mutated and devolved subrace of draenei who lived in Outland. They, like most of the orcs, fell prey to the demons' sinister influence and were changed by the corruption. Though they lost some of their former powers, the Broken still present a clear danger to all races through Outland. The largest known faction of Broken in Outland, the Ashtongue Deathsworn, is currently led by Akama. They are supposedly allied with Illidan Stormrage.",
                        "AbilityScoreIncrease" : "Your Agility increases by 2.",
                        "Affiliation" : "Independent. Despite the (mostly) accidental regression into broken, many unbroken draenei not only distrust them but despise them. Although understandable of those broken who remain corrupted or in service to the Legion, one would think that the unbroken would be willing to welcome any of their people that survived the orcs' genocide. Most broken are independent as a result, although the Prophet Velen, the leader of the unbroken, does extend a hand to broken to help them find their way back."
                    },
                    "Unbroken" : {
                        "Name" : "Unbroken (True Draenei)",
                        "Quote" : "The Legion's end draws near.",
                        "Description" : "As one of the enlightened cousins of the Eredar, the Draenei arrived in Azeroth after the reopening of the Dark Portal. Living out the last centuries in exile and escape from the Burning Legion, the Draenei are steadfast champions of the Light, and will do anything in their power to prevent another world from falling to the Flame.",
                        "AbilityScoreIncrease" : "Your Strength increases by 2.",
                        "Affiliation" : "Alliance. Unbroken draenei have found that they have strong bonds with humanity and dwarvenkind due to their shared worship of the Light, and kinship with the now-mortal night elves."
                    }
                }
            }
        },

        "Traits" : {
            "Adapter" : {
                "Label" : "Adapter",
                "Description" : "You may always act when surprised at a combat encounter (even if you failed your Perception check to notice it). You also have advantage versus weather effects."
            },
            "Darkvision" : {
                "Label" : "Darkvision",
                "Description" : "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can‘t discern color in darkness, only shades of gray."
            },
            "DraeneiCombatTraining" : {
                "Label" : "Draenei Combat Training",
                "Description" : "You have proficiency with the longsword, greathammer, glaive, and the heavy crossbow."
            },
            "FelResistance" : {
                "Label" : "Fel Resistance",
                "Description" : "You have resistance to fel damage."
            },
            "Gemcutting" : {
                "Label" : "Gemcutting",
                "Description" : "You are proficient with artisan‘s tools (jewelcrafting kit)."
            },
            "GiftOfTheNaaru" : {
                "Label" : "Gift of the Naaru",
                "Description" : "You can use your action to channel holy energy, casting the renewing light spell as if cast as a 1st level spell. This can be used once, replenishing on a short or long rest. While a creature benefits from this ability, they have a glowing blue mark above their forehead (shedding light equal to dancing lights). Your spellcasting ability modifier is Spirit or Charisma (your choice)."
            },
            "HeroicPresence" : {
                "Label" : "Heroic Presence",
                "Description" : "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + half your Charisma or Spirit modifier. A creature can‘t gain temporary hit points from this feature again until it has finished a long rest. Alternatively, you may declare use of this ability upon landing a critical hit."
            },
            "Stalker" : {
                "Label" : "Stalker",
                "Description" : "You have proficiency with the Perception and Stealth skills. If you already have proficiency with one of these skills, you gain Expertise instead."
            }
        }
    }
}
