{
    "WC5E" : {

        "Languages" : {
            "Common" : "Common",
            "Dwarven" : "Dwarven",
            "Elven" : "Elven",
            "Eredun" : "Eredun"
        },

        "CharacterSheet" : {
            "HitPoints" : "Hit Points"
        },

        "Class" : {
            "Alchemist" : {
                "Name" : "Alchemist"
            },
            "DeathKnight" : {
                "Name" : "Death Knight"
            },
            "Druid" : {
                "Name" : "Druid"
            },
            "Hunter" : {
                "Name" : "Hunter"
            },
            "Mage" : {
                "Name" : "Mage"
            },
            "Paladin" : {
                "Name" : "Paladin"
            },
            "Priest" : {
                "Name" : "Priest"
            },
            "Shaman" : {
                "Name" : "Shaman"
            },
            "Warlock" : {
                "Name" : "Warlock"
            }
        },

        "RaceSheet" : {
            "AbilityScoreIncrease" : "Ability Score Increase",
            "Age" : "Age",
            "Traits" : "Traits",
            "Affiliation" : "Affiliation",
            "Size" : "Size",
            "Appearance" : "Appearance",
            "Speed" : "Speed",
            "SpeedVal" : "Your base walking speed is ",
            "Languages" : "Languages",
            "Subrace" : "Subrace",
            "SubraceChoice" : "Choose one of these subraces.",
            "MaleNames" : "Male Names",
            "FemaleNames" : "Female Names",
            "FamilyNames" : "Family Names"
        },

        "Race" : {
            "Draenei" : {
                "Description" : "The draenei are a powerfully-build alien race that originates from Argus. They are powerfully magically-attuned, and have the potential for exceptional good or evil. Draenei who succumb to fel magic form the ranks of the Eredar, the greatest generals of the Burning Legion, while draenei who serve the Holy Light are immortal crusaders for justice across the cosmos.",
                "AbilityScoreIncrease" : "Your Spirit or Intelligence increases by 1.",
                "Age" : "A typical draenei claims adulthood around 100 years old, and can live to about ten thousand years old.",
                "Affiliation" : "Each sub-race is inclined to its own affiliations.",
                "Size" : "Their size is Medium. Males range anywhere from seven feet tall to eight feet tall and weigh on average around 300 or 400 pounds. Females stand at six to seven feet tall and only weigh around 170 or 250 pounds when fully grown.",
                "Appearance" : "As befitting their Eredar heritage, Draenei have hooved feet, tendrils that grow from the neck and short tails, and their skin color is affected by the magic they naturally absorb (with fel magic reddening them, holy magic rendering their skins blue to violet, and void magic darkening them to brown). Males' skulls are rigid (giving the appearance of a bone plate under their skin), while females grow foot-long, graceful curved horns. Broken draenei look distinctly different from normal Draenei, having flat, noseless faces and having thick, three-fingered hands, and lose their bone-like plates.",
                "Language" : "The Eredun Draenei speak is an altered dialect that is less corrupt, and thus does not impose penalties when speaking, but is perfectly understandable by fiends.",
                "FamilyNames" : "Draenei do not have family names, but take a title according to their deeds.",
                "Subrace" : "Ancient events divide the draenei into two sub-races: unbroken and broken.",
                "Subraces" : {
                    "Broken" : {
                        "Name" : "Broken (Krokul)",
                        "Quote" : "You will learn our ways...",
                        "Description" : "The Broken, also known as Krokul in Draenei, are a mutated and devolved subrace of draenei who lived in Outland. They, like most of the orcs, fell prey to the demons' sinister influence and were changed by the corruption. Though they lost some of their former powers, the Broken still present a clear danger to all races through Outland. The largest known faction of Broken in Outland, the Ashtongue Deathsworn, is currently led by Akama. They are supposedly allied with Illidan Stormrage.",
                        "AbilityScoreIncrease" : "Your Agility increases by 2.",
                        "Affiliation" : "Independent. Despite the (mostly) accidental regression into broken, many unbroken draenei not only distrust them but despise them. Although understandable of those broken who remain corrupted or in service to the Legion, one would think that the unbroken would be willing to welcome any of their people that survived the orcs' genocide. Most broken are independent as a result, although the Prophet Velen, the leader of the unbroken, does extend a hand to broken to help them find their way back."
                    },
                    "Unbroken" : {
                        "Name" : "Unbroken (True Draenei)",
                        "Quote" : "The Legion's end draws near.",
                        "Description" : "As one of the enlightened cousins of the Eredar, the Draenei arrived in Azeroth after the reopening of the Dark Portal. Living out the last centuries in exile and escape from the Burning Legion, the Draenei are steadfast champions of the Light, and will do anything in their power to prevent another world from falling to the Flame.",
                        "AbilityScoreIncrease" : "Your Strength increases by 2.",
                        "Affiliation" : "Alliance. Unbroken draenei have found that they have strong bonds with humanity and dwarvenkind due to their shared worship of the Light, and kinship with the now-mortal night elves."
                    }
                }
            },
            "Dwarf" : {
                "Name" : "Dwarf",
                "Description" : "Dwarves are short and stout creatures mostly inhabiting Khaz Modan in the Eastern Kingdoms. They are shorter than humans but taller than gnomes, taking advantage of their size when possible and relying on their robustness and strength when not. The average dwarf is steady, observant and composed.",
                "AbilityScoreIncrease" : "Your Stamina score increases by 2.",
                "Age" : "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 40. On average, they live to be 450 years old.",
                "Affiliation" : "Each sub-race is inclined to its own affiliations ever since the great War of the Three Hammers.",
                "Size" : "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
                "Appearance" : "Male dwarves tend to have long hair, and beards or facial hair often tied in ornate braids. Female dwarves also have sturdy muscular frames, but they are buxom and lack facial hair, despite the claims of some of the less educated sages of other races.",
                "SpeedAddition" : "Your speed is not reduced by wearing heavy armor.",
                "Language" : "Dwarven is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak.",
                "Subrace" : "Three main subraces of dwarves populate the worlds of Azeroth: Hill dwarves (Wildhammer Clan), Mountain dwarves (Bronzebeard Clan), and Dark dwarves (Dark Iron Clan).",
                "Subraces" : {
                    "Bronzebeard" : {
                        "Name" : "Mountain Dwarf (Bronzebeard)",
                        "Quote" : "For Khaz Modan!",
                        "Description" : "As a mountain dwarf, you probably hail from the Bronzebeard clan and its allies, and live in Khaz Modan. Ironforge dwarves are stout and powerful, with short muscular bodies, and prefer tying their hair (male or female) in ornate braids.",
                        "AbilityScoreIncrease" : "Your Strength score increases by 1.",
                        "Affiliation" : "Alliance. While the dwarves of Ironforge appreciate the fighting skill of the Horde, it is with grim eyes that they look upon the orcs and their allies, the trolls and the Forsaken. Although the dwarves have held dealings of commerce and diplomacy with the high elves, they keep the people of Quel‘Thalas at an arm‘s distance. While the night elves may share the same allegiances, the dwarves look upon them with suspicion and some trepidation. Humans, however, are the staunch and constant allies of the dwarven people and find welcome, favor and kindness when in dwarven lands.",
                        "FamilyNames" : "Thunderforge, Bronzebeard, Hammergrim, Thornsteel, Chunderstout"
                    },
                    "DarkIron" : {
                        "Name" : "Darklands Dwarf (Dark Iron)",
                        "Quote" : "You shall serve.",
                        "Description" : "As a darklands dwarf, you probably hail from the Dark Iron clans, lead by the Sorcerer-thane Thaurissan. Reviled as betrayers of their fellow dwarves, and living in the mountain-halls of Blackrock Mountain, Dark Iron dwarves are slaves to the great elemental Firelord Ragnaros, and serve him in the latent volcanic mountain. Dark Irons seem identical to Ironforge dwarves, except that their skin tones are ashen and gray, and their eyes are golden-red. Dark Irons who adventure can often reach into the power in their bloodline and spontaneously conjure flames. Hoarse of voice and prone to undertone muttering, Dark Irons do not inspire trust easily.",
                        "AbilityScoreIncrease" : "Your Intelligence score increases by 1.",
                        "Affiliation" : "Alliance or Independent. Hatred comes to Dark Iron dwarves against all races, and in their service to Ragnaros, they see only rivals, thralls, and enemies. Some dark irons have found kinship with their cousins the Wildhammers and the Bronzebeards, and chose to join the Alliance.",
                        "FamilyNames" : "Angerforge, Darkbargainer, Firesmite, Forgewright"
                    },
                    "Wildhammer" : {
                        "Name" : "Hill Dwarf (Wildhammer)",
                        "Quote" : "To the skies!",
                        "Description" : "As a hill dwarf, you probably hail from the Wildhammer clan and its allies, and live in the Aerie Peak. Wildhammer dwarves are similar in appearance to their Ironforge kin, though many shave their heads and they are slightly taller and leaner. Exposure to sun and high winds darkens and toughens their skin. Wildhammers string beads and feathers into their hair and beards as good luck charms, and paint tattoos on their bodies in homage to the totems, ideas and creatures they revere.",
                        "AbilityScoreIncrease" : "Your Spirit score increases by 1.",
                        "Affiliation" : "Alliance or independent. The Wildhammer clan is not a member of the Alliance, but Wildhammer dwarves are allies of the Alliance and would certainly help it in a war (and have done so in the past). They are distant with humans and Ironforge dwarves, but have formed a kinship with high elves. Wildhammers and high elves shared much in common in the past, including a love of nature and hatred of evil. Many high elves have grown introverted and brooding of late, which concerns the Wildhammers. The dwarves are appalled at the defection of the blood elves, an event which has caused them to see their high elf allies with new eyes. They also get along well with night elves, as the two races share much in common.",
                        "FamilyNames" : "Beastclaw, Greatbeard, Thundertamer, Windseer"
                    }
                }
            },
            "Elf" : {
                "Description" : "An elf is a member of one of the longest lived species on Azeroth known for keen perception, grace, and great spellwork. Elves were once believed to be the first race to awaken on Azeroth.",
                "AbilityScoreIncrease" : "Your Agility score increases by 2.",
                "Age" : "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. A high elf typically claims adulthood around the age of 60 and can live to be 750 years old. A night elf claims adulthood and live up to five times said age (adulthood at 300 and live up to 3,750 years old). Until the World Tree was destroyed, the Night Elves were immune to aging effects.",
                "Affiliation" : "Each sub-race is inclined to its own affiliations ever since the Great War of the Ancients.",
                "Size" : "A high elf (and hence a blood and void elf) is usually a little over 6 feet in height and weighs between 100 to 175 pounds, depending on gender. Night elves (and hence Nightborne) are imposing in stature, males being on average 7 feet tall.",
                "Appearance" : "Male Kaldorei are very muscular, with broad chests and shoulders, indicative of the strength that lies within both their minds and bodies. Female night elves are lithe and curvaceous, yet still muscular and strong.",
                "SpeedAddition" : "Your speed is not reduced by wearing heavy armor.",
                "Language" : "Elven is fluid, with subtle intonations and intricate grammar, even with strange dialects such as Nazja. Elven literature is rich and varied, and their songs and poems are famous among other races.",
                "Subrace" : "Ancient divides and use of mana siphoning (or mana vampirism) among the elven people resulted in several main sub-races: high elves (and the blood and void elves), and night elves (and the Nightborne).",
                "Subraces" : {
                    "HighElf" : {
                        "Name" : "High Elf (Quel’dorei)",
                        "Quote" : "For Quel‟Thalas!",
                        "Description" : "As a high elf, you hail from Silvermoon in Quel‘Thalas or Dalaran. High elves stand slightly taller than humans do. The elves are slim, with sharp symmetrical features, often an exaggeration of perfect beauty. The high elves are uniformly fair in complexion, with white to flaxen colored hair. Their eyes are incredibly intense in color, seeming to glow with an inner light. While many high elves have blue or green eyes, violet and red are not unheard of.",
                        "AbilityScoreIncrease" : "Your Intelligence score increases by 1.",
                        "Affiliation" : "Alliance or independent. Most of the high elves have placed themselves under a self-imposed exile, ashamed of the damage that they have wrought upon the world of Lordaeron with their abuse of arcane magic. While humans still accept the high elves because of the aid that both races provided each other during the most recent attacks of the Burning Legion, many of the other races will only deal with the high elves if absolutely necessary. This is especially true after the acts of Kael‘thas Sunstrider. The night elves in particular do not care for the company of high elves and in some cases can be openly hostile toward their sun-blessed brethren. The passing of time may heal these wounds, but the use of arcane magic will always draw a rift between these two breeds of elf.",
                        "FamilyNames" : "Boughstrider, Dawnblade, Lightbringer, Morningray, Suntreader"
                    },
                    "BloodElf" : {
                        "Name" : "Blood Elf (Sin’dorei)",
                        "Quote" : "Power! My people are addicted to it... a dependence made manifest after the Sunwell was destroyed. - Kael'Thas Sunstrider",
                        "Description" : "Following the Third War, 90% of the High Elven population was slain during the Siege of Silvermoon and the Razing of Quel‘Thalas. Prince Kael‘Thas Sunstrider renamed his people the Blood Elves (Sin‘dorei) following this terrible event. With their homeland destroyed, their forests burned and corrupted, and their beloved sacred Sunwell sullied, the Blood Elves underwent mana withdrawal. Blood Elves are identical to High Elves in racial bonuses and names. However, their culture is more warped due to their insatiable thirst for vengeance: most have abandoned worship of the Light, and their allegiances have also changed, and most suffer psychologically from extensive use of mana siphoning, due to the Sunwell‘s corruption and subsequent destruction. A DM should consider applying the mana withdrawal optional rule with Blood Elves.",
                        "Affiliation" : "Horde or independent. Most of the blood elves have joined the New Horde, invited to do so by the Banshee Queen Sylvanas Windrunner."
                    }
                }
            }
        },

        "Traits" : {
            "Adapter" : {
                "Label" : "Adapter",
                "Description" : "You may always act when surprised at a combat encounter (even if you failed your Perception check to notice it). You also have advantage versus weather effects."
            },
            "ArcaneLegacy" : {
                "Label" : "Arcane Legacy",
                "Description" : "The high elves are uniquely attuned to magic. You can choose one of the below abilities.",
                "Options" : {
                    "1" : "You increase your mana pool size by 2 mana points.",
                    "2" : "You add an additional cantrip to your High Magic ability, chosen from the mage spell list.",
                    "3" : "You gain the Suffused Arrows talent. You may only take this if your first level is a hunter."
                }
            },
            "BloodMagic" : {
                "Label" : "Blood Magic",
                "Description" : "This acts as High Magic. While you use abilities granted by this ability, your eyes glow a pale fel green instead of High Elves‘ blue. Instead of the prestidigitation cantrip, you may choose the thaumaturgy cantrip instead, and may cast the mana burn spell instead of mute."
            },
            "Bravery" : {
                "Label" : "Bravery",
                "Description" : "You have advantage to all saves against fear."
            },
            "BronzebeardCombatTraining" : {
                "Label" : "Dwarven Combat Training",
                "Description" : "You have proficiency with firearms and explosives of all types, even if you do not have proficiency in engineering, and gain proficiency with light armor."
            },
            "BurningHeart" : {
                "Label" : "Burning Heart",
                "Description" : "You know the produce flame cantrip (caster level equal to your character level). Intelligence is your spellcasting ability for it."
            },
            "Darkvision" : {
                "Label" : "Darkvision",
                "Description" : "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
            },
            "DraeneiCombatTraining" : {
                "Label" : "Draenei Combat Training",
                "Description" : "You have proficiency with the longsword, greathammer, glaive, and the heavy crossbow."
            },
            "DwarvenCombatTraining" : {
                "Label" : "Dwarven Combat Training",
                "Description" : "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
            },
            "ElvenCombatTraining" : {
                "Label" : "Elven Combat Training",
                "Description" : "You have proficiency with the longsword, longbow, rapier, and shortbow."
            },
            "ExtraLanguage" : {
                "Label" : "Extra Language",
                "Description" : "You can speak, read and write one extra language of your choice."
            },
            "FelResistance" : {
                "Label" : "Fel Resistance",
                "Description" : "You have resistance to fel damage."
            },
            "FireLordsFavor" : {
                "Label" : "Fire Lord's Favor",
                "Description" : "You have resistance to fire damage."
            },
            "Gemcutting" : {
                "Label" : "Gemcutting",
                "Description" : "You are proficient with artisan's tools (jewelcrafting kit)."
            },
            "GiftOfTheNaaru" : {
                "Label" : "Gift of the Naaru",
                "Description" : "You can use your action to channel holy energy, casting the renewing light spell as if cast as a 1st level spell. This can be used once, replenishing on a short or long rest. While a creature benefits from this ability, they have a glowing blue mark above their forehead (shedding light equal to dancing lights). Your spellcasting ability modifier is Spirit or Charisma (your choice)."
            },
            "HeroicPresence" : {
                "Label" : "Heroic Presence",
                "Description" : "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + half your Charisma or Spirit modifier. A creature can't gain temporary hit points from this feature again until it has finished a long rest. Alternatively, you may declare use of this ability upon landing a critical hit."
            },
            "HighMagic" : {
                "Label" : "High Magic",
                "Description" : "Magic. You know the prestidigitation cantrip and can cast it normally (caster level equal to your character level). When you reach 3rd level, you can also cast detect magic as a 1st level spell. When you reach 5th level, you can also cast the mute spell as a 2nd level spell. Intelligence is your spellcasting ability for these spells, and you use your mana pool for these abilities (even if you are not normally a spellcaster). While you use such abilities (and after using them for one hour), your eyes glow a pale blue. If you can already cast such spells (and have a sufficiently high caster level), they are always prepared for free."
            },
            "KeenSenses" : {
                "Label" : "Keen Senses",
                "Description" : "You are proficient with the Perception skill."
            },
            "MountainBorn" : {
                "Label" : "Mountain Born",
                "Description" : "You're acclimated to high altitude, including elevations above 20,000 feet. You're also naturally adapted to cold weather in the wilderness or while exploring."
            },
            "MysticSenses" : {
                "Label" : "Mystic Senses",
                "Description" : "Whenever you make any check related to the origin of magical items, lore, or spells, you are treated as if you have Expertise in the Arcana skill."
            },
            "NaturalArmor" : {
                "Label" : "Natural Armor",
                "Description" : "Your skin is as hardened leather in toughness. When you aren't wearing armor, your AC is 12 + your Agility modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
            },
            "NaturalHandler" : {
                "Label" : "Natural Handler",
                "Description" : "You have proficiency with Animal Handling. If handling beasts that naturally live in mountains such as gryphons or mountain lions, you gain Expertise instead."
            },
            "Resilience" : {
                "Label" : "Resilience",
                "Description" : "You have advantage against poisons and resistance to poison damage."
            },
            "Stalker" : {
                "Label" : "Stalker",
                "Description" : "You have proficiency with the Perception and Stealth skills. If you already have proficiency with one of these skills, you gain Expertise instead."
            },
            "Stonecunning" : {
                "Label" : "Stonecunning",
                "Description" : "Whenever you make an Intelligence (History) check or Mining checks related to stonework and minerals, you are considered both proficient and as if having Expertise in either History or Mining (choose one)."
            },
            "Stoneform" : {
                "Label" : "Stoneform",
                "Description" : "You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Stamina modifier to the number rolled, and reduce the damage by that total. If the damage exceeds any ongoing bleed damage you take, you end the effect as well. After you use this trait, you can't use it again until you finish a short or long rest."
            },
            "ToolProficiency" : {
                "Label" : "Tool Proficiency",
                "Description" : "You gain proficiency with one artisan's tool of your choice: smith's tools, brewer's supplies, mason's tools, or mining tools."
            }
        },

        "SkillSheet" : {
            "Category" : "Category"
        },

        "Skills" : {
            "SuffusedArrows" : {
                "Label" : "Suffused Arrows",
                "Description" : "You master the art of spell-casting through arrows or infusing them. Choose:",
                "Options" : {
                    "1" : "You may choose to gain proficiency in the Infusion Kit, but can only infuse ranged weapons or arrows. If you choose to gain proficiency with the kit, you start with three infusion matrices of your choice that you can craft, and may store them in infusion manuals or similar books. Despite the talent‘s name, this can also cover other types of ranged weapons and ammunition, such as crossbow bolts and bullets, as well as larger samples (such as ballistae bolts or cannonballs).",
                    "2" : "You gain the Spell Strike feat (but only for ranged weapons)"
                }
            }
        },

        "SkillCategories" : {
            "General" : "General"
        },

        "SpellSheet" : {
            "School" : "School",
            "CastTime" : "Casting Time",
            "Range" : "Range",
            "Components" : "Components",
            "Duration" : "Duration",
            "Classes" : "Classes"
        },

        "Spells" : {
            "DetectMagic" : {
                "Label" : "Detect Magic",
                "Description" : "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
            },
            "ManaBurn" : {
                "Label" : "Mana Burn",
                "Description" : "You target a creature that has mana within 30 feet. A ray of black-purple anti-magic leaps out, and strikes the target, draining them of mana. You must make a ranged spell attack with the ray. On a success, the target loses 1d4 + 1 mana points. For every mana point lost, the target takes two points of arcane damage. The target is entitled a Spirit saving throw. On a success, the mana and hit points lost are halved.",
                "Heightened" : "The number of mana points drained increases by 1d4 points per every two levels above 2 (2d4 at level 4, 3d4 at level 6, 4d4 at level 8). Special: Demons always have active mana, and can always be targeted with mana burn. If they have no mana, they still take 2 points of arcane damage."
            },
            "Mute" : {
                "Label" : "Mute",
                "Description" : "Concentration, up to 1 minute You target a creature within range, forcing it to make a Spirit saving throw. If it fails, the target is isolated from all sound, causing it to be silenced and deafened. This prevents it from performing the verbal components of spells, and rendering it immune to Thunder damage and effects of a spell equal to the spell's level or lower.",
                "Heightened" : "You may target another creature within 30 feet of the original target for every 2 spell levels above 2nd (2 creatures at level 4, 3 at level 6, and 4 at level 8)."
            },
            "ProduceFlame" : {
                "Label" : "Produce Flame",
                "Description" : "A flickering flame appears in your hand. The flame remains there for the Duration and harms neither you nor your Equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again. You can also Attack with the flame, although doing so ends the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell Attack. On a hit, the target takes 1d8 fire damage. This spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
            },
            "Prestidigitation" : {
                "Label" : "Prestidigitation",
                "Description" : "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical Effects within range. If you cast this spell multiple times, you can have up to three of its non-instantaneous Effects active at a time, and you can dismiss such an Effect as an action.",
                "Options" : {
                    "1" : "You create an Instantaneous, harmless sensory Effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.",
                    "2" : "You instantaneously light or snuff out a Candle, a torch, or a small campfire.",
                    "3" : "You instantaneously clean or soil an object no larger than 1 cubic foot.",
                    "4" : "You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.",
                    "5" : "You make a color, a small mark, or a Symbol appear on an object or a surface for 1 hour.",
                    "6" : "You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn."
                }
            },
            "Silence" : {
                "Label" : "Silence",
                "Description" : "For the Duration, no sound can be created within or pass through a 20-foot-radius Sphere centered on a point you choose within range. Any creature or object entirely inside the Sphere is immune to thunder damage, and creatures are Deafened while entirely inside it. Casting a Spell that includes a verbal component is impossible there. "
            },
            "Thaumaturgy" : {
                "Label" : "Thaumaturgy",
                "Description" : "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical Effects within range. If you cast this spell multiple times, you can have up to three of its 1-minute Effects active at a time, and you can dismiss such an Effect as an action.",
                "Options" : {
                    "1" : "Your voice booms up to three times as loud as normal for 1 minute.",
                    "2" : "You cause flames to flicker, brighten, dim, or change color for 1 minute.",
                    "3" : "You cause harmless tremors in the ground for 1 minute.",
                    "4" : "You create an Instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.",
                    "5" : "You instantaneously cause an unlocked door or window to fly open or slam shut.",
                    "6" : "You alter the Appearance of your eyes for 1 minute."
                }
            }
        },

        "SpellRules" : {
            "SpellSchools" : {
                "Abjuration" : "Abjuration",
                "Conjuration" : "Conjuration",
                "Divination" : "Divination",
                "Enchantment" : "Enchantment",
                "Evocation" : "Evocation",
                "Illusion" : "Illusion",
                "Necromancy" : "Necromancy",
                "Transmutation" : "Transmutation"
            },
            "Range" : {
                "Self" : "self"
            },
            "Components" : {
                "Somatic" : "Somatic",
                "Verbal" : "Verbal"
            }
        },

        "UI": {
            "Actions" : {
                "NoToken" : "You have not selected a valid token. Please select a valid token.",
                "CastSpell" : "You cast the Spell",
                "CastSpellError" : "You're not able to cast the spell",
                "CastSpellInvalidTarget" : "Invalid Target. Please select one hostile token.",
                "OutOfRange" : "The target is out of range. Distance:"
            },
            "Units" : {
                "Action" : "action",
                "Ft" : "ft",
                "Hour" : "hour",
                "Instant" : "instant",
                "Minute" : "minute",
                "Minutes" : "minutes"
            },
            "Phrases" : {
                "Skill" : "Fähigkeit",
                "Spell" : "Zauber"
            },
            "Dialogs" : {
                "CancelSkill" : "Release",
                "CancelSkillDescription" : "Do you really want to release the skill?"
            }
        }
    }
}
