{
   "WC5E": {
      "Backgrounds": {
         "Acolyte": {
            "Description": {
               "1": "You are a religious devotee. Acolytes tend to live somewhat sheltered lives as priests and aides in major religions, until the call to adventure sounds. Acolytes serving in the Church of the Holy Light are most common, but there are also other faiths with established hierarchies, such as the Troll faith in the Loa."
            },
            "Suggestions": {
               "Description": "Acolytes are shaped by their experience in temples or other religious communities. Their study of the history and tenets of their faith and their relationships to temples, shrines, or hierarchies affect their mannerisms and ideals. Their flaws might be some hidden hypocrisy or heretical idea, or an ideal or bond taken to an extreme.",
               "Personality": {
                  "1": "I idolize a particular hero of my faith, and constantly refer to that person's deeds and example.",
                  "2": "I can find common ground between the fiercest enemies, empathizing with them and always working toward peace.",
                  "3": "I see omens in every event and action. The gods try to speak to us, we just need to listen.",
                  "4": "Nothing can shake my optimistic attitude.",
                  "5": "I quote (or misquote) sacred texts and proverbs in almost every situation.",
                  "6": "I am tolerant (or intolerant) of other faiths and respect (or condemn) the worship of other gods.",
                  "7": "I've enjoyed fine food, drink, and high society among my temple's elite. Rough living grates on me.",
                  "8": "I've spent so long in the temple that I have little practical experience dealing with people in the outside world."
               },
               "Ideal": {
                  "1": {
                     "Title": "Tradition",
                     "Value": "The ancient traditions of worship and sacrifice must be preserved and upheld. (Lawful)"
                  },
                  "2": {
                     "Title": "Charity",
                     "Value": "I always try to help those in need, no matter what the personal cost. (Good)"
                  },
                  "3": {
                     "Title": "Change",
                     "Value": "We must help bring about the changes the gods are constantly working in the world. (Chaotic)"
                  },
                  "4": {
                     "Title": "Power",
                     "Value": "I hope to one day rise to the top of my faith's religious hierarchy. (Lawful)"
                  },
                  "5": {
                     "Title": "Faith",
                     "Value": "I trust that my deity will guide my actions. I have faith that if I work hard, things will go well. (Lawful)"
                  },
                  "6": {
                     "Title": "Aspiration",
                     "Value": "I seek to prove myself worthy of my god's favor by matching my actions against their teachings. (Any)"
                  }
               },
               "Bonds": {
                  "1": "I would die to recover an ancient relic of my faith that was lost long ago.",
                  "2": "I will someday get revenge on the corrupt temple hierarchy who branded me a heretic.",
                  "3": "I owe my life to the priest who took me in when my parents died.",
                  "4": "Everything I do is for the common people.",
                  "5": "I will do anything to protect the temple where I served.",
                  "6": "I seek to preserve a sacred text that my enemies consider heretical and seek to destroy."
               },
               "Flaws": {
                  "1": "I judge others harshly, and myself even more severely.",
                  "2": "I put too much trust in those who wield power within my temple's hierarchy.",
                  "3": "My piety sometimes leads me to blindly trust those that profess faith in my god.",
                  "4": "I am inflexible in my thinking.",
                  "5": "I am suspicious of strangers and expect the worst of them.",
                  "6": "Once I pick a goal, I become obsessed with it to the detriment of everything else in my life."
               }
            },
            "Variants": {
               "Cultist": {
                  "Title": "Cultist",
                  "Description": {
                     "1": "You have dedicated your life (and very soul) to the service of a cult. This could be anything from a benign splinter organization away from the main church of the Holy Light to the dark Cult of the Damned, various demon cults (such as with many orcish clans), the Cult of Shadow, among others. With this variant, you are trained in hiding your faith and loyalties from others. You may also be part of the Shadow Council, venerating the Old Gods.",
                     "2": "Rather than training in Insight and Religion, you may exchange one of the proficiencies with Deception or Intimidation."
                  }
               },
               "SisterOfElune": {
                  "Title": "Sister Of Elune",
                  "Description": {
                     "1": "You are part of the Sisterhood of Elune, a matriarchal religious/military organization that holds great sway in Night Elven society. The sisterhood is the gateway of a night elven sister joining the priesthood of Elune (becoming a Priestess of the Moon), or a member of the Watchers organization. Elite Watchers are elevated to being Wardens, legendary jailors of the enemies of Night Elven society.",
                     "2": "Rather than training in Insight and Religion, you may exchange one of the proficiencies with Stealth. Also, rather than having 5 sticks of incense, you instead have an insignia of rank in the priesthood, and a bow of your choice that was the tool of your training in the favored weapon of the moon goddess."
                  }
               }
            }
         },
         "Charlatan": {
            "Description": {
               "1": "You are a special sort of criminal who specializes in taking advantage of others. Charlatans tend to live in urbanized areas where they have many marks (targets) and areas where they can retreat if discovered.",
               "2": "Anyone can become a charlatan, but they are common among human cities due to their urban nature."
            },
            "Suggestions": {
               "Description": "Charlatans are colorful characters who conceal their true selves behind the masks they construct. They reflect what people want to see, what they want to believe, and how they see the world. But their true selves are sometimes plagued by an uneasy conscience, an old enemy, or deep-seated trust issues.",
               "Personality": {
                  "1": "I fall in and out of love easily, and am always pursuing someone.",
                  "2": "I have a joke for every occasion, especially occasions where humor is inappropriate.",
                  "3": "Flattery is my preferred trick for getting what I want.",
                  "4": "I'm a born gambler who can't resist taking a risk for a potential payoff.",
                  "5": "I lie about almost everything, even when there's no good reason to.",
                  "6": "Sarcasm and insults are my weapons of choice.",
                  "7": "I keep multiple holy symbols on me and invoke whatever deity might come in useful at any given moment.",
                  "8": "I pocket anything I see that might have some value."
               },
               "Ideal": {
                  "1": {
                     "Title": "Independence",
                     "Value": "I am a free spirit – no one tells me what to do. (Chaotic)"
                  },
                  "2": {
                     "Title": "Fairness",
                     "Value": "I never target people who can't afford to lose a few coins. (Lawful)"
                  },
                  "3": {
                     "Title": "Charity",
                     "Value": "I distribute the money I acquire to the people who really need it. (Good)"
                  },
                  "4": {
                     "Title": "Creativity",
                     "Value": "I never run the same con twice. (Chaotic)"
                  },
                  "5": {
                     "Title": "Friendship",
                     "Value": "Material goods come and go. Bonds of friendship last forever. (Good)"
                  },
                  "6": {
                     "Title": "Aspiration",
                     "Value": "I'm determined to make something of myself. (Any)"
                  }
               },
               "Bonds": {
                  "1": "I fleeced the wrong person and must work to ensure that this individual never crosses paths with me or those I care about.",
                  "2": "I owe everything to my mentor – a horrible person who's probably rotting in jail somewhere.",
                  "3": "Somewhere out there, I have a child who doesn't know me. I'm making the world better for him or her.",
                  "4": "I come from a noble family, and one day I'll reclaim my lands and title from those who stole them from me.",
                  "5": "A powerful person killed someone I love. Some day soon, I'll have my revenge.",
                  "6": "I swindled and ruined a person who didn't deserve it. I seek to atone for my misdeeds but might never be able to forgive myself."
               },
               "Flaws": {
                  "1": "I can't resist a pretty face.",
                  "2": "I'm always in debt. I spend my ill-gotten gains on decadent luxuries faster than I bring them in.",
                  "3": "I'm convinced that no one could ever fool me the way I fool others.",
                  "4": "I'm too greedy for my own good. I can't resist taking a risk if there's money involved.",
                  "5": "I can't resist swindling people who are more powerful than me.",
                  "6": "I hate to admit it and will hate myself for it, but I'll run and preserve my own hide if the going gets tough.\n"
               }
            }
         }
      },
      "Character": {
         "Strength": "Strength",
         "Agility": "Agility",
         "Stamina": "Stamina",
         "Intelligence": "Intelligence",
         "Spirit": "Spirit",
         "Charisma": "Charisma",
         "HitPoints": "Hit Points",
         "Level": "Level"
      },
      "Class": {
         "Alchemist": {
            "Name": "Alchemist",
            "Introduction": {
               "1": "A forsaken stalks the ruins of a murloc village, picking eyes and bits of flesh. As a skulking murloc prepares to jump out at her, she casually tosses a potion at its chest without glancing at it, causing the skin to bubble and blacken with a terrible—the last thing it sees are the forsaken‘s fingers reaching forward to take out its light.",
               "2": "A gnome reaches down to his box of Alchemist‘s Supplies, picking a rare herb and some pinches of sea salt, before tossing them into a small battle-beaker warmed by a portable burner. With uncanny calm, he weighs the curative mixture, before delivering it to a dying friend, revivifying her.",
               "3": "Laughing maniacally as he consumes his potion, the troll rushes into the fight, fingertips mutating into razor-sharp claws. As his muscles grow larger, and as his skin hardens, his eyes gleam with the promise of pain.",
               "4": "A goblin mercenary sits on the back of a drugged ogre, tossing explosive potions. Wincing as a human warrior stabs his giant homunculus, he pulls out a potion from his side pouch and jams it down the ogre‘s throat. The crunch of teeth against glass invigorates the ogre, and, with a burp, it tosses its arm forward with great strength, tossing the human away as the alchemist laughs in triumph."
            },
            "Description": "Whether by careful measuring, self-experimentation, explosive mixtures, or supportive potions, an alchemist utilizes their own mix of magic and science, alchemical science, to support and heal wounds, decimate enemies, manifest unusual effects, or augment themselves to wade into battle. These lightly armored individuals are experts in creating a variety of special effects, from temporary explosives to elixirs that revive the dead.",
            "Blocks": {
               "1": {
                  "Title": "Magic and Science",
                  "Content": "In the Warcraft universe, alchemy is not merely pseudo-chemistry—it is an art that draws power from the primal elements of life, not unlike actual magic. An alchemist is a master of the art who takes it leaps and bounds further than their peers, who are limited in their alchemical products to mere healing poultices and anti-toxins, reaching heights of reviving the dead or manifesting massive explosives.<br>The greatest strength of an alchemist is their versatility. They can themselves adequately but can specialize in being battle-chemists who augment themselves with potions before tearing their enemies apart with their own hands. They can choose to focus on the augmentative powers of their mixtures, delaying harm and healing wounds, or to debilitate their enemies with negative status effects. Damage dealt by an alchemist‘s potions usually focus on concussive or poison damage, but they are also broad in scope, dealing fire or frost or lighting as required of them. The better they anticipate their opposition, the better the alchemist can prepare.<br>The success of alchemists relies greatly on the formulae and recipes they have in their formula books. They gain new formulae as they gain experience, study other formula books, or research independently."
               },
               "2": {
                  "Title": "The Weight of Knowledge",
                  "Content": "Alchemists' lives may appear mundane, starting as a sage, independent researcher under a mage tower, a plague researcher, or member of a military force‘s supply chain. Other alchemists focus on trade, opening alchemy shops and selling anything from curative mixtures to love potions. Others still have adapted their talents to violence, such as serving in mercenary forces or the military, sapping structural defenses and focusing on combat support.<br>The weight of knowledge and the demand for versatile potions calls for even the most sedentary alchemists to venture out to investigate strange happenings, support their friends, or answer the call to heroism.<br><br>Alchemists are students, researchers, and scientists of the mysterious science of alchemy. To choose to alchemist class is to be more than a dabbler in the art of alchemy—they are utilizers of strange techniques that would empower themselves and their allies, experienced craftspeople who can make potions for fractions of the normal time and cost, and some have even modified their bodies to make full use of their skills.<br>Creating poisons, potions, special explosives, and empowering substances, alchemists are either curiosities, prized members of society, or reclusive, feared experts in unstable weird sciences. Alchemy itself does not fall strictly in one end between science and magic, but is a potent force nonetheless.<br>Alchemists support soldiers and adventurers, and could easily take to the field themselves, brewing and concocting potions, poisons, and poultices to support (or create) allies on the field. Some work to support their communities, others attempt to replicate (or surpass) the work of the Scourge's necromancers, and others focus on self-empowering through strange concoctions they imbibe."
               },
               "3": {
                  "Title": "Creating an Alchemist",
                  "Content": "As you make your alchemist character, consider the origins of their knowledge: were they selftaught, a student of another alchemist, or did they gain this mastery by esoteric means? Alchemy is a difficult discipline—how did you accomplish the challenge to gain your status? Were you motivated by war, fortune, or by something else entirely, such as the lack of magical talent to become a spellcaster?<br>Perhaps you preferred the reliable mundane science of alchemy over the unexpected extraordinary power of magic, or took comfort in the fact that you were in demand in an urban setting—there is no lack of adventurers who might need your aid as an alchemist if you do not wish to go out and adventure. Do you have any peers among alchemists? Do they perceive your approach to science as calm and intellectual, or rash but with great breakthroughs or a dangerous form of meddling with life and death that should not be tolerated? Do you have a special ambition or goal to achieve as an alchemist—such as making magic-like effects accessible to the mundane public, providing affordable healing, and counters to common ailments, or are your creations for your own monetary benefit?"
               }
            },
            "QuickBuild": "You can make an alchemist quickly by following these suggestions. First, Intelligence should be your highest ability score. Make Agility your next-highest if you want to use ranged or finesse weapons, or focus on throwing potions and explosives. Use Strength instead if you wish to empower yourself in battle and engage in combat via the mutate spell. Second, choose the guild artisan or scholar backgrounds. Third, choose the noxious fumes (poison spray), minor alchemy, and fire bolt cantrips, along with the following 1st-level spells for your formula book: <i>burning hands</i>, <i>explosion</i>, <i>mutate</i>, and <i>rejuvenation</i>.",
            "Paths": {
               "Apothecary": {
                  "Title": "Apothecary",
                  "Description": "You recognize no boundary of morality or faith in your pursuit of weird science. Reaching beyond the realms of experimention to dissect the supernatural, you employ necromancy, soul magic, and unusual diseases and poisons. Apothecaries usually dress as plague doctors or experimenters, dealing with death and strange occult things for reasons only they know."
               },
               "Mutant": {
                  "Title": "Mutant",
                  "Description": "You push your body past the normal limit—mutation is no mere rage or chemical reaction; it is a secret science only you know. Mutants are often ostracized by society, which sees such unstable people to be dangerous and fickle in their moods."
               },
               "Transmutor": {
                  "Title": "Transmutor",
                  "Description": "Whereas the apothecary dabbles with the line between life and death, and the mutant experiments on themselves, you handle alchemy as a science and a tool, and are considered a more ‘classical‘ alchemist. Transmutors are appreciated in societies, often serving in courts or in magical circles to quantify the true nature of alchemy, sicknesses, and magic. In adventuring parties, they often focus on support."
               }
            }
         },
         "DeathKnight": {
            "Name": "Death Knight",
            "Introduction": {
               "1": "Clad in armor streaked with warm blood, the human‘s eyes glow in a cold blue light as he swings his greatsword with precise fury, keep foes occupied with him. As he does so, his allies around him watch as his wounds seem to heal by vampiric-like magic even as the enemy falls.",
               "2": "Standing tall against the oncoming horde, a blood elf embraces the frozen resolve within to shrug off her enemies‘ attacks. Imbuing her twin shortswords with the power of the frozen north, her attacks break through their armor with reckless abandon, sending icy bits of armor, bone, and flesh flying.",
               "3": "A dwarf gazes over the battlefield alone, remembering a past life when he commanded legions of his brethren to defend their homelands. No longer the same dwarf, he raises his hand, binding the corpses to undeath, once more in the position of command, old loyalties broken in death. "
            },
            "Description": "Years after the destruction of Draenor, the immensely powerful Lich King created a new breed of death knights: malevolent, rune-wielding warriors of the Scourge. The first and greatest of these was the Lich King's chosen champion, Prince Arthas Menethil. Once a mighty paladin of the Silver Hand, the prince sacrificed his soul to claim the runeblade Frostmourne in a desperate bid to save his people, and having his soul bound for eternal servitude under the Lich King. The rest are primarily made up of other fallen paladins whose souls were twisted and bound to the will of the Frozen Throne.<br>Like Gul'dan's death knights, these dark champions possess unholy strength; they, however, do not possess free will and their minds are inexorably entwined with and dominated by the Lich King's vast consciousness. Despite the potential loss of free will, some powerful mortals are intrigued by the promise of immortality and pledge their souls freely into the Lich King's service to achieve it. In the years since Arthas shattered the Frozen Throne and merged with the Lich King, the power and fury of the death knights has only grown. Now these unrelenting crusaders of the damned eagerly await the Lich King's command to unleash their fury on Azeroth once again. Unlike death knights of the Old Horde, the Scourge's death knights are not limited to their use of ranged spell casting abilities. In addition, these tireless death knights are considerably stronger, faster, and more agile than they were in life. However, both generations are equally destructive and terrifying to engage in the field of battle.",
            "Blocks": {
               "1": {
                  "Title": "Fallen Protectors",
                  "Content": "Most death knights were once virtuous defenders of humanity and truth as paladins. However, once the paladin ranks were disbanded by the failing Alliance, many of these holy warriors traveled to the quarantined lands to ease the suffering of those left within the plague-ridden colonies. Though the paladins were resistant to disease, they were persecuted by the general populace who believed that they had been infected by the foul plague. A small band of paladins, embittered by society's cruelty, traveled north to find the plague's source. These renegade knights succumbed to bitter hatred over the course of their grueling quest. When they finally reached Ner'zhul's icy fortress in Northrend they had become dark and brooding. The Lich King offered them untold power in exchange for their services and loyalty. The weary, vengeful warriors accepted his dark pact, and although they retained their humanity, their twisted souls were bound to his evil will for all time. Bestowed with black, vampiric Runeblades and shadowy steeds, death knights serve as the Scourge's mightiest generals."
               },
               "2": {
                  "Title": "Released from Service",
                  "Content": "When the Lich King's control of his death knights was broken, his former champions sought revenge for the horrors committed under his command. After their vengeance was won, the death knights found themselves without a cause and without a home. One by one they trickled into the land of the living in search of a new purpose. The Knights of the Ebon Blade is a faction consisting of the renegade death knights that broke free of the Lich King's control after the battle of Light's Hope Chapel. Led by Highlord Darion Mograine, the Knights of the Ebon Blade have allied themselves with the Alliance and the Horde with the help of Highlord Tirion Fordring of the Knights of the Silver Hand, and have pledged to do their part in defeating their former master, the Lich King. Their main base is Acherus: The Ebon Hold, taken from the Scourge after breaking free."
               },
               "3": {
                  "Title": "Creating a Death Knight",
                  "Content": "When creating your Death Knight, consider your relationship with the person or being that resurrected you. Do you know who it was, or why they brought you back from death? Do you feel indebted to them for giving you a second chance at life, or are you angry that they took you away from your eternal rest? Death knights often have terrible stories to tell that ended with their deaths. Consider your story before your death—if you were once a paladin, consider the oath you took. Do you remember it? Do you choose to follow those tenets again, or forsake your paladin teachings and follow a new path? If you were a noble or important member of your society, how do you cope with their expectations and your role? What evils have you committed under the Lich King‘s dominion? Have you committed crimes that you secretly approve of, such as the murder of a noble who let you down in  your old life, or lethally ending rivalries in life? Have you been commanded to use your power to raise the dead, and have you had a choice in raising anyone you once knew? Also, consider if and how you will attempt to reintegrate with society; most citizens of Azeroth fear and suspect the intentions of death knights, and might try to sabotage their acceptance. Have you wronged anyone who might oppose your reentry into society? Will you accept being separate from all factions, and choose to take up quests with only like-minded individuals?"
               }
            },
            "QuickBuild": "You can make a death knight quickly by following these suggestions. First, Strength should be your highest ability score, followed by Charisma. Second, choose the noble or criminal background.",
            "SpecialFeats": {
               "Corruption": {
                  "Label": "Corruption",
                  "Description": "Upon gaining a level in this class, you may permanently pledge your soul as well, turning yourself into an undead creature (permanently gaining the below Undead Nature ability, and counting as the undead creature type)."
               },
               "RuneSpells": {
                  "Label": "Rune Spells",
                  "Description": "Death Knights are the only class that can access the rune array spell, and can prepare different runes for strike effects. Runes are magical enhancements that can enhance a death knight‘s weapon attacks, and can be released in coordination with the Runic Strike ability to cause a devastating strike."
               },
               "RuneBound": {
                  "Label": "Rune Bound",
                  "Description": "Upon gaining a level in this class, you can turn one (of both, if using two weapons to fight) of your weapons into Runeblades, a weapon infused with the might of the Lich King and his blessing. Runeblades have three benefits:<br><ul><li>They serve as spellbooks and store spells (as described under Spellcasting).</li><li>You gain advantage to saving throws against any effect that controls your character or alters their alignment against the Lich King‘s will while using them.</li><li>The blade serves as an unholy symbol.</li><li>The runeblade is a greater attunement weapon (see Chapter 5: Equipment).</li></ul><br>You cannot have multiple Runeblades (beyond the one you choose or two you fight with). If lost, the blade usually finds its way back to you (or you to it) due to the bond you share."
               }
            },
            "Paths": {
               "PathOfBlood": {
                  "Title": "Path of Blood",
                  "Description": "You are a dark guardian who manipulates and corrupts life energy to sustain themselves in the face of the enemy‘s onslaught. Blood death knights invoke ancient legends of blood-drinking beings who are immortal on the battlefield."
               },
               "PathOfFrost": {
                  "Title": "Path of Frost",
                  "Description": "You are a harbinger of doom, channeling runic power and delivering freezing weapon strikes. Frost death knights are terrors of the frozen wastes."
               },
               "UnholyPath": {
                  "Title": "Unholy Path",
                  "Description": "You are a pale horseman of death, leading undead troops to battle, fueled with hatred of the living. Unholy death knights lead armies of the dead and overwhelm their enemies."
               }
            }
         },
         "Druid": {
            "Name": "Druid"
         },
         "Hunter": {
            "Name": "Hunter"
         },
         "Mage": {
            "Name": "Mage"
         },
         "Paladin": {
            "Name": "Paladin"
         },
         "Priest": {
            "Name": "Priest"
         },
         "Shaman": {
            "Name": "Shaman"
         },
         "Tinker": {
            "Name": "Tinker",
            "Introduction": {
               "1": "A dwarf holds out his rifle, standing watch over his position atop defensive walls. In the distance, he hears the explosion in a mine. Mentally calculating the distance, he turns to a nearby mortar, adjusting a few settings. He pulls the primer, smirking as the mortar lobs the explosive shell somewhere into the woods behind cover, releasing panicked screams and another blast.",
               "2": "A large mechanical construct with arms of steel and razorsharp claws approaches a keep‘s shut portcullis. The construct digs its claws under the steel of the gate, and begins pulling it upwards, as a small voice from inside the construct urges its fellows to pass quickly. From the walls, an arrow clangs on the construct‘s shoulder, causing the driver of the mecha to turn, lift an arm, and release a rocket barrage against the hapless archer. From within, a gnome squeaks out an apology.",
               "3": "The goblin‘s green skin seems almost black from the soot of her explosives as she ducks behind the ruined door frame, evading sling bullets and bolts of frost. She rests her back on the wall for a moment, and unhooks a mechanical wheel from her back. She revs up a rip-tire, packs a few pieces of dynamite into it, and releases it. With a roar, the wheel charges into the open gateway and lets out a resounding blast. The goblin then smirks at the silence, and hearing a groan, she pulls out her flamethrower, and moves in to clean up."
            },
            "Description": "For the tinker, innovation is both the tool and the end. Having the brain and the tools give them the nearly limitless capacity to solve any problem. These engineers are lightly armored, and are proficient with the skills to create a variety of tools and machines to help them achieve their goals.",
            "Blocks": {
               "1": {
                  "Title": "Consummate Innovators",
                  "Content": "Tinkers among the smartest and most creative of the adventurers setting out to explore and conquer Azeroth. As a creator of incredible inventions from steam saws to siege engines, your devices allow them to overcome nearly any situation — and if you don‘t have the device they need, you just might be able to design and create a new one on the spot.<br>>Tinkers are born of necessity—economic or military. Many gnomish and goblin engineers chose to take up the path of the tinker because of its demand in peace and wartime, and to satisfy their creativity. Tinkers tend to carry about packs and pouches full of heavy tools, spare parts and inventions both finished and incomplete. In doing so, they quickly develop the ability to shoulder casually otherwise crushing burdens. Furthermore, the tinker‘s ability to put together devices out of random piles of spare parts or whatever wires and gears they happen to be carrying is a valuable asset, allowing a tinker to address problems and improvise even when they would otherwise be stumped.<br>From developing vehicles such as the zeppelin or the steam engine to reliable weapons and explosives, tinkers are increasingly needed innovators in the changing World of Warcraft. "
               },
               "2": {
                  "Title": "Adaptable Combatants",
                  "Content": "Tinkers prefer to spend days, weeks or even months constructing the devices they design. When adventuring, though, tinkers are often forced to throw together a device more quickly or adapt  pieces of fallen technology to their purposes. A tinker can arrive onto a battlefield with many tools, ranging from firearms, explosives, strange gadgets, to even personal vehicles and mecha. A tinker always balances what they can bring with what they should bring, as relying on technology that is too young could result in a crisis like the destruction of Gnomregan. They also look forward to repurposing enemy technology, and a tinker‘s strength can grow the more developed their opposition is.<br>Tinkers have a reputation for being dangerous companions before specializing, born mainly of reckless goblins experimenting with explosives, or using gadgets made and owned by others. However, the true heart of the tinker profession can be found in the steady craftsmanship of the dwarves and the wild-eyed curiosity of the gnomes."
               },
               "3": {
                  "Title": "Creating a Tinker",
                  "Content": "When you create a tinker, consider where you learned your craft. Are you self-taught or a student of a well-established guild, university, or master tinker? How has that affected your starting devices and formulae? Another thing to consider is your specialty—many gnomes and draenei prefer to rely on gadgets, while goblins lean towards explosives, and dwarves would swear on a reliable firearm.<br>Are the components and parts of your devices usually supplied and numbered or scavenged and repurposed from other devices?<br>Do you have qualms of repurposing technology (seeing it as a mark of poverty) or revel in it (seeing it as a proof of your power and skill)? Have you ever worked for an engineering society or guild— how have they treated you or used your inventions?"
               }
            },
            "QuickBuild": "You can make a tinker quickly by following these suggestions. First. Intelligence should be your highest ability score. Make Agility your next-highest if you want to excel at using firearms and explosives. Choose Stamina or Strength instead if you plan to emphasize using constructs and mecha. Second, choose the guild artisan background. Third, choose the following starting devices in your engineer‘s notebook: boomstick (or auto-crossbow), fog machine (gadget), flamethrower (gadget), and hand grenade (or iron rockets, iron bombs, or iron mines).",
            "Paths": {
               "Bomber": {
                  "Title": "Bomber",
                  "Description": "You appreciate the controlled destruction behind a bomb, terrible surprise beneath a mine, and the terror a rocket invokes. Bomber tinkers often makes use of mortars and rocket or mine launchers, to deny enemy mobility as well as to deal massive damage to their enemies. Bombers are also known as grenadiers, and often take to the skies on gyrocopters to unleash their fury from above."
               },
               "Gunner": {
                  "Title": "Gunner",
                  "Description": "You are not only a renowned gunsmith, but also an excellent marksman. Gunners are often called gunslingers or musketeers, and are usually employed in battlefields."
               },
               "Gadgeteer": {
                  "Title": "Gadgeteer",
                  "Description": "You appreciate the versatility gadgets provide, or prefer to craft and control constructs such as mechs and vehicles of all types. Gadgeteers are often the drivers of their own devices, such as the engines of goblin balloons, dwarf steam tanks, or gnomish submarines and gyrocopters."
               }
            }
         },
         "Warlock": {
            "Name": "Warlock"
         },
         "Warrior": {
            "Name": "Warrior",
            "Introduction": {
               "1": "The heavily-armored dwarf takes a deep breath, tightening his grip on a war-hammer in one hand and a battleaxe in the other, facing down the ogre warlord raiding his mountain home. The mountain king shouts a battle-cry, suddenly increasing in size to equal the ogre, and swings his axe to dig deeply into the ogre‘s shoulder, before bringing down the war-hammer, causing a bloody shower to erupt onto his face.",
               "2": "An orc armed with a great two-handed blade leaps towards two naga, cleaving through both with a single strike and shaking the ground where he fell. Not breaking a sweat, he charges ahead to the next foe.",
               "3": "A tauren calmly strides across the fel-suffused battlefield, seeking a worthy opponent. Eventually, he finds his match, a bloodthirsty felguard. Treading carefully, he parries every blow with his giant battle-totem. Noticing an opportunity, the tauren warrior slams his hooves into the ground, knocking the felguard down, and then bringing down his mighty totem down, caving the fiend‘s torso inward with a furious war-cry."
            },
            "Description": "Warriors are fighters highly trained in the art of weaponry. Combat is the warrior's strongest skill. They are strong and quick on the battlefield. Depending on their specialization, a warrior can often deal very high damage or be tough to kill.",
            "Blocks": {
               "1": {
                  "Title": "Trained for Battle",
                  "Content": "As long as war is waged on Azeroth, there will be men and women who fight those wars. Warriors are no mere sword-swingers; they are skilled combatants, combining strength of arm, knowledge of weaponry, and practiced maneuvers to slice or bludgeon their foes into little red bits. Warriors are the most versatile of the combat classes, and they supplement their fighting prowess with the ability to rally their allies and spur them to victory. They charge into the heart of the battle and survive the most grievous of wounds. Elven and dwarven warriors reach into their blood for innate magic, creating spellbreakers and mountain kings, respectively, while tauren and orcs lean naturally towards using a single large weapon and the Arms path, creating chieftains and blademasters, respectively.<br>Warriors are common in dwarf, forsaken, human, and orc societies, but many other species also fill their ranks with warriors. Masters of swords, spears, and weapons of all kinds, warriors share a common way of life on Azeroth. Using their abilities to deal pain and cause bloodshed, warriors are deadly adversaries and welcome friends in violent times (which seem to be all the time in recent decades). Anyone willing to take up arms to defend their people can be classed as a warrior. A knight is the warrior elite among humans."
               },
               "2": {
                  "Title": "Elite Fighters",
                  "Content": "Not every member of the city watch, village militia, or the queen‘s army is a warrior. Most of these troops are relatively untrained soldiers with only the most basic combat knowledge or drilled for a certain function. Veteran soldiers, military officers, trained bodyguards, dedicated knights, and similar figures are true warriors—it is all about the spirit, in truth.<br>Some warriors feel drawn to use their training as adventurers. The dungeon delving, monster slaying, and other dangerous work common among adventurers is second nature for a warrior, not all that different from the life he or she left behind. Other warriors live a more stable life, serving as elite members in an order or military force, answering assignments and missions that involve armed pacification of resistance or the escort of vulnerable charges."
               },
               "3": {
                  "Title": "Creating a Warrior",
                  "Content": "For as long as war has raged, heroes from every race have aimed to master the art of battle.<br> Warriors combine strength, leadership, and a vast knowledge of arms and armor to wreak havoc in glorious combat. Some protect from the front lines with shields, locking down enemies while allies support the warrior from behind with spell and bow. Others forgo the shield and unleash their rage at the closest threat with a variety of deadly weapons.<br>As you build your warrior, think about your character‘s background: Where did you get your combat training, and what sets you apart from the mundane soldiers around you? You might have enjoyed formal training in a noble‘s army or in a local militia. Perhaps you trained in a war academy, learning strategy, tactics, and military history. Or you might be self—taught—unpolished but well tested.<br>Were you particularly ruthless? Did you get extra help from a mentor, or did your spirit shine brightly enough to warrant the title due to exceptional dedication? What drove you to this training in the first place? Was it a threat to your homeland, a thirst for revenge, or a need to prove yourself? Did you take up the sword as a way to escape the limits of life on a farm, or are you following a proud family tradition? Where did you acquire your weapons and armor? They might have been military issue or family heirlooms, or perhaps you scrimped and saved for years to buy them. Your armaments are now among your most important possessions—the only things that stand between you and death's embrace."
               }
            },
            "QuickBuild": "You can make a warrior quickly by following these suggestions. First, make Strength or Agility your highest ability score, depending on whether you want to focus on melee weapons or on archery (or finesse weapons). Your next-highest score should be Stamina. Second, choose the soldier background.",
            "SpecialFeats": {
               "UnarmoredDefense": {
                  "Description": "You may lose proficiency with heavy armor, and instead gain the unarmored defense ability. These are not gained as part of multi-classing."
               }
            },
            "Archetypes": {
               "Arms": {
                  "Title": "Arms",
                  "Description": "You focus on wielding great weapons, breaking enemy lines, inflicting the first wounds in battle, and dealing massive amounts of damage. As they cleave through several creatures at once to soften up their foes for their allies, arms warriors become an inspiring sight on the battlefield, and are masters of their chosen weapons."
               },
               "Fury": {
                  "Title": "Fury",
                  "Description": "You equip yourself with two weapons, and slice your enemies to ribbons while shouting vengeance. Fury warriors make good party members, as inspiring shouts aid their allies."
               },
               "Protection": {
                  "Title": "Protection",
                  "Description": "You are the forward vanguard, decking yourself with heavy armors and a reliable shield. Protection warriors deflect and guarding their allies from attacks, and return damage with interest."
               }
            }
         }
      },
      "Feats": {
         "AbilityScoreImprovement": {
            "Label": "Ability Score Improvement",
            "Description": {
               "1": {
                  "Value": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can‘t increase an ability score above 20 using this feature."
               }
            }
         },
         "AbilityScoreImprovementWarrior": {
            "Label": "Ability Score Improvement (Warrior)",
            "Description": {
               "1": {
                  "Value": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can‘t increase an ability score above 20 using this feature."
               }
            }
         },
         "AdaptableInurement": {
            "Label": "Adaptable Inurement",
            "Description": {
               "1": {
                  "Value": "You can utilize a sample or body part of a creature and mix it into a potion as a Bonus Action, inuring the target to it. If inured this way, the target can use your temporary potion as if it were you. This includes anything from hair, a bit of skin, saliva, blood, or nails. Furthermore, whenever it uses a potion inured to it, it can roll twice and choose the result when miscibility is rolled."
               },
               "2": {
                  "Value": "You are always counted as if you are inured to your own potions. If you could already roll twice on miscibility, you can roll three times instead."
               }
            }
         },
         "Alchemy": {
            "Label": "Alchemy",
            "Description": {
               "1": {
                  "Value": "When starting with this class, you have proficiency with Alchemist‘s Supplies and can use them with uncanny skill. You can create alchemical mixtures from any spell that belongs to the alchemist spell list, so long as you have the alchemical formula. This does not allow you to cast spells, only to know them enough to create potions. Each level in the alchemist class provides you with 1 caster level to access alchemical formulae, as appropriate to the alchemist spell list."
               },
               "2": {
                  "Title": "Cantrips",
                  "Value": "At 1st level, you know a number of cantrips equal to your proficiency bonus. As normal for alchemist spells, you cannot cast them, but can turn them into potions. Cantrips do not require a formula book, and are always memorized."
               },
               "3": {
                  "Title": "Conjuring and Binding",
                  "Value": "An alchemist can conjure and bind aberrations, constructs, elementals, oozes, plants, and undead, as well homunculi creatures (creatures with the homunculus template). This is usually done by crafting miniature versions and preparing them in potions or globes of alchemical mixtures."
               },
               "4": {
                  "Title": "Preparing and Casting Spells",
                  "Value": "Each alchemist level provides you with one caster level in the alchemist class (minimum 1). You follow the normal progression to unlock spell levels (see the table under the Mana section). You may not prepare spells, but can brew them into potions, so long as you have your formulae book or have memorized the formula. When you level up, you can exchange a spell known with another you qualify for. You cannot otherwise change your alchemist spells other than by leveling up and exchanging them, or by training under another alchemist, fiend, celestial, or undead creature (see tutorship under magic)."
               },
               "5": {
                  "Title": "Spellcasting Ability",
                  "Value": "Intelligence is your spellcasting ability for your alchemist spells and abilities, since your powers draw upon your scientific prowess. You use your Intelligence modifier whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for an alchemist effect you create and when making an attack roll with one."
               },
               "6": {
                  "Value": "<strong>Spell save DC</strong> = 8 + your proficiency bonus + your Intelligence modifier<br><strong>Spell attack modifier</strong> = your proficiency bonus + your Intelligence modifier"
               },
               "7": {
                  "Title": "Spellbook – Formula Book",
                  "Value": "At 1st level, your formula book contains four 1st-level alchemist spells of your choice. When you level up, you gain 2 additional alchemist spells of your choice. You may also acquire new spells by  research, tutelage, or by deriving formulae from the spellbooks and scrolls of spellcasters who have spell versions of the formulae on your spell list. Your formula book is effectively your spellbook, and you may add spells by studying with it and replicating experiments found in other formula books."
               }
            }
         },
         "AlchemyPath": {
            "Label": "Alchemy Path",
            "Description": {
               "1": {
                  "Value": "You walk a path that defines you as your path of alchemy. Up to this time you have been in a preparatory stage, committed to a path but not yet fully enveloped in it. Now you choose the Path of the Mutant for self-transmutation and improving your combat abilities, Path of the Transmutor for theoretical pursuits and advanced alchemical effects, or Path of the Apothecary to go beyond morality and mortality and dabble in death and life magics, all detailed at the end of the class description."
               },
               "2": {
                  "Value": "Your choice grants you features at 3rd level and again at 6th, 10th, and 14th level. Those features include path spells."
               },
               "3": {
                  "Title": "Path Spells",
                  "Value": "Each path has a list of associated spells. You gain access to these spells at the levels specified in the path description. Once you gain access to a path spell, you always have it known and memorized. Path spells do not need to be stored in the alchemical notebook."
               },
               "4": {
                  "Value": "If you gain a path spell that doesn‘t appear on the alchemist spell list, the spell is nonetheless an alchemist spell for you."
               }
            }
         },
         "Augmentation": {
            "Label": "Augmentation",
            "Description": {
               "1": {
                  "Value": "You can augment a potion you hold by spending 1 minute or an Bonus Action and 4 Crafting Points. An augmented potion remains augmented indefinitely, but you can only have up to one potion augmented at any given time. You can apply the following augmentations:"
               },
               "2": {
                  "Options": {
                     "1": "Every dice your potion rolls is maximized.",
                     "2": "Every dice your potion rolls is minimized (lowest result on the roll).",
                     "3": "When the potion is used, roll a d100. On a result of 50 or higher, the potion gives its full effects with only a fraction of the actual content, allowing the potion to be reused.",
                     "4": "You alter your potion to activate in response to a trigger you choose and that can affect the potion‘s contents, such as time passed, being shaken a certain way, or being touched by an eligible target. This does not stack with the Internal Clock feature.<br>For instance, if you can create an exorcism potion, you can coat a sword with it to activate in response to touching an eligible target of the spell, or to activate after 1 minute to counter a possible possession."
                  }
               }
            }
         },
         "AuraDeathKnight": {
            "Label": "Aura",
            "Description": {
               "1": {
                  "Value": "Your mastery over aura spells begins to manifest. You always have the following aura spells prepared."
               },
               "2": {
                  "Options": {
                     "1": "At 3rd level, you always have the abandonment aura spell prepared.",
                     "2": "At 6th level, you always have the necrotic aura spell prepared.",
                     "3": "At 10th level, you always have the unholy aura spell prepared.",
                     "4": "At 14th level, you always have the distraction aura spell prepared.",
                     "5": "At 18th level, you always have the vulnerability aura spell prepared."
                  }
               },
               "3": {
                  "Value": "Furthermore, you may cast each of the above aura spells for no cost once upon reaching the described level. You regain all expended uses after a short rest. You may expend a free aura use to cancel one successful turn undead attempt that affected your undead allies."
               }
            }
         },
         "AuraImprovementDeathKnight": {
            "Label": "Aura Improvement",
            "Description": {
               "1": {
                  "Value": "You can no longer lose concentration on an aura from taking damage, and may extend the range of any aura spell by 100%. Any effect that would normally dispel the aura instead suppresses it for 1 minute instead."
               }
            }
         },
         "ArmyOfTheDead": {
            "Label": "Army of the Dead",
            "Description": {
               "1": {
                  "Value": "Starting at 15th level, your conjure undead (animate undead) spells are inherently stronger than others. You may cast the conjure undead spell as an action instead of 1 minute when conjuring undead. Once this feature is used, it cannot be used again until after a short rest. If you cast the spell with its full casting time, a number of zombies arise to fight for you and protect you while you focus on casting the spell. The number of zombies is equal to 2 per spell level, so far as there are sufficient corpses within 30 feet."
               },
               "2": {
                  "Value": "These temporary undead followers are friendly to you and your allies, and are controlled as normal summons, but do not count against your limit of summoned undead. The DM has the zombies‘ statistics. Once the spell‘s casting time ends and you successfully cast the conjure undead spell, you can use an action to maintain the additional zombies. The additional zombies cannot remain more than 10 minutes. If you lose concentration on the spell, you also lose concentration on the zombies, and they stop animating."
               },
               "3": {
                  "Value": "Furthermore, if you do not have the required number of corpses (the required material focus) for animating undead, you use corpses from any place so long as you are within 1 mile of a graveyard, mass grave, battlefield, or any location with sufficient number of corpses so long as they are not on hallowed ground. The earth must be loose enough for the zombies to dig their way out. The temporary undead you create from casting conjure undead require the corpses to be within 30 feet, however."
               }
            }
         },
         "BattleChemist": {
            "Label": "Battle Chemist",
            "Description": {
               "1": {
                  "Value": "You gain the Flash Bomber talent. These uses stack with the Weird Science feature (if you already chose it)."
               },
               "2": {
                  "Value": "Also, whenever you are in the area of effect of the explosion spell (regardless of origin), you can benefit from the berserker rage spell for 3 rounds."
               }
            }
         },
         "BattleCommands": {
            "Label": "Battle Commands",
            "Description": {
               "1": {
                  "Value": "You gain the Shout talent for free (if you don‘t already have it). Furthermore, whenever you attack with your off-hand weapon as a bonus action, you can maintain a shout or apply one strike effect."
               }
            }
         },
         "BattleTested": {
            "Label": "Battle-Tested",
            "Description": {
               "1": {
                  "Value": "Your innovated creations that have been used at least three times without breaking down can be kept unused indefinitely (instead of breaking down after 5 minutes). If you choose to make the item into a permanent creation, you must pay the normal crafting cost, but the item‘s malfunction rate is 1 point lower (minimum 0). This improved model can be shared and scribed down as a new innovation. You cannot battle-test a base design more than once."
               },
               "2": {
                  "Value": "You may also deal double damage to objects and constructs with your melee attacks as a strike effect."
               },
               "3": {
                  "Value": "For the purposes of the Superfunction ability, battle-tested creations act as if its malfunction rate is 1 point higher instead of 1 point lower."
               }
            }
         },
         "Biohazard": {
            "Label": "Biohazard",
            "Description": {
               "1": {
                  "Value": "You gain the Mithridatism Weird Science feature if you didn‘t choose it at level 1."
               },
               "2": {
                  "Value": "If you already have the feature, it is instead enhanced as follows:"
               },
               "3": {
                  "Options": {
                     "1": "You have a maximum of 8 poison doses instead of 4, and you regain 2 doses when you complete a short rest.",
                     "2": "The poison DC is increased by 2.",
                     "3": "Gaining acquired immunity to poisons or diseases requires only one-quarter the normal time. See the Poisoner‘s Kit for the ability to gain immunities against diseases or poisons."
                  }
               }
            }
         },
         "BlockAndTackle": {
            "Label": "Block and Tackle",
            "Description": {
               "1": {
                  "Value": "You may use a reaction to block a weapon attack that hits you, reducing the damage taken by 1d12 + your Stamina modifier. This requires a shield. If this reduces the damage to 0 points, you may use the same reaction to attack the target with an opportunity attack. You can use this feature a number of times equal to your Stamina bonus (minimum 2 uses). Once all uses are expended, they are restored after a short rest."
               },
               "2": {
                  "Value": "You may expend two uses of this ability and benefit an ally within 5 feet of you with this ability instead of you, reducing the damage on them as described (and targeting whoever harmed them with an opportunity attack). If whoever struck your ally is not within your melee range for the opportunity attack, you may move up to 5 feet to deliver it."
               }
            }
         },
         "BloodStrike": {
            "Label": "Blood Strike",
            "Description": {
               "1": {
                  "Value": "Whenever you hit a living creature with a melee weapon attack, you can spend one of your hit dice to regain health."
               }
            }
         },
         "BloodTap": {
            "Label": "Blood Tap",
            "Description": {
               "1": {
                  "Value": "Whenever you use Death Pact to restore mana, the mana restored is increased by 50% (or 3 mana points per spell level)."
               }
            }
         },
         "BloodThirst": {
            "Label": "Blood Thirst",
            "Description": {
               "1": {
                  "Value": "You may attack again if you miss an attack. This does not require a separate action from the one used to make the attack. If you make use of this ability, the target is not counted as if they were hit for the purposes of the Strike the Wound ability unless you also successfully hit them. You may use this number of times equal to your Stamina modifier, which replenishes upon completing a short or long rest."
               },
               "2": {
                  "Value": "Furthermore, if you miss an attack roll against an enemy, you are treated as if you successfully landed a hit for the purposes of the Strike the Wound ability."
               }
            }
         },
         "BloodyRibbons": {
            "Label": "Bloody Ribbons",
            "Description": {
               "1": {
                  "Value": "Whenever you spend a Bonus Action to make an attack with your off-hand weapon, you can instead make two attacks. Also, whenever you would gain an action (such as by the haste spell or Action Surge ability), you double the attacks you can normally make with your Bonus Action."
               },
               "2": {
                  "Value": "Bloody Ribbons expends a use of your Bloodthirst ability."
               }
            }
         },
         "ChannelDivinityBloodWard": {
            "Label": "Channel Divinity: Blood Ward",
            "Description": {
               "1": {
                  "Value": "You can spend a Channel Divinity use as a reaction to enhance any aura you have to resist hostile magic. Choose one school of magic. You can grant yourself and everyone within range of any aura you have advantage on saving throws versus any magical effect from that school 1 minute."
               }
            }
         },
         "ChannelDivinityBolsterUndead": {
            "Label": "Channel Divinity: Bolster Undead",
            "Description": {
               "1": {
                  "Value": "You can use a Channel Divinity use to guard undead against being turned, as well as empowering them. All and any undead under your command within 30 ft. of you may add your Proficiency bonus to attack rolls, skill checks, and saving throws for one minute, and may ignore one Turn Undead attempt. This does not stack with their own proficiency bonuses."
               },
               "2": {
                  "Value": "You cannot benefit from the numeric bonus, even if you are undead, but can resist one Turn Undead attempt as normal. This bonus remains for ten minutes."
               }
            }
         },
         "ChannelDivinityFreeze": {
            "Label": "Channel Divinity: Freeze",
            "Description": {
               "1": {
                  "Value": "You can spend a Channel Divinity use as an action to cause enemies within a 20-foot radius to be wracked with unbearable pain as you freeze their blood. The targets must succeed a Charisma save or suffer Disadvantage to all attack rolls and skill checks, and move at half movement while in the affected area. This lasts for a number of rounds equal to your Death Knight level. A creature can repeat the saving throw at the end of its turn every round."
               }
            }
         },
         "CleavingStrike": {
            "Label": "Cleaving Strike",
            "Description": {
               "1": {
                  "Value": "When you successfully attack and damage a creature with a melee attack, you spend a bonus action to attack another creature you choose that is within 5 feet away from the first target."
               }
            }
         },
         "ConsistentInnovations": {
            "Label": "Consistent Innovations",
            "Description": {
               "1": {
                  "Value": "You have advantage to any tool check to maintain an innovated device, and the maximum duration increases from 5 minutes to 1 hour. You lessen the malfunction rate of innovated devices by 2 points (to a base increase of only 2 points)."
               }
            }
         },
         "CoolnessUnderFire": {
            "Label": "Coolness under Fire",
            "Description": {
               "1": {
                  "Value": "You may spend 4 Crafting Points to take 10 on any attack roll with an engineered device or ability check with Engineer‘s Tools."
               }
            }
         },
         "CornerBlastStrike": {
            "Label": "Corner Blast Strike",
            "Description": {
               "1": {
                  "Value": "Whenever you use an explosive, you may center it against one creature in the area of effect, dealing two additional dice of damage. This is a strike effect that can target only one creature within the blast. If the explosive already affects only a single creature (either by design or by fact), this is applied automatically without using a bonus action."
               },
               "2": {
                  "Value": "You also gain the mortar, rocket launcher, cluster launcher and mine launcher blueprints for no cost, and they consume half the normal fuel."
               }
            }
         },
         "CorruptingTouch": {
            "Label": "Corrupting Touch",
            "Description": {
               "1": {
                  "Value": "Your cursed touch can cause unholy wounds. As an action, you may perform a corrupting touch on a target, investing them with damaging energies. For every mana point you spend for Corrupting Touch, you heal a number of hit points equal to your proficiency bonus if targeting an undead or fiend. Amount you heal is instead treated as shadow damage for living creatures (in which case, this requires a melee spell attack). Excess hit points are lost, and you cannot heal or deal more damage than a value equal to your maximum hit points. When performing Corrupting Touch on yourself, this is instead a bonus action, and you are always healed by this ability, regardless of your creature type."
               },
               "2": {
                  "Value": "Alternatively, you can expend the mana to inflict one disease or one poison of your choice. Each disease or poison requires spending mana points equal to one-quarter the saving throw DC of the poison or disease. You may inflict multiple diseases or poisons this way. You can choose be a carrier to up to three separate poisons or diseases on your person. You need previous exposure to a poison or disease to be a carrier."
               },
               "3": {
                  "Value": "This feature has no effect on constructs."
               }
            }
         },
         "CursedCarrier": {
            "Label": "Cursed Carrier",
            "Description": {
               "1": {
                  "Value": "You can carry diseases in your body, and spread them by touch (if contact), scratch (if injury), breath (if inhaled), or spit (if ingested). You can carry up to three diseases of your choice with this ability, above the normal three added by Corrupting Touch."
               }
            }
         },
         "DarkPath": {
            "Label": "Dark Path",
            "Description": {
               "1": {
                  "Value": "You walk a path that defines you as a death knight forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose the Path of Blood for vengeance, Path of Frost for cold disregard for life, or Path of the Unholy to defy the heavens, all detailed at the end of the class description."
               },
               "2": {
                  "Value": "Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include path spells and the Channel Divinity feature."
               },
               "3": {
                  "Title": "Path Spells",
                  "Value": "Each path has a list of associated spells. You gain access to these spells at the levels specified in the path description. Once you gain access to a path spell, you always have it prepared. Path spells don‘t count against the number of spells you can prepare each day."
               },
               "4": {
                  "Value": "If you gain a path spell that doesn‘t appear on the death knight spell list, the spell is nonetheless a death knight spell for you."
               },
               "5": {
                  "Title": "Channel Divinity",
                  "Value": "Your path allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your path explains how to use it. When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again. Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your death knight spell save DC."
               },
               "6": {
                  "Value": "By default, you may always Turn Good, and gain an additional choice from your Path."
               },
               "7": {
                  "Title": "Channel Divinity: Turn Good",
                  "Value": "As an action, you present your unholy symbol and speak a prayer censuring humanoids, celestials, and beasts, using your Channel Divinity. Each humanoid, celestial or beast that can see or hear you within 30 feet of you must make a Spirit saving throw."
               },
               "8": {
                  "Value": "If the creature fails its saving throw, it is turned for 1 minute or until it takes damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can‘t willingly move to a space within 30 feet of you. It also can‘t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there‘s nowhere to move, the creature can use the Dodge action."
               }
            }
         },
         "DieByTheSword": {
            "Label": "Die by the Sword",
            "Description": {
               "1": {
                  "Value": "You are inspired by battlefield glories, and are able to react quickly to attacks. Whenever a target within 5 feet of you makes a successful attack against you, you gain a d6 Counterattack dice. You may spend the dice to make an attack as a reaction at any point out of your turn so long as the target dealt damage to you in the last minute, and may add the counterattack dice result to the total damage. Unlike with normal reactions, you may apply one strike effect to this attack. You can hold up to 3 Counterattack dice. They all fade within one minute if not consumed."
               }
            }
         },
         "DispellingTouch": {
            "Label": "Dispelling Touch",
            "Description": {
               "1": {
                  "Value": "You can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
               }
            }
         },
         "DivineSense": {
            "Label": "Divine Sense",
            "Description": {
               "1": {
                  "Value": "The presence of strong evil registers on your senses like a soothing darkness, gifting peaceful oblivion of death and whispers of powerful forces, and powerful good brings painful brightness, shattered memories, and the creeping return of life."
               },
               "2": {
                  "Value": "As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover."
               },
               "3": {
                  "Value": "You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the lich Kel‘Thuzad, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
               }
            }
         },
         "EfficientAlchemy": {
            "Label": "Efficient Alchemy",
            "Description": {
               "1": {
                  "Value": "Your ability to whip up potions increases your efficiency in creating normal potions. You reduce the base crafting cost for potions from one-half to one-quarter buying price. This does not affect the costs of material components for spells nor does it affect the crafting costs for your Inurement ability. Normally crafting a potion is also one step of complexity faster. This does not also reduce the cost of spell material components."
               },
               "2": {
                  "Value": "Starting at 13th level, this ability also halves the cost of spell material components."
               }
            }
         },
         "EfficientEngineering": {
            "Label": "Efficient Engineering",
            "Description": {
               "1": {
                  "Value": "Your ability to whip up devices increases your efficiency in creating normal devices. You reduce the base crafting cost for technological devices from one-half to one-quarter buying price. This does not affect the costs of material components for spells nor does it affect the crafting costs for your Innovation ability. Normally crafting a device is also one step of complexity faster. This does not also reduce the cost of spell material components."
               },
               "2": {
                  "Value": "Starting at 15th level, this ability also halves the cost of spell material components for your gadget devices."
               }
            }
         },
         "EmpoweredPhysique": {
            "Label": "Empowered Physique",
            "Description": {
               "1": {
                  "Value": "You do not automatically incur miscibility when using potions within 1 hour of one another. You may benefit from a number of potions at a given time equal to 1 + your Stamina modifier (minimum 1) without risking miscibility."
               },
               "2": {
                  "Value": "You may, when drinking a new potion, choose to cause it to interact with another potion you already drank, provoking miscibility."
               }
            }
         },
         "Engineering": {
            "Label": "Engineering",
            "Description": {
               "1": {
                  "Value": "You are a master of engineering in the making."
               },
               "2": {
                  "Value": "You gain an engineer‘s notebook and can perform marvels with the skill that few can even imagine."
               },
               "3": {
                  "Title": "Notebook",
                  "Value": "At 1st level, your notebook contains four blueprints of your choice that detail the specifications of any device you can create. When you level up, you gain 2 additional blueprints of your choice. You may also acquire new blueprints by research, tutelage, or from the notebooks and blueprints of tinkers who have devices you can create."
               }
            }
         },
         "EngineeringMastery": {
            "Label": "Engineering Mastery",
            "Description": {
               "1": {
                  "Value": "You may identify the weaknesses and command triggers for any device you see. You gain the ability to deduce the operation and design of any device you operate or have one hour to study, and have a 20% chance to recreate it from memory. You can also spend a reaction if hit by a weapon attack made from a construct, trap, or engineered device (except firearms and crossbows) to halve the amount of damage you take from it. This does not stack with the bonus from your Evasion ability."
               }
            }
         },
         "Evasion": {
            "Label": "Evasion",
            "Description": {
               "1": {
                  "Value": "You can nimbly dodge out of the way of certain area effects, such as a red dragon‘s fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make an Agility saving throw to take only half damage, you instead take no damage if you succeed  on the saving throw, and only half damage if you fail. You regain 2 Crafting Points if you suffer no damage from a successful saving throw. If you make a saving throw versus an effect made by you, you can either take half damage automatically or make a saving throw. If you choose to make a saving throw, you take no damage on a successful save, but take normal (full) damage on a failed save. After gaining 2 Crafting Points, you cannot gain more unless you complete a short rest."
               }
            }
         },
         "ExpertChemist": {
            "Label": "Expert Chemist",
            "Description": {
               "1": {
                  "Value": "Whenever you deliver a poison, disease, or potion, you the DC, damage, or duration of the effect increases by 2 points or two rounds (if possible)."
               }
            }
         },
         "ExplosiveMastery": {
            "Label": "Explosive Mastery",
            "Description": {
               "1": {
                  "Value": "You increase the range of your bombs and rockets by 15 feet, and the range of your mine‘s detection to its blast radius (beyond its actual position). Also, any explosive you use is automatically modified by the Careful Explosion modification, with no cost to the modification. If you roll a careen on mishap with an explosive, you may roll twice and choose the second result (even if it‘s worse)."
               }
            }
         },
         "ExplosiveResistance": {
            "Label": "Explosive Resistance",
            "Description": {
               "1": {
                  "Value": "You gain resistance to concussive, thunder, and bludgeoning damage."
               },
               "2": {
                  "Value": "Also, whenever you are in the area of concussive damage or the blast radius of an explosion, you can ‘ride the blast‘ and move up to one-half your speed away from the center of the blast, even if you otherwise took no damage from it (such as by using the Evasion ability). This can propel you upward if the explosion takes place under you. This distance is added to the distance the explosion already moves you (if possible)."
               }
            }
         },
         "ExtensiveDesigning": {
            "Label": "Extensive Designing",
            "Description": {
               "1": {
                  "Value": "Whenever you apply the Quick Use modification to your devices (as described under Quick Cooldown above), you reduce it by a further step.<ul><li>Gadgets that replicate spell levels above 3rd level have their cooldown reduced to 1 minute instead of 1 hour.</li><li>Gadgets that replicate spell levels above 6th level have their cooldown reduced to 1 hour instead of 8 hours.</li></ul> You may also add your proficiency bonus to attack rolls with your constructs."
               }
            }
         },
         "ExtraAttack": {
            "Label": "Extra Attack",
            "Description": {
               "1": {
                  "Value": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
               }
            }
         },
         "ExtraAttackWarrior": {
            "Label": "Extra Attack",
            "Description": {
               "1": {
                  "Value": "You can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
               }
            }
         },
         "FalseIdentity": {
            "Label": "False Identity",
            "Description": {
               "1": {
                  "Value": "You have created a second identity that includes documentation, established acquaintances, and disguises that allow you to assume that persona. Additionally, you can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy."
               }
            }
         },
         "FavoredCreations": {
            "Label": "Favored Creations",
            "Description": {
               "1": {
                  "Value": "You gain increased proficiency in innovation. Choose up to four devices. These devices have half the Crafting Point cost, and their formulae are memorized. You may change a single favored creation with one week of downtime."
               }
            }
         },
         "FavoredPotions": {
            "Label": "Favored Potions",
            "Description": {
               "1": {
                  "Value": "You gain increased proficiency in inuring potions. Choose up to four potions. These potions have half the Crafting Point cost, and their formulae are memorized. Furthermore, whenever you roll for miscibility with one of these potions, you can roll twice and take the better result."
               },
               "2": {
                  "Value": "You may change a single favored potion with one week of downtime."
               }
            }
         },
         "FavoriteSchemes": {
            "Label": "Favorite Schemes",
            "Description": {
               "1": {
                  "Value": "Every charlatan has an angle they use in preference to other schemes. Choose a favorite scam or roll on the table below."
               },
               "2": {
                  "Options": {
                     "1" : "I cheat at games of chance.",
                     "2" : "I shave coins or forge documents.",
                     "3" : "I insinuate myself into people's lives to prey on their weakness and secure their fortunes.",
                     "4" : "I put on new identities like clothes.",
                     "5" : "I run sleight-of-hand cons on street corners.",
                     "6" : "I convince people that worthless junk is worth their hard-earned money."
                  }
               }
            }
         },
         "FightingStyle": {
            "Label": "Fighting Style",
            "Description": {
               "1": {
                  "Value": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can‘t take a Fighting Style option more than once, even if you later get to choose again."
               },
               "2": {
                  "Title": "Archery",
                  "Value": "You gain a +2 bonus to attack rolls you make with ranged weapons."
               },
               "3": {
                  "Title": "Defense",
                  "Value": "While you are wearing armor, you gain a +1 bonus to AC."
               },
               "4": {
                  "Title": "Dueling",
                  "Value": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
               },
               "5": {
                  "Title": "Great Weapon Fighting",
                  "Value": "When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit."
               },
               "6": {
                  "Title": "Protection",
                  "Value": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
               },
               "7": {
                  "Title": "Two-Weapon Fighting",
                  "Value": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
               }
            }
         },
         "FightingStyleDeathKnight": {
            "Label": "Fighting Style",
            "Description": {
               "1": {
                  "Value": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can‘t take a Fighting Style option more than once, even if you later get to choose again."
               },
               "2": {
                  "Title": "Defense",
                  "Value": "While you are wearing armor, you gain a +1 bonus to AC."
               },
               "3": {
                  "Title": "Dueling",
                  "Value": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
               },
               "4": {
                  "Title": "Great Weapon Fighting",
                  "Value": "When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit."
               },
               "5": {
                  "Title": "Two-Weapon Fighting",
                  "Value": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
               }
            }
         },
         "FirearmImprovement": {
            "Label": "Firearm Improvement",
            "Description": {
               "1": {
                  "Value": "Firearms you create always benefit from one free modification (equivalent to 1 EP point), chosen from any modification that applies to firearms. Also, whenever you apply an add-on to your firearms and suffer a malfunction, you can choose to let only the add-on suffer the condition."
               }
            }
         },
         "FirstBlood": {
            "Label": "First Blood",
            "Description": {
               "1": {
                  "Value": "You gain a +2 bonus to your attack rolls and can add your Strength modifier to your damage rolls so long as you are targeting a creature that is above half their maximum hit points (or is not Bloodied). This is applied even if you normally add your Agility modifier to damage."
               }
            }
         },
         "FlashBomberTinker": {
            "Label": "Flash Bomber (Tinker)",
            "Description": {
               "1": {
                  "Value": "You gain the Flash Bomber talent, but may only use it for explosives."
               }
            }
         },
         "FortifyingChemistry": {
            "Label": "Fortifying Chemistry",
            "Description": {
               "1": {
                  "Value": "You may enhance any potion you handle for at least 1 minute to grant the imbiber temporary hit points equal to your alchemist level. These hit points remain for 1 hour, and can stack, but cannot exceed double the target‘s maximum hit points."
               }
            }
         },
         "FrostPresence": {
            "Label": "Frost Presence",
            "Description": {
               "1": {
                  "Value": "Whenever you deal cold damage through a death knight spell or ability, you deal extra cold damage equal to your proficiency bonus, applying once per round. You also gain resistance to cold damage."
               }
            }
         },
         "FrozenSoul": {
            "Label": "Frozen Soul",
            "Description": {
               "1": {
                  "Value": "Whenever you reduce a creature to 0 hit points from a cold spell, or if they under the effects of your Freeze channel divinity, your next Runic Strike within 1 hour has no mana cost. You may also choose to deal half of your Runic Strike‘s extra damage as cold damage. If you choose to do so, you may add half the bonus to damage from your Frost Presence ability. If you are under the effects of the avatar form death knight spell, your next two Runic Strikes within 1 hour have no mana cost."
               }
            }
         },
         "GraveMarch": {
            "Label": "Grave March",
            "Description": {
               "1": {
                  "Value": "Your auras increase in strength. You may maintain two aura spells at once as if they were one spell. Furthermore, your allies can also benefit from two auras at a time, so long as one of these spells is the Unholy Aura spell. The maximum duration of your unholy aura spell is 4 hours instead of 1."
               },
               "2": {
                  "Value": "Also, whenever in a forced march, all creatures under your unholy aura spell have advantage to saving throws to continue a march without suffering exhaustion, and can move at a fast pace without incurring a penalty to their Passive Spirit (Perception) score."
               }
            }
         },
         "GreaterAugmentation": {
            "Label": "Greater Augmentation",
            "Description": {
               "1": {
                  "Value": "You can augment up to three potions at any given time. You can also apply the following additional augmentations:"
               },
               "2": {
                  "Options": {
                     "1": "Your potion also has the effects of a dispel magic or mana burn spell, with the spell level two spell levels lower than the potion‘s original spell level (minimum 1). If the potion has no replicated spell level, the effective level is instead equal to the lowest spell level the spell can be cast.",
                     "2": "Your potion also has the benefits of one of the following spells: protection from poison, protection from energy, or remove curse.",
                     "3": "Your potion allows the target to add their proficiency bonus to one saving throw of their choice. They cannot apply this to a saving throw in which they are already proficient. This remains up to 1 hour.",
                     "4": "Your potion has a 25% chance to enhance the imbiber with increased lifeforce. If the target is reduced to 0 hit points or dies within 4 hours of imbibing the potion, they are affected with the revivify spell. The potion must replicate a spell level of 6 or higher to gain this augmentation."
                  }
               }
            }
         },
         "GreaterFlashBomber": {
            "Label": "Greater Flash Bomber",
            "Description": {
               "1": {
                  "Value": "You double the amount of times you may use the Flash Bomber talent before a rest, and can use any explosive (not just in bomb form). You also gain the remote blueprint for free if you didn‘t already have it, and may employ it to trigger any number of your explosives normally, and can use it with a reaction."
               }
            }
         },
         "GreaterInternalClock": {
            "Label": "Greater Internal Clock",
            "Description": {
               "1": {
                  "Value": "You treat your proficiency bonus as if 2 points higher for the purposes of how many potions you can have active under your Internal Clock ability. Also, if your Internal Clock ability would activate, you may choose to withhold benefitting from it up to 1 minute. If you do not declare a use of the ability (reaction if not in your turn, bonus action if it is) it fades at the end of the duration."
               }
            }
         },
         "GreaterMutate": {
            "Label": "Greater Mutate",
            "Description": {
               "1": {
                  "Value": "You treat any mutate spell you benefit from as if it were heightened one level for no cost, allowing certain mutations to become stronger. You always have the mutate spell memorized."
               },
               "2": {
                  "Value": "Furthermore, while under the effects of the spell, you gain a +2 bonus to damage rolls. This bonus also applies to any homunculus you have."
               },
               "3": {
                  "Value": "Lastly, you also gain proficiency in Strength saving throws."
               }
            }
         },
         "Hellscream": {
            "Label": "Hellscream",
            "Description": {
               "1": {
                  "Value": "All hostile creatures within range of your shouts take Thunder damage equal to half your level whenever you shout or maintain one. They are entitled a Stamina saving throw to half damage contested by your own Stamina saving throw."
               },
               "2": {
                  "Value": "Also, your critical range for your Strike the Wound ability becomes 15-20."
               }
            }
         },
         "ImprovedRunicStrike": {
            "Label": "Improved Runic Strike",
            "Description": {
               "1": {
                  "Value": "You are so suffused with the might of the Lich King that all your melee weapon strikes carry his unholy power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 shadow damage. If you also use your Runic Strike with an attack, you add this damage to the extra damage of your Runic Strike."
               }
            }
         },
         "Innovation": {
            "Label": "Innovation",
            "Description": {
               "1": {
                  "Value": "You gain the ability to craft temporary and unstable technological creations at certain levels. Such creations have limitations compared to normal crafting (as described in Chapter 7), but are more accessible and useable in combat. You also need the required tools at hand (Engineer's Tools)."
               },
               "2": {
                  "Value": "Creating temporary technological device costs an Action if a Consumable, 3 turns if a use-item (such as a firearm), or 1 minute if a Creature (such as turret or combat armor)."
               },
               "3": {
                  "Value": "1) You reduce the crafting point cost by your proficiency bonus. You may reduce the point cost by your proficiency bonus (not applied above). Common items can have their point cost reduced to 0."
               },
               "4": {
                  "Value": "2) The crafting cost is unaffected by the Efficient Alchemy feature. Unlike normal crafting, the base crafting cost in materials is not modified for crafting class (x25 for Creatures), and thus innovating a Consumable costs the same as a Creature."
               },
               "5": {
                  "Value": "3) Starting at 5th level, your Common-level temporary creations do not consume crafting materials, but still require access to your tools (Engineer's Tools)."
               },
               "6": {
                  "Title": "Crafting Point Cost",
                  "Value": "Your ability to do such rapid and innovative creations strains your mind and creative capabilities. You are afforded a pool of Crafting Points (which act as Mana Points). Similarly to Mana Points, you spend points to spontaneously craft items, and regain such points by resting. This is subject to the following points of difference, however:"
               },
               "7": {
                  "Options": {
                     "1": "You have a number of Crafting Points equal to your Intelligence score (not modifier) plus your proficiency bonus plus one-half your Tinker level (round down). Unlike mana points, your pool is unaffected by the spell level you can access. As this power is not magical in nature, you are unaffected by any anti-magic effects such as an antimagic field or mana burn effects.",
                     "2": "You do not regain points by mana-restorative effects, such as Mana Potions or resting near mana fountains. However, so long as you are in a relevant resource node or crafting area (such as an engineering workshop or your stronghold), you regain points with a +50% increase, as you draw inspiration from them.",
                     "3": "Your creation costs scale by the item‘s rarity and your ability to craft them; and are thus limited by the Rarity column in your class chart. You can craft anything you have memorized or if you refer to the formula of in your possession (such as in your formulae book). "
                  }
               },
               "8": {
                  "Value": "A temporary creation that breaks down, fails, or expires can be harvested for one-half the crafting materials invested. This does not apply to Consumables that were successfully used.  Your temporary creations can be made permanent by paying the rest of the crafting cost."
               },
               "9": {
                  "Title": "Material Cost",
                  "Value": "As well as consuming Crafting Points, temporary creations also cost material costs appropriate to their rarity, as detailed above."
               },
               "10": {
                  "Title": "Temporary Item Duration",
                  "Value": "Once created, the temporary item remains until used (if a Consumable), until it breaks down (if a Use-Item or Creature), or up to 5 minutes. Temporary creations are not stable, and if the item is not a consumable in nature, you must succeed on a tool check (Engineer's Tools) against a DC of 15 after a successful use (if a Use-Item), 1 minute (if a Creature), or the creation breaks down.  If the item is not being used by you (or a creature bound to you), it has a +4 increase to its malfunction rate. You may maintain multiple temporary creations, but they all begin expiring starting from the round they were crafted."
               },
               "11": {
                  "Title": "At Higher Levels",
                  "Value": "As you increase in levels, creations of certain rarity require less time and effort. The time it takes for you to innovate or craft temporary versions of your creations is reduced to a Bonus Action or 3 turns at the following levels for each rarity."
               }
            }
         },
         "InternalClock": {
            "Label": "InternalClock",
            "Description": {
               "1": {
                  "Value": "Whenever you make a potion and consume it, you can choose to keep its effects latent until a condition you specify. When said condition comes to pass, the potion activates as if you just consumed it, and costs you a reaction. You can have a number of potions stored this way equal to your proficiency bonus. If the potion has a casting time of more than 1 Action, it must remain latent for a minimum duration equal to the casting time first. These potions do not incur miscibility, even if consumed at the same time."
               },
               "2": {
                  "Value": "Starting at 18th level, activating a potion on your internal clock costs no reaction."
               }
            }
         },
         "Inurement": {
            "Label": "Inurement",
            "Description": {
               "1": {
                  "Value": "You also gain the ability to craft temporary and unstable alchemical creations at certain levels. Such creations have limitations compared to normal crafting (as described in Chapter 7), but are more accessible and useable in combat. You also need the required tools at hand (Alchemist‘s Supplies). Creating temporary alchemical creations costs an Action if a Consumable, or 1 minute if a Creature (such as an alchemical homunculus or an Ooze)."
               },
               "2": {
                  "Value": "1) You reduce the crafting point cost by your proficiency bonus. You may reduce the point cost by your proficiency bonus (not applied above). Common items can have their point cost reduced to 0."
               },
               "3": {
                  "Value": "2) The crafting cost is unaffected by the Efficient Alchemy feature. Unlike normal crafting, the base crafting cost in materials is not modified for crafting class (x25 for Creatures), and thus innovating a Consumable costs the same as a Creature."
               },
               "4": {
                  "Value": "3) Starting at 5th level, your Common-level temporary creations do not consume crafting materials, but still require access to your tools (Alchemist‘s Supplies)."
               },
               "5": {
                  "Title": "Crafting Point Cost",
                  "Value": "Your ability to do such rapid and innovative creations strains your mind and creative capabilities. You are afforded a pool of Crafting Points (which act as Mana Points). Similarly to Mana Points, you spend points to spontaneously craft items and regain such points by resting. This is subject to the following points of difference, however:"
               },
               "6": {
                  "Options": {
                     "1": "You have a number of Crafting Points equal to your Intelligence score (not modifier) plus your proficiency bonus plus one-half your Alchemist level (round down). Unlike mana points, your pool is unaffected by the spell level you can access. As this power is not magical in nature, you are unaffected by any anti-magic effects such as an antimagic field or mana burn effects.",
                     "2": "You do not regain points by mana-restorative effects, such as Mana Potions or resting near mana fountains. However, so long as you are in a relevant resource node or crafting area (such as an alchemical grove or your stronghold), you regain points with a +50% increase, as you draw inspiration from them.",
                     "3": "Your creation costs scale by the item‘s rarity and your ability to craft them; and are thus limited by the Rarity column in your class chart. You can craft anything you have memorized or if you refer to the formula of in your possession (such as in your formulae book)."
                  }
               },
               "7": {
                  "Value": "A temporary creation that breaks down, fails, or expires can be harvested for one-half of the crafting materials invested. This does not apply to Consumables that were successfully used. Your temporary creations can be made permanent by paying the rest of the crafting cost."
               },
               "8": {
                  "Title": "Material Cost",
                  "Value": "As well as consuming Crafting Points, temporary creations also cost material costs appropriate to their rarity, as detailed above."
               },
               "9": {
                  "Title": "Temporary Item Duration",
                  "Value": "Once created, the temporary item remains until used (if a Consumable), until it breaks down (if a Creature), or up to 5 minutes. Temporary creations are not stable, and if the item is not a consumable in nature, you must succeed on a tool check (Alchemist‘s Supplies) against a DC of 15 after 1 minute (if a Creature), or the creation breaks down. If the item is not being used by you (or a creature bound to you), it has a 50% failure rate. You may maintain multiple temporary creations, but they all begin expiring starting from the round they were crafted."
               },
               "10": {
                  "Title": "At Higher Levels",
                  "Value": "As you increase in levels, creations of certain rarity require less time and effort. The time it takes for you to inure or craft temporary versions of your creations is reduced to a Bonus Action or 3 turns at the following levels for each rarity."
               }
            }
         },
         "KnackForIt": {
            "Label": "Knack for It",
            "Description": {
               "1": {
                  "Value": "You can use your bonus action to make an Agility (Sleight of Hand) check or use your Thieves‘ Tools to disarm a trap or open a lock."
               },
               "2": {
                  "Value": "Furthermore, you can choose to lower the malfunction rating of all devices you create by 2 points (minimum 1)."
               }
            }
         },
         "LifeStealer": {
            "Label": "Life Stealer",
            "Description": {
               "1": {
                  "Value": "Whenever you are dropped to 0 hit points, you may use your death pact spell on any dying creature as well as undead and fiends as a reaction."
               },
               "2": {
                  "Value": "You may also instead tear the life from living targets within 30 ft. as a reaction, stealing a number of hit points equal to ¼ their current hit points, and restoring your hit points by the same amount. The target may resist with Stamina saving throw against your Spell Save DC. This may be used once per Charisma modifier (minimum 1) before requiring a long rest."
               }
            }
         },
         "MasterOfArms": {
            "Label": "Master of Arms",
            "Description": {
               "1": {
                  "Value": "When you use a strike effect, you can apply it to all your attacks until the start of your turn in the next round, so long as the strike has sufficient uses."
               }
            }
         },
         "MedicalExpert": {
            "Label": "Medical Expert",
            "Description": {
               "1": {
                  "Value": "You gain proficiency with an Herbalism Kit and the Spirit (Medicine) skill, if you didn‘t already have proficiency. Furthermore, whenever you expend a use of a Healer‘s Kit as an action to treat a creature, the target can expend one hit dice. A creature can benefit from this ability once per short rest."
               },
               "2": {
                  "Value": "Whenever you expend a use of a Healer‘s Kit, you can roll a DC 20 Intelligence check with Alchemist Supplies. If you succeed, you do not expend a single use of the kit."
               }
            }
         },
         "Mettle": {
            "Label": "Mettle",
            "Description": {
               "1": {
                  "Value": "Your exposure and experimentations in alchemy left your body more resilient to certain effects, such as a rogue‘s poison gas or a stinking cloud spell. When you are subjected to an effect that allows you to make a Stamina saving throw to take only half damage or a reduced effect, you instead take no damage or effect if you succeed on the saving throw, and only half damage (or the reduced effect) if you fail."
               },
               "2": {
                  "Value": "For example, a clay golem‘s reduction to maximum hit points is negated on a successful saving throw, and you take half the effect if you fail."
               }
            }
         },
         "MightOfTheWastes": {
            "Label": "Might of the Wastes",
            "Description": {
               "1": {
                  "Value": "Your frost-sharpened weapons deals a critical hit on a roll of 19 or 20 as a strike effect. You also deal an additional 1d4 points of cold damage whenever you strike an enemy with this. You may also add the extra damage from your Frost Presence ability to this. Despite being a strike effect, you can make an off-hand attack with a Bonus Action and still maintain this strike effect."
               }
            }
         },
         "MortalStrike": {
            "Label": "Mortal Strike",
            "Description": {
               "1": {
                  "Value": "You may severely wound a creature‘s healing capabilities if you successfully apply a mortal strike. If a creature is affected by a Mortal Strike, they must succeed on a Stamina saving throw against a DC equal to 8 + your proficiency bonus + your Strength bonus or take 50% less healing from all sources for one minute. So long as a creature is affected this way, it is always treated as if it is Bloodied for the purposes of your First Blood feature. A creature cannot be affected by this ability more than once in 24 hours."
               }
            }
         },
         "MutatePotion": {
            "Label": "Mutate Potion",
            "Description": {
               "1": {
                  "Value": "You can spend 4 Crafting Points to change any potion you have into the rejuvenation spell of the same spell level (up to the maximum spell level of the spell you can access). You memorize the rejuvenation spell."
               }
            }
         },
         "NecromanticMastery": {
            "Label": "Necromantic Mastery",
            "Description": {
               "1": {
                  "Value": "You add all spells of the Necromancy school from the Mage spell list to the Alchemist spell list, and can make potions out of them."
               }
            }
         },
         "Overpower": {
            "Label": "Overpower",
            "Description": {
               "1": {
                  "Value": "You may, after successfully damaging an enemy with a melee attack, regain hit points equal to double your Proficiency bonus. You may instead grant half the benefit to any ally within 30 feet. This is a strike effect that costs a bonus action. The enemy must be a qualifying threat to you for you to use this ability. If the target of this strike was also successfully affected by your Mortal Strike feature, you gain double the normal amount of hit points."
               }
            }
         },
         "Patent": {
            "Label": "Patent",
            "Description": {
               "1": {
                  "Value": "You gain increased mastery over a single engineered device of your creation that is not a consumable. Your Patented device does not malfunction when being used."
               },
               "2": {
                  "Value": "Furthermore, if a construct or gadget, it takes one-quarter the fuel as normally required for a single use. This stacks with the reduction for certain devices (such as strike effect gadgets)."
               },
               "3": {
                  "Value": "The device may malfunction condition from other circumstances or abilities. This bonus only applies to your Patent device, and does not extend to Innovated devices (even if they are of your Patented device)."
               }
            }
         },
         "PillarOfFrost": {
            "Label": "Pillar of Frost",
            "Description": {
               "1": {
                  "Value": "Supernatural ice hangs heavy on your body. This increases your strength score by 4 to a max of 24 and your Stamina by 2 to a max of 22."
               }
            }
         },
         "PlagueZombies": {
            "Label": "Plague Zombies",
            "Description": {
               "1": {
                  "Value": "You learn to imbue any undead creature you create or control by your potions with any one poison or disease you have. You may imbue any corporeal undead with up to three dosages of a poison or disease, and allowing the creature to act as a carrier. It can then apply the poison, depending on the poison‘s vector, as below:"
               },
               "2": {
                  "Options": {
                     "1": "A dose of an inhaled poison or disease can be exhaled as an action, affecting creatures within 5 feet (plus 5 feet per size category above Medium).",
                     "2": "A dose of a contact poison or disease can be delivered with a successful melee weapon attack that inflicts the disease. The attacker cannot add their ability modifier to damage for this attack.",
                     "3": "A dose of an ingested poison or disease can be projected onto edible food or drink as an action.",
                     "4": "A dose of an injury poison or disease can be delivered with a successful attack; one dose is delivered with each successful attack."
                  }
               },
               "3": {
                  "Value": "If you also chose the Mithridatism Weird Science feature, you can choose for some of your creations to host your doses instead of you."
               }
            }
         },
         "PracticedPrecision": {
            "Label": "Practiced Precision",
            "Description": {
               "1": {
                  "Value": "You do not take disadvantage to your ranged attack roll while being within 5 feet of a hostile creature, even if you don‘t attack them in melee first. You also gain the Sharpshooter feat for free. If you already had it, you gain the Archery fighting style (applicable to firearms only)."
               }
            }
         },
         "PrecisionGuesswork": {
            "Label": "Precision Guesswork",
            "Description": {
               "1": {
                  "Value": "You spend half the required Crafting Points for the Coolness under Fire, Works as Intended, and Shutdown abilities."
               }
            }
         },
         "ProtectiveShell": {
            "Label": "Protective Shell",
            "Description": {
               "1": {
                  "Value": "All your constructs always benefit from the Coated Interior and Efficient Fuel modifications (for a total fuel reduction of 1/8 the normal cost for constructs). You may also double the Construct‘s Challenge Rating to its maximum hit points."
               },
               "2": {
                  "Value": "Also, whenever you activate a gadget that requires a harness or concentration, you gain temporary hit points equal to 1d10 + your Tinker level, which remain until the gadget stops operating. This does not stack with the benefit of the Coated Interior modification."
               }
            }
         },
         "QuickCooldown": {
            "Label": "Quick Cooldown",
            "Description": {
               "1": {
                  "Value": "Your gadgets and constructs always benefit from the Quick Use and Quick Startup modifications, respectively. This has no cost."
               }
            }
         },
         "QuickReload": {
            "Label": "Quick Reload",
            "Description": {
               "1": {
                  "Value": "You may use a bonus action to reload a firearm instead of an action. If you perform the Touch-Blast Strike special attack or attack with your firearm as a melee attack, you can also reload as part of the action, and you may add your proficiency bonus to attacks with firearms without bayonets. If you use a bayonet, you deal 2 extra points of damage with melee attacks with them."
               }
            }
         },
         "QuickTech": {
            "Label": "Quick Tech",
            "Description": {
               "1": {
                  "Value": "You may use your innovate ability on a device of equal rarity, and permanently alter the properties of the device. This device does not have to be built by you, nor does it have to be temporarily-created. This costs the same number of Crafting Points as well as the same time."
               }
            }
         },
         "RepairFlesh": {
            "Label": "Repair Flesh",
            "Description": {
               "1": {
                  "Value": "Your alchemist spells and potions that heal the living on your spell list can heal undead and constructs (such as rejuvenation and heal). A given creature must be studied for at least one hour before you may adapt your alchemy to heal them, however. For instance, studying a forsaken for one hour allows you to heal all forsaken with the holy light spell if manifested as an alchemist spell (or potion)."
               }
            }
         },
         "RestoredStrength": {
            "Label": "Restored Strength",
            "Description": {
               "1": {
                  "Value": "You may use the Second Wind talent three times before requiring rest. Furthermore, whenever you use Second Wind, you gain resistance to any damage you take for one round after use, and advantage against any saving throw made against the first spell that affects you in the next minute."
               },
               "2": {
                  "Value": "If you don‘t already have the Second Wind talent, you gain it as a talent instead of improving it."
               }
            }
         },
         "RunicStrike": {
            "Label": "Runic Strike",
            "Description": {
               "1": {
                  "Value": "When you hit a creature with a melee weapon attack, you can expend mana equal to one death knight spell to deal shadow damage to the target, in addition to the weapon‘s damage."
               },
               "2": {
                  "Value": "The extra damage is 2d8 for a 1st-level spell, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is a celestial or a follower of the Holy Light (or if not a follower, one who merely uses it)."
               },
               "3": {
                  "Value": "If you have a rune active, you may also perform a Runic Strike without expending mana (called Runic Release), terminating the effects of the rune (plus an additional effect depending on the seal). Despite the name, Runic Strike does not count as a Strike effect."
               }
            }
         },
         "Scavenge": {
            "Label": "Scavenge",
            "Description": {
               "1": {
                  "Value": "When you gather raw materials for use with engineering, you gain triple the total value. This applies when harvesting existing devices, nodes, creatures, and deconstructing devices. If dismantling an item, this cannot exceed one-half the value of creating the item itself (counting any reductions)."
               }
            }
         },
         "ScavengeAlchemist": {
            "Label": "Scavenge (Alchemist)",
            "Description": {
               "1": {
                  "Value": "When you gather raw materials for use with alchemy, you gain triple the total value. This applies when harvesting existing devices, nodes, creatures, and dismantling potions."
               }
            }
         },
         "SecretsOfAlchemy": {
            "Label": "Secrets Of Alchemy",
            "Description": {
               "1": {
                  "Value": "You learn and memorize how to create a Philosopher‘s Stone and the transmute material spell. You can transmute a mineral once per short rest instead of once per long rest, and you further memorize the alchemical composition of two minerals (as recipes), allowing you to turn one mineral to another. Whenever you would gain an alchemical recipe from leveling up, you may choose a mineral recipe instead."
               }
            }
         },
         "ShelterOfTheFaithful": {
            "Label": "Shelter of the Faithful",
            "Description": {
               "1": {
                  "Value": "As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle."
               },
               "2": {
                  "Value": "You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple."
               }
            }
         },
         "Shutdown": {
            "Label": "Shutdown",
            "Description": {
               "1": {
                  "Value": "You may expend 2 Crafting Points and a bonus action to increase the malfunction rate of any device within 10 feet of you by 5 points for up to 1 hour. You can target your own devices to increase the risk of malfunction and Superfunction (up to a 50% chance for either). If you attempt to apply this feature to another device while it is active, its benefits end for the previous one."
               }
            }
         },
         "SolidEngineering": {
            "Label": "Solid Engineering",
            "Description": {
               "1": {
                  "Value": "Your devices do not lose charges when they are damaged, and all your devices (except bombs and firearms) consume half the normal fuel (this may stack with the Efficient Fuel modification)."
               },
               "2": {
                  "Value": "Also, you memorize the formula for phlogiston, gaining proficiency in Alchemist‘s Supplies if you don‘t already have it."
               }
            }
         },
         "SoulScience": {
            "Label": "Soul Science",
            "Description": {
               "1": {
                  "Value": "Whenever you create or summon undead, homunculi, or constructs via alchemy (as with the conjure spell), you may grant the creature Blindsight against living and undead creatures, as well as constructs and devices that work off an electrical source. The Blindsight only works up to 60 feet, but the creature is not blind beyond that radius."
               }
            }
         },
         "SpecialBullets": {
            "Label": "Special Bullets",
            "Description": {
               "1": {
                  "Value": "You gain the Suffused Arrows talent (gaining proficiency as appropriate), and can create special infused bullets. You also deal 3 extra points of damage with any unmodified bullets."
               }
            }
         },
         "SpellcastingDeathKnight": {
            "Label": "Spellcasting",
            "Description": {
               "1": {
                  "Value": "You have learned to draw on divine magic through meditation and prayer to cast spells as a paladin does."
               },
               "2": {
                  "Title": "Conjuring and Binding",
                  "Value": "A death knight can conjure and bind aberrations, fiends, and undead."
               },
               "3": {
                  "Title": "Preparing and Casting Spells",
                  "Value": "Each death knight level provides you with 0.5 caster levels in the death knight class (minimum 0). You follow the normal progression to unlock spell levels (see the table under the Mana section). You can change your list of prepared spells by consulting your runeblade‘s runes (treat as a spellbook), which takes 1 minute per spell level to alter the readied spell."
               },
               "4": {
                  "Value": "You prepare the list of death knight spells that are available for you to cast, choosing from the death knight spell list."
               },
               "5": {
                  "Value": "You can also change your list of prepared spells when you finish a long rest by training and studying your Runeblade (treat as a spellbook). Preparing a new list of death knight spells requires time spent in prayer and re-attuning to the spell-runes: at least 1 minute per spell level for each spell on your list."
               },
               "6": {
                  "Title": "Spellcasting Ability",
                  "Value": "Charisma is your spellcasting ability for your death knight spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting  ability. In addition, you use your Charisma modifier when setting the saving throw DC for a death knight spell you cast and when making an attack roll with one."
               },
               "7": {
                  "Value": "<strong>Spell save DC</strong> = 8 + your proficiency bonus + your Charisma modifier<br><strong>Spell attack modifier</strong> = your proficiency bonus + your Charisma modifier"
               },
               "8": {
                  "Title": "Spellbook – Runeblade",
                  "Value": "At 2nd level, your runeblade contains three 1st-level death knight spells of your choice. When you level up, you gain 2 additional death knight spells of your choice. You may also acquire new spells by research, tutelage, or from the spellbooks and scrolls of spellcasters who have spells you can cast. Your runeblade is effectively your spellbook, and you may add spells by scribing with runic inks. You can choose to store your death knight spells in a spellbook instead or as runes on any other surface as well."
               },
               "9": {
                  "Title": "Spellcasting Focus",
                  "Value": "You can use an unholy symbol as a spellcasting focus for your death knight spells, or you can treat your runeblade as your focus."
               }
            }
         },
         "StrikeTheWound": {
            "Label": "Strike the Wound",
            "Description": {
               "1": {
                  "Value": "You gain momentary clarity towards causing further wounds after landing the first. If you make a successful melee attack roll against a target, your weapon attack can score a critical hit on a lower result of the dice (on a natural 19 or 20 instead of only 20). This effect stacks to a maximum roll of 17-20, and ends at the start of your turn in the next round."
               },
               "2": {
                  "Value": "Also, you gain the Dual Wielder feat if you didn‘t already have it. If you already have it, you add +1 to your weapon damage rolls with either weapon."
               }
            }
         },
         "SunderingStrike": {
            "Label": "Sundering Strike",
            "Description": {
               "1": {
                  "Value": "You may sunder an enemy‘s armor, reducing their AC by 1 point per strike (up to -5, but never below that of their AC if unarmored). This effect remains until the armor is tended to with the appropriate artisans‘ tools and 1 hour of work."
               },
               "2": {
                  "Value": "This can be applied to natural armor. In this case, the AC is restored upon completing a short rest."
               }
            }
         },
         "Superfunction": {
            "Label": "Superfunction",
            "Description": {
               "1": {
                  "Value": "Your genius allows you to use malfunction rates to your benefit. Whenever you use a device, there is a chance it performs unexpectedly well—thus the greater the malfunction rate, the greater the superfunction rate. A Superfunction can stack with a critical hit (if using a weapon-based engineered device)."
               },
               "2": {
                  "Value": "<i>Superfunction Rate = 20 - Malfunction Rate</i>"
               },
               "3": {
                  "Value": "For instance, an explosive that has a malfunction rate of 2 has a Superfunction rate of 18-20."
               },
               "4": {
                  "Value": "When a device superfunctions, it does not roll for a malfunction for the duration of the effect (see below, affected by energy source). It also gains a bonus depending on its energy source. Choose one benefit the device qualifies for."
               },
               "5": {
                  "Options": {
                     "1": "<i>Better</i>: The next malfunction condition is negated, and the next use of the device consumes no fuel charges (so long as it doesn‘t have only one use)",
                     "2": "<i>Faster</i>: The device gains a 25% increase in movement speed (if a construct or vehicle) for 1 hour",
                     "3": "<i>Harder</i>: The device cannot lose charges by taking damage or suffer any negative effects that would normally cause it to loses charges (such as overcharging) for 1 hour",
                     "4": "<i>Stronger</i>: The device deals maximum damage (no need to roll) with the next (or current) damage roll it makes."
                  }
               },
               "6": {
                  "Value": "<i>Note</i>: Since your Patent device cannot malfunction, it can only Superfunction at a natural 20 use."
               }
            }
         },
         "SuperMutant": {
            "Label": "Super Mutant",
            "Description": {
               "1": {
                  "Value": "Whenever you are under the effects of the mutate spell, you gain 1d6 temporary Hit Points per step of rarity (1d6 Common, 2d6 Uncommon, etc.). These fade at the end of the spell‘s duration."
               },
               "2": {
                  "Value": "Furthermore, you can attack twice, instead of once, whenever you take the Attack action on your turn."
               },
               "3": {
                  "Value": "Lastly, you no longer gain exhaustion from the berserker rage spell, and you do not lose your action when the haste spell ends for you."
               }
            }
         },
         "SynthesizedPotions": {
            "Label": "Synthesized Potions",
            "Description": {
               "1": {
                  "Value": "You can create synthesized potions. A synthesized potion has the benefit of one potion of a specific rarity, and includes the effect of another potion of a rarity two steps below. This does not risk miscibility. For example, the rare-quality Globe of Invulnerability Potion can be synthesized with a Commonquality Healing Potion. This costs the normal cost of the potion plus half the cost of the secondary potion."
               },
               "2": {
                  "Value": "You can possess an indefinite number of synthesized potions, but create only one every 24 hours."
               }
            }
         },
         "TinkerPath": {
            "Label": "Tinker Path",
            "Description": {
               "1": {
                  "Value": "At 3rd level, you choose a path that you emulate in the exercise of your tinker abilities: Bomber who focuses on creating explosives, the Gunner who focuses on creating and shooting with firearms, and Gadgeteer who focuses on creating wondrous gadgets, all detailed at the end of the class description."
               },
               "2": {
                  "Value": "Your path choice grants you features at 3rd level and then again at 6th, 10th, and 14th levels."
               }
            }
         },
         "UnarmoredDefense": {
            "Label": "Unarmored Defense (Optional)",
            "Description": {
               "1": {
                  "Value": "While you are not wearing any armor, your Armor Class equals 10 + your Agility modifier + your Stamina modifier. You can use a shield and still gain this benefit."
               }
            }
         },
         "UndeadCompanion": {
            "Label": "Undead Companion",
            "Description": {
               "1": {
                  "Value": "You gain a bound companion that accompanies you on your adventures and can fight alongside you. The companion must be an undead that is no larger than Medium and that has a challenge rating of 1/2 or lower (for example, a lesser ghoul). See Bound Companion for more details."
               },
               "2": {
                  "Title": "Bond",
                  "Value": "Due to your bond with the creature, you can add your proficiency bonus to the undead‘s AC, attack rolls, and damage rolls, as well as to any saving throws and skills it is proficient in. This does not stack with their own proficiency bonuses. Its hit point maximum equals its normal maximum or four times your death knight level, whichever is higher. The creature benefits from Bolster Undead the same way you do."
               },
               "3": {
                  "Title": "Leveling up",
                  "Value": "Your undead companion improves in CR the higher your level becomes, CR equal to 1 per every 8 levels of Death Knight (improving to 1 CR at level 4, 2 CR at level 8, and 3 CR at level 16). This  either takes the form of choosing a higher-level companion, or adding hit dice to the companion until its CR increases."
               },
               "4": {
                  "Value": "When reaching 8th level, you can choose a Large creature. The companion also gains an Ability Score Improvement once you do (this acts as the normal feature)."
               },
               "5": {
                  "Title": "Special",
                  "Value": "Bonding with an undead requires spending one hour animating it, and the next hour drawing from any superficial memories before its death. You can apply the skeletal or zombie monster template to any creature that qualifies and can be subject to animation by casting the bind spell on them. You may also raise your enemies to serve as undead companions, so long as their CR are within the described guidelines (treat 1 level as 1 CR)."
               }
            }
         },
         "UnholyChampion": {
            "Label": "Unholy Champion",
            "Description": {
               "1": {
                  "Value": "You gain the avatar form death knight spell for no cost if you didn‘t already have it. Furthermore, you augment the spell in the following ways:"
               },
               "2": {
                  "Options": {
                     "1": "You are instantly healed for 3d8 + 10 hit points. The healing increases by 1d8 per spell level above 3rd.",
                     "2": "You become resistant to damage from good aligned targets (or magical weapons) as well as to shadow damage.",
                     "3": "Any undead within any active aura you have regains 2d6 hit points every round. This cannot exceed half their total hit points."
                  }
               }
            }
         },
         "Vanguard": {
            "Label": "Vanguard",
            "Description": {
               "1": {
                  "Value": "Whenever you start your round in a turn with below half your maximum hit points, and have no temporary hit points, you gain a number of temporary hit points equal to 1d12 + your Stamina modifier."
               }
            }
         },
         "Vigilance": {
            "Label": "Vigilance",
            "Description": {
               "1": {
                  "Value": "Starting at 10th level, your block and tackle ability blocks an additional 1d12 (for a total of 2d12 + your Stamina modifier). Whenever you perform an opportunity attack derived from your Block and Tackle ability, you can add one of the following effects. "
               },
               "2": {
                  "Options": {
                     "1": "<i>Destructive Counter</i>: Your opportunity attack deals an additional 2d6 damage.",
                     "2": "<i>Disarming Counter</i>: Your opportunity attack drops the enemy‘s weapon. If they reach for it while threatened by you, you can make another attack of opportunity.",
                     "3": "<i>Pushing Counter</i>: Your opportunity attack pushes the enemy 5 feet away.",
                     "4": "<i>Repositioning Counter</i>: Your opportunity attack allows you to exchange places with an ally within 5 feet of you."
                  }
               }
            }
         },
         "WarriorArchetype": {
            "Label": "Warrior Archetype",
            "Description": {
               "1": {
                  "Value": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose between the Arms Warrior, a champion in using great-weapons, the Fury Warrior, who focuses on bleeding his enemies and debilitating them tactically, or the Protection Warrior who focuses on defense while reflecting physical damage. All are detailed at the end of the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
               }
            }
         },
         "WarriorTalent": {
            "Label": "Warrior Talent",
            "Description": {
               "1": {
                  "Value": "Starting at 1st level, you gain a class talent, representing your preferred tactics and adaptability on the field of battle. See Class Talents at the end of the Chapter 3 for options."
               },
               "2": {
                  "Value": "Whenever you qualify for another talent (as detailed in the talent column), you can choose another talent or gain another use of an existing talent."
               }
            }
         },
         "WeirdScience": {
            "Label": "Weird Science",
            "Description": {
               "1": {
                  "Value": "You may choose a weird science or avenue of natural talent to focus your alchemical powers upon. Choose one of the following choices:"
               },
               "2": {
                  "Options": {
                     "1": "<i>Homunculus</i>: You gain a companion that is a humanoid, undead, construct, or any creature with the homunculus template. The creature has a Challenge Rating of 1/2 or lower. See Bound Companions for more details. Your homunculus companion improves in CR the higher your level becomes, CR equal to 1 per every 8 levels of Alchemist (improving to 1 CR at level 4, 2 CR at level 8, and 3 CR at level 16). This either takes the form of choosing a higher-level companion, or adding hit dice to the companion until its CR increases.<br>If a humanoid or a creature with the homunculus template, the creature is loyal to you, but retains a shadow of free will. It can be commanded to go against its nature (or what it perceives as its nature) with a DC 15 Charisma check. Bonding with a homunculus requires spending one hour communicating with the creature by means it can understand, and spending the next seven hours in bonding activities (fixing/healing/conversing/etc.). The companion can use your potions as if it was you.",
                     "2": "<i>Innate Cantrips</i>: You can use any cantrips you have learned, so long as you have access to your Formula Book. You can use cantrips as if you were a spellcaster, and do not need to turn them into potions or use any resources on them (such as mana or inurement).",
                     "3": "<i>Potion Slinger</i>: You may choose one type of ranged weapon (such as crossbows or bows) and gain proficiency if you don‘t already have it. Furthermore, you may spend a potion to infuse the projectile with the potion‘s effects. You may choose to activate the potion before launching the projectile (to take into account the spell‘s original casting time), but the spell otherwise takes place as if the target was hit (or the area it landed on) is the spell‘s original target. You may choose to deal the ranged weapon‘s damage on impact or to only apply the potion‘s effect.",
                     "4": "<i>Mithridatism</i>: You gain innate power over poisons. You naturally generate up to four doses of basic poison (as described in the Player‘s Handbook) whenever you complete a long rest. The poison‘s DC is equal to your Alchemy Spell Save DC, however, and the damage is equal to 1d4 Poison damage per Alchemist spell level you can access. The poison expires before you complete your next long rest, replenishing your store. If you have an empty Mithridatism dose slot, you can choose to fill it with a poison you are affected by, so long as you succeed on the saving throw against it and are aware of its presence. You can store this poison for future use, but cannot otherwise generate it.<br>You also have skill in deploying poisons that are in your dosage slots, and gain temporary immunity to such poisons so long as they are not deployed. You may deploy poisons as described under Chapter 7: Poisoner‘s Kit."
                  }
               }
            }
         },
         "WillOfTheNecropolis": {
            "Label": "Will of the Necropolis",
            "Description": {
               "1": {
                  "Value": "Whenever you are bloodied, you may cast the death coil spell as a bonus action instead of an action. This feature can be used once per instance of you suffering the condition, or twice per instance if you are under the effects of the avatar form death knight spell."
               }
            }
         },
         "WorksAsIntended": {
            "Label": "Works as Intended",
            "Description": {
               "1": {
                  "Value": "Starting at 11th level, you may spend 2 Crafting Points to remove the Malfunctioned condition of a device you are touching. This costs a bonus action or reaction. Also, removing the Malfunctioned condition requires 2d4 minutes instead of 1 hour (or the end of a short rest)."
               },
               "2": {
                  "Value": "In both cases, this does not require you being familiar with the device."
               }
            }
         }
      },
      "Items": {
         "AlchemistsSupplies": {
            "Label": "Alchemist‘s Supplies"
         },
         "CommonClothes": {
            "Label": "Common Clothes"
         },
         "DisguiseKit" : {
            "Lalbel": "Disguise Kit"
         },
         "EngineersTools": {
            "Label": "Engineer‘s Tools"
         },
         "FineClothes": {
            "Label": "Fine Clothes"
         },
         "HolySymbol": {
            "Label": "Holy Symbol"
         },
         "MarkedCards": {
            "Label": "Marked Cards"
         },
         "PoisonersKit": {
            "Label": "Poisoner‘s Kit"
         },
         "Pouch": {
            "Label": "Pouch"
         },
         "PrayerBook": {
            "Label": "Prayer Book"
         },
         "PrayerWheel": {
            "Label": "Prayer Wheel"
         },
         "StickOfIncense": {
            "Label": "Stick of Incense"
         },
         "ThievesTools": {
            "Label": "Thieves‘ Tools"
         },
         "Vestments": {
            "Label": "Vestments"
         },
         "WeightedDice": {
            "Label": "Weighted Dice"
         }
      },
      "Languages": {
         "Common": "Common",
         "Dwarven": "Dwarven",
         "Draenei": "Draenei",
         "Draconic": "Draconic",
         "Elven": "Elven",
         "Eredun": "Eredun",
         "Gnomish": "Gnomish",
         "Goblin": "Goblin",
         "Kalimag": "Kalimag",
         "LowCommon": "Low Common",
         "Orcish": "Orcish",
         "Ogre": "Ogre",
         "Pandaren": "Pandaren",
         "ShatYar": "Shath'Yar",
         "Taurahe": "Taur-ahe",
         "Titan": "Titan",
         "Troll": "Troll"
      },
      "RaceSheet": {
         "AbilityScoreIncrease": "Ability Score Increase",
         "Age": "Age",
         "Traits": "Traits",
         "Affiliation": "Affiliation",
         "Size": "Size",
         "Appearance": "Appearance",
         "Speed": "Speed",
         "SpeedVal": "Your base walking speed is ",
         "Languages": "Languages",
         "Subrace": "Subrace",
         "SubraceChoice": "Choose one of these subraces.",
         "MaleNames": "Male Names",
         "FemaleNames": "Female Names",
         "FamilyNames": "Family Names"
      },
      "Race": {
         "Draenei": {
            "Name": "Draenei",
            "Description": "The draenei are a powerfully-build alien race that originates from Argus. They are powerfully magically-attuned, and have the potential for exceptional good or evil. Draenei who succumb to fel magic form the ranks of the Eredar, the greatest generals of the Burning Legion, while draenei who serve the Holy Light are immortal crusaders for justice across the cosmos.",
            "AbilityScoreIncrease": "Your Spirit or Intelligence increases by 1.",
            "Age": "A typical draenei claims adulthood around 100 years old, and can live to about ten thousand years old.",
            "Affiliation": "Each sub-race is inclined to its own affiliations.",
            "Size": "Their size is Medium. Males range anywhere from seven feet tall to eight feet tall and weigh on average around 300 or 400 pounds. Females stand at six to seven feet tall and only weigh around 170 or 250 pounds when fully grown.",
            "Appearance": "As befitting their Eredar heritage, Draenei have hooved feet, tendrils that grow from the neck and short tails, and their skin color is affected by the magic they naturally absorb (with fel magic reddening them, holy magic rendering their skins blue to violet, and void magic darkening them to brown). Males' skulls are rigid (giving the appearance of a bone plate under their skin), while females grow foot-long, graceful curved horns. Broken draenei look distinctly different from normal Draenei, having flat, noseless faces and having thick, three-fingered hands, and lose their bone-like plates.",
            "Language": "The Eredun Draenei speak is an altered dialect that is less corrupt, and thus does not impose penalties when speaking, but is perfectly understandable by fiends.",
            "FamilyNames": "Draenei do not have family names, but take a title according to their deeds.",
            "Subrace": "Ancient events divide the draenei into two sub-races: unbroken and broken.",
            "Subraces": {
               "Broken": {
                  "Name": "Broken (Krokul)",
                  "Quote": "You will learn our ways...",
                  "Description": "The Broken, also known as Krokul in Draenei, are a mutated and devolved subrace of draenei who lived in Outland. They, like most of the orcs, fell prey to the demons' sinister influence and were changed by the corruption. Though they lost some of their former powers, the Broken still present a clear danger to all races through Outland. The largest known faction of Broken in Outland, the Ashtongue Deathsworn, is currently led by Akama. They are supposedly allied with Illidan Stormrage.",
                  "AbilityScoreIncrease": "Your Agility increases by 2.",
                  "Affiliation": "Independent. Despite the (mostly) accidental regression into broken, many unbroken draenei not only distrust them but despise them. Although understandable of those broken who remain corrupted or in service to the Legion, one would think that the unbroken would be willing to welcome any of their people that survived the orcs' genocide. Most broken are independent as a result, although the Prophet Velen, the leader of the unbroken, does extend a hand to broken to help them find their way back."
               },
               "Unbroken": {
                  "Name": "Unbroken (True Draenei)",
                  "Quote": "The Legion's end draws near.",
                  "Description": "As one of the enlightened cousins of the Eredar, the Draenei arrived in Azeroth after the reopening of the Dark Portal. Living out the last centuries in exile and escape from the Burning Legion, the Draenei are steadfast champions of the Light, and will do anything in their power to prevent another world from falling to the Flame.",
                  "AbilityScoreIncrease": "Your Strength increases by 2.",
                  "Affiliation": "Alliance. Unbroken draenei have found that they have strong bonds with humanity and dwarvenkind due to their shared worship of the Light, and kinship with the now-mortal night elves."
               }
            }
         },
         "Dwarf": {
            "Name": "Dwarf",
            "Description": "Dwarves are short and stout creatures mostly inhabiting Khaz Modan in the Eastern Kingdoms. They are shorter than humans but taller than gnomes, taking advantage of their size when possible and relying on their robustness and strength when not. The average dwarf is steady, observant and composed.",
            "AbilityScoreIncrease": "Your Stamina score increases by 2.",
            "Age": "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 40. On average, they live to be 450 years old.",
            "Affiliation": "Each sub-race is inclined to its own affiliations ever since the great War of the Three Hammers.",
            "Size": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
            "Appearance": "Male dwarves tend to have long hair, and beards or facial hair often tied in ornate braids. Female dwarves also have sturdy muscular frames, but they are buxom and lack facial hair, despite the claims of some of the less educated sages of other races.",
            "SpeedAddition": "Your speed is not reduced by wearing heavy armor.",
            "Language": "Dwarven is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak.",
            "Subrace": "Three main subraces of dwarves populate the worlds of Azeroth: Hill dwarves (Wildhammer Clan), Mountain dwarves (Bronzebeard Clan), and Dark dwarves (Dark Iron Clan).",
            "Subraces": {
               "Bronzebeard": {
                  "Name": "Mountain Dwarf (Bronzebeard)",
                  "Quote": "For Khaz Modan!",
                  "Description": "As a mountain dwarf, you probably hail from the Bronzebeard clan and its allies, and live in Khaz Modan. Ironforge dwarves are stout and powerful, with short muscular bodies, and prefer tying their hair (male or female) in ornate braids.",
                  "AbilityScoreIncrease": "Your Strength score increases by 1.",
                  "Affiliation": "Alliance. While the dwarves of Ironforge appreciate the fighting skill of the Horde, it is with grim eyes that they look upon the orcs and their allies, the trolls and the Forsaken. Although the dwarves have held dealings of commerce and diplomacy with the high elves, they keep the people of Quel‘Thalas at an arm‘s distance. While the night elves may share the same allegiances, the dwarves look upon them with suspicion and some trepidation. Humans, however, are the staunch and constant allies of the dwarven people and find welcome, favor and kindness when in dwarven lands.",
                  "FamilyNames": "Thunderforge, Bronzebeard, Hammergrim, Thornsteel, Chunderstout"
               },
               "DarkIron": {
                  "Name": "Darklands Dwarf (Dark Iron)",
                  "Quote": "You shall serve.",
                  "Description": "As a darklands dwarf, you probably hail from the Dark Iron clans, lead by the Sorcerer-thane Thaurissan. Reviled as betrayers of their fellow dwarves, and living in the mountain-halls of Blackrock Mountain, Dark Iron dwarves are slaves to the great elemental Firelord Ragnaros, and serve him in the latent volcanic mountain. Dark Irons seem identical to Ironforge dwarves, except that their skin tones are ashen and gray, and their eyes are golden-red. Dark Irons who adventure can often reach into the power in their bloodline and spontaneously conjure flames. Hoarse of voice and prone to undertone muttering, Dark Irons do not inspire trust easily.",
                  "AbilityScoreIncrease": "Your Intelligence score increases by 1.",
                  "Affiliation": "Alliance or Independent. Hatred comes to Dark Iron dwarves against all races, and in their service to Ragnaros, they see only rivals, thralls, and enemies. Some dark irons have found kinship with their cousins the Wildhammers and the Bronzebeards, and chose to join the Alliance.",
                  "FamilyNames": "Angerforge, Darkbargainer, Firesmite, Forgewright"
               },
               "Wildhammer": {
                  "Name": "Hill Dwarf (Wildhammer)",
                  "Quote": "To the skies!",
                  "Description": "As a hill dwarf, you probably hail from the Wildhammer clan and its allies, and live in the Aerie Peak. Wildhammer dwarves are similar in appearance to their Ironforge kin, though many shave their heads and they are slightly taller and leaner. Exposure to sun and high winds darkens and toughens their skin. Wildhammers string beads and feathers into their hair and beards as good luck charms, and paint tattoos on their bodies in homage to the totems, ideas and creatures they revere.",
                  "AbilityScoreIncrease": "Your Spirit score increases by 1.",
                  "Affiliation": "Alliance or independent. The Wildhammer clan is not a member of the Alliance, but Wildhammer dwarves are allies of the Alliance and would certainly help it in a war (and have done so in the past). They are distant with humans and Ironforge dwarves, but have formed a kinship with high elves. Wildhammers and high elves shared much in common in the past, including a love of nature and hatred of evil. Many high elves have grown introverted and brooding of late, which concerns the Wildhammers. The dwarves are appalled at the defection of the blood elves, an event which has caused them to see their high elf allies with new eyes. They also get along well with night elves, as the two races share much in common.",
                  "FamilyNames": "Beastclaw, Greatbeard, Thundertamer, Windseer"
               }
            }
         },
         "Elf": {
            "Name": "Elf",
            "Description": "An elf is a member of one of the longest lived species on Azeroth known for keen perception, grace, and great spellwork. Elves were once believed to be the first race to awaken on Azeroth.",
            "AbilityScoreIncrease": "Your Agility score increases by 2.",
            "Age": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. A high elf typically claims adulthood around the age of 60 and can live to be 750 years old. A night elf claims adulthood and live up to five times said age (adulthood at 300 and live up to 3,750 years old). Until the World Tree was destroyed, the Night Elves were immune to aging effects.",
            "Affiliation": "Each sub-race is inclined to its own affiliations ever since the Great War of the Ancients.",
            "Size": "A high elf (and hence a blood and void elf) is usually a little over 6 feet in height and weighs between 100 to 175 pounds, depending on gender. Night elves (and hence Nightborne) are imposing in stature, males being on average 7 feet tall.",
            "Appearance": "Male Kaldorei are very muscular, with broad chests and shoulders, indicative of the strength that lies within both their minds and bodies. Female night elves are lithe and curvaceous, yet still muscular and strong.",
            "SpeedAddition": "Your speed is not reduced by wearing heavy armor.",
            "Language": "Elven is fluid, with subtle intonations and intricate grammar, even with strange dialects such as Nazja. Elven literature is rich and varied, and their songs and poems are famous among other races.",
            "Subrace": "Ancient divides and use of mana siphoning (or mana vampirism) among the elven people resulted in several main sub-races: high elves (and the blood and void elves), and night elves (and the Nightborne).",
            "Subraces": {
               "HighElf": {
                  "Name": "High Elf (Quel'dorei)",
                  "Quote": "For Quel‟Thalas!",
                  "Description": "As a high elf, you hail from Silvermoon in Quel‘Thalas or Dalaran. High elves stand slightly taller than humans do. The elves are slim, with sharp symmetrical features, often an exaggeration of perfect beauty. The high elves are uniformly fair in complexion, with white to flaxen colored hair. Their eyes are incredibly intense in color, seeming to glow with an inner light. While many high elves have blue or green eyes, violet and red are not unheard of.",
                  "AbilityScoreIncrease": "Your Intelligence score increases by 1.",
                  "Affiliation": "Alliance or independent. Most of the high elves have placed themselves under a self-imposed exile, ashamed of the damage that they have wrought upon the world of Lordaeron with their abuse of arcane magic. While humans still accept the high elves because of the aid that both races provided each other during the most recent attacks of the Burning Legion, many of the other races will only deal with the high elves if absolutely necessary. This is especially true after the acts of Kael‘thas Sunstrider. The night elves in particular do not care for the company of high elves and in some cases can be openly hostile toward their sun-blessed brethren. The passing of time may heal these wounds, but the use of arcane magic will always draw a rift between these two breeds of elf.",
                  "FamilyNames": "Boughstrider, Dawnblade, Lightbringer, Morningray, Suntreader"
               },
               "BloodElf": {
                  "Name": "Blood Elf (Sin'dorei)",
                  "Quote": "Power! My people are addicted to it... a dependence made manifest after the Sunwell was destroyed. - Kael'Thas Sunstrider",
                  "Description": "Following the Third War, 90% of the High Elven population was slain during the Siege of Silvermoon and the Razing of Quel‘Thalas. Prince Kael‘Thas Sunstrider renamed his people the Blood Elves (Sin‘dorei) following this terrible event. With their homeland destroyed, their forests burned and corrupted, and their beloved sacred Sunwell sullied, the Blood Elves underwent mana withdrawal. Blood Elves are identical to High Elves in racial bonuses and names. However, their culture is more warped due to their insatiable thirst for vengeance: most have abandoned worship of the Light, and their allegiances have also changed, and most suffer psychologically from extensive use of mana siphoning, due to the Sunwell‘s corruption and subsequent destruction. A DM should consider applying the mana withdrawal optional rule with Blood Elves.",
                  "Affiliation": "Horde or independent. Most of the blood elves have joined the New Horde, invited to do so by the Banshee Queen Sylvanas Windrunner."
               },
               "NightElf": {
                  "Name": "Night Elf (Kal'dorei)",
                  "Quote": "The horn has sounded, and I have come as promised. I smell the stench of decay and corruption in our land. That angers me greatly. - Malfurion Stormrage",
                  "Description": "As a night elf, you hail from Darnassus in Kalimdor. The race‘s prominent eyebrows, long pointed ears and natural aspects imply a feral grace. Skin tones range from pale white to blue or even ruddy red, and their hair ranges in color from bright white to woodland green to lustrous black.",
                  "AbilityScoreIncrease": "Your Spirit score increases by 1.",
                  "Affiliation": "Alliance or independent. The night elves are members of the Alliance, but they are not the most trusted or highly regarded members of this group of races. Although honorable and just, the night elves‘ natural distrust has tainted their relations somewhat. Combined with their mystical appearances and mysterious natures, interactions with other races become uncomfortable at times. There is a strong streak of isolationism in the Kaldorei, for they are uncomfortable leaving the verdant mists of Teldrassil.",
                  "FamilyNames": "Moonblade, Glaivestorm, Proudstrider, Oakwalker, Nightwing, Staghorn"
               },
               "Nightborne": {
                  "Name": "Nightborne (Shal'dorei)",
                  "Quote": "My people face a similar dilemma. I peered into all possible futures in search for an answer... and found only one - Malfurion Stormrage - Elisande, Grand Magistrix of the Nightborne",
                  "Description": "As a Nightborne, you hail from the ancient city of Suramar, and have spent your life sheltered by the power of the Nightwell (a simulacrum of the Well of Eternity), and the dome of arcane power weaved by Elisande, the Grand Magistrix. The nightborne look similar to night elves, but their overall appearance is darker. Their skin does not have the brighter skin tones of purple and pink that night elves do, instead having more pale skin with dark blue-purplish tones. A Shal'dorei's hair is also far less colorful than the Kal'dorei's, having only white, gray, black, or very pale-blue hair colors. Glowing tattoos seem common among nightborne, though whether these are cosmetic or a result of the Nightwell's energy is unknown. Their eyes glow a light blue.",
                  "AbilityScoreIncrease": "Your Intelligence score increases by 1.",
                  "Affiliation": "Horde or Independent. When the dome began unweaving after the Battle of Nighthold during the third Burning Legion invasion of Azeroth, the leaders of the Nightborne elected to let it fade, subjecting the Nightborne to the same withdrawal the High Elves face, rather than face the alternative. Electing to join the Horde, the Nightborne found new and steadfast allies in the Blood Elves when they re-appeared in the world of Azeroth. Nightborne that are more independentminded also roam the world, searching for ways to satiate their thirst for magic before it becomes an obsession like the Blood Elves"
               },
               "VoidElf": {
                  "Name": "TODO",
                  "Quote": "TODO",
                  "Description": "TODO",
                  "AbilityScoreIncrease": "TODO",
                  "Affiliation": "TODO"
               }
            }
         }
      },
      "Rules": {
         "Mechanics": {
            "AbilityScoreSummary": {
               "Label": "Ability Score Summary",
               "Blocks": {
                  "1": {
                     "Content": "Measures: Natural athleticism, bodily power<br>Important for: Death Knight, Paladin, and Warrior"
                  },
                  "2": {
                     "Content": "Measures: Physical agility, reflexes, balance, poise<br>Important for: Hunter, Monk, Rogue"
                  },
                  "3": {
                     "Content": "Measures: Health, constitution, vital force<br>Important for: Everyone"
                  },
                  "4": {
                     "Content": "Measures: Mental acuity, information recall, analytical skill<br>Important for: Alchemist, Mage, Tinker"
                  },
                  "5": {
                     "Content": "Measures: Awareness, intuition, wisdom<br>Important for: Druid, Priest, Shaman"
                  },
                  "6": {
                     "Content": "Measures: Confidence, eloquence, leadership<br>Important for: Warlock"
                  }
               }
            },
            "DeterminingAbilityScores": {
               "Label": "Determining Ability Scores",
               "Blocks": {
                  "1": {
                     "Label": "Focus and Foible",
                     "Content": "This method leads to more focused characters with clearer weaknesses. Before applying modifiers, choose a one focus (an ability score you‘re good at) and one foible (an ability score you‘re bad at).<br><i>Focus</i>. Mark this attribute as 18<br><i>Foible</i>. Mark this attribute as 8<br><br>Set your remaining attributes at 10, and distribute 16 points among the ability scores in any way you desire. You may reduce an existing attribute by up to 2 points to gain 2 points to add to another attribute."
                  },
                  "2": {
                     "Label": "Heroic Roll",
                     "Content": "This method leads to generally stronger characters than by normal rolling. For each ability score, roll 2d6 + 6."
                  }
               }
            },
            "Beyond1stLevel": {
               "Label": "Beyond 1st Level",
               "Content": "<p>The rules in the World of Warcraft 5e RPG also include crafting sub-systems and classes (such as the Alchemist and Tinker), and various options (such as the <a class=\"entity-link inline\" data-pack=\"warcraft5e.feats\" data-id=\"enBseIfaasp0D7xv\">Infusionist</a> feat) that can translate wealth into character power. When creating a character from above 1st level, refer to the following guidelines for expected wealth for level to give a general idea how to keep characters on the same general level of wealth. Refer to the Item Creation Complexity and Cost Table on Chapter 7 to calculate item rarity. Note that crafting an item costs onehalf the cost of buying it.</p><p>The amount of wealth carried by a character can vary significantly depending on starting resources, unexpected loot gained in the campaign, whether or not characters have downtime to gather additional wealth, inherited gold, or even  ossessing companies and strongholds under their control.</p>",
               "Blocks": {
                  "1": {
                     "Label": "Magical Item Budget",
                     "Content": "A DM may refer to the above chart to determine the total worth of magic items the characters have, without actually explicit magic items to be sold. In this case, the wealth is not the expected wealth of the character, but the cost of the magic items the player should have by the appropriate level. This can come in the form of quest gifts, a normal item improving into a magical one, or a permanent blessing or infusion upon a held item. The expected cost of magic items relative to rarity is present in Chapter 7."
                  },
                  "2": {
                     "Label": "Expected Downtime",
                     "Content": "In case of crafting classes (Alchemist and Tinker), or in cases where characters can create magical items (taking the Infusionist feat), a good amount of downtime to allow the classes to function at a competitive rate is usually 5 days to 1 week between adventures (or the same time for every 3-5 combat encounters). That way, very complex projects (2 weeks) like building a mecha or vehicle can be done every two adventures. With such options available, players benefit more from wealth and time to build the exact items they need, from scrolls, potions, explosives, and more spells in a mage's spellbook, to advanced constructs and vehicles such as gyrocopters, so exercising judgment is key."
                  }
               },
               "TypicalWealth": "Typical Wealth"
            },
            "Advantage": {
               "Label": "Advantages and Disadvantages",
               "Content": "<p>Sometimes a special ability or spell tells you that you have advantage or disadvantage on an ability check, a saving throw, or an attack roll. When that happens, you roll a second d20 when you make the roll. Use the higher of the two rolls if you have advantage, and use the lower roll if you have disadvantage. For example, if you have disadvantage and roll a 17 and a 5, you use the 5. If you instead have advantage and roll those numbers, you use the 17.</p><p>If multiple situations affect a roll and each one grants advantage or imposes disadvantage on it, you don't roll more than one additional d20. If two favorable situations grant advantage, for example, you still roll only one additional d20.</p><p>If circumstances cause a roll to have both advantage and disadvantage, you are considered to have neither of them, and you roll one d20. This is true even if multiple circumstances impose disadvantage and only one grants advantage or vice versa. In such a situation, you have neither advantage nor disadvantage.</p><p>When you have advantage or disadvantage and something in the game, such as the halfling's Lucky trait, lets you reroll the d20, you can reroll only one of the dice. You choose which one. For example, if a halfling has advantage or disadvantage on an ability check and rolls a 1 and a 13, the halfling could use the Lucky trait to reroll the 1.</p><p>You usually gain advantage or disadvantage through the use of special abilities, actions, or spells. Inspiration can also give a character advantage. The GM can also decide that circumstances influence a roll in one direction or the other and grant advantage or impose disadvantage as a result.</p>"
            },
            "Resistance": {
               "Label": "Damage Resistance and Vulnerability",
               "Content": "<p>Some creatures and objects are exceedingly difficult or unusually easy to hurt with certain types of damage.</p><p>If a creature or an object has resistance to a damage type, damage of that type is halved against it. If a creature or an object has vulnerability to a damage type, damage of that type is doubled against it.</p><p>Resistance and then vulnerability are applied after all other modifiers to damage. For example, a creature has resistance to bludgeoning damage and is hit by an attack that deals 25 bludgeoning damage. The creature is also within a magical aura that reduces all damage by 5. The 25 damage is first reduced by 5 and then halved, so the creature takes 10 damage.</p><p>Multiple instances of resistance or vulnerability that affect the same damage type count as only one instance. For example, if a creature has resistance to fire damage as well as resistance to all nonmagical damage, the damage of a nonmagical fire is reduced by half against the creature, not reduced by three-quarters.</p>"
            }
         }
      },
      "Traits": {
         "Adapter": {
            "Label": "Adapter",
            "Description": "You may always act when surprised at a combat encounter (even if you failed your Perception check to notice it). You also have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> versus weather effects."
         },
         "ArcaneAffinity": {
            "Label": "Arcane Affinity",
            "Description": "You have increased affinity with arcane magic. You can choose one of the following two features:",
            "Options": {
               "1": "<i>Augment Weave</i>. You deal one additional point of arcane damage for each damage dice with your arcane spells. This applies once per spell. You may apply this to spells that do not deal arcane damage, but only once per short or long rest",
               "2": "<i>Arcane Strike</i>. You can enhance your attacks with a blast of arcane damage. As a [strike] effect, you can add 1d6 points of arcane damage to your melee or ranged weapon attacks. For every four character levels you gain, you gain an additional dice of damage. You may choose to spend them all at once or one for each attack. You regain all spent dice at the end of a short rest",
               "3": "<i>Energy Blast</i>. You can release a blast of arcane force as if you possessed the Mystic Blast feat (arcane damage only). You may use this blast number of times equal to your Intelligence modifier before replenishing at a long rest. This deals a number of d4 dice equal to onequarter your level (minimum 1d4)."
            }
         },
         "ArcaneLegacy": {
            "Label": "Arcane Legacy",
            "Description": "The high elves are uniquely attuned to magic. You can choose one of the below abilities.",
            "Options": {
               "1": "You increase your mana pool size by 2 mana points.",
               "2": "You add an additional cantrip to your High Magic ability, chosen from the mage spell list.",
               "3": "You gain the Suffused Arrows talent. You may only take this if your first level is a hunter."
            }
         },
         "BlessingOfTheNightwell": {
            "Label": "Blessing of the Nightwell",
            "Description": "You have resistance to arcane damage."
         },
         "BloodMagic": {
            "Label": "Blood Magic",
            "Description": "This acts as High Magic. While you use abilities granted by this ability, your eyes glow a pale fel green instead of High Elves‘ blue. Instead of the prestidigitation cantrip, you may choose the thaumaturgy cantrip instead, and may cast the mana burn spell instead of mute."
         },
         "Bravery": {
            "Label": "Bravery",
            "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> to all saves against fear."
         },
         "BronzebeardCombatTraining": {
            "Label": "Dwarven Combat Training",
            "Description": "You have proficiency with firearms and explosives of all types, even if you do not have proficiency in engineering, and gain proficiency with light armor."
         },
         "BurningHeart": {
            "Label": "Burning Heart",
            "Description": "You know the produce flame cantrip (caster level equal to your character level). Intelligence is your spellcasting ability for it."
         },
         "Darkvision": {
            "Label": "Darkvision",
            "Description": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
         },
         "DraeneiCombatTraining": {
            "Label": "Draenei Combat Training",
            "Description": "You have proficiency with the longsword, greathammer, glaive, and the heavy crossbow."
         },
         "DwarvenCombatTraining": {
            "Label": "Dwarven Combat Training",
            "Description": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
         },
         "ElvenCombatTraining": {
            "Label": "Elven Combat Training",
            "Description": "You have proficiency with the longsword, longbow, rapier, and shortbow."
         },
         "ExtraLanguage": {
            "Label": "Extra Language",
            "Description": "You can speak, read and write one extra language of your choice."
         },
         "FelResistance": {
            "Label": "Fel Resistance",
            "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">resistance</a> to fel damage."
         },
         "FireLordsFavor": {
            "Label": "Fire Lord's Favor",
            "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">resistance</a> to fire damage."
         },
         "Gemcutting": {
            "Label": "Gemcutting",
            "Description": "You are proficient with artisan's tools (jewelcrafting kit)."
         },
         "GiftOfTheNaaru": {
            "Label": "Gift of the Naaru",
            "Description": "You can use your action to channel holy energy, casting the renewing light spell as if cast as a 1st level spell. This can be used once, replenishing on a short or long rest. While a creature benefits from this ability, they have a glowing blue mark above their forehead (shedding light equal to dancing lights). Your spellcasting ability modifier is Spirit or Charisma (your choice)."
         },
         "HeroicPresence": {
            "Label": "Heroic Presence",
            "Description": "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + half your Charisma or Spirit modifier. A creature can't gain temporary hit points from this feature again until it has finished a long rest. Alternatively, you may declare use of this ability upon landing a critical hit."
         },
         "HighMagic": {
            "Label": "High Magic",
            "Description": "Magic. You know the prestidigitation cantrip and can cast it normally (caster level equal to your character level). When you reach 3rd level, you can also cast detect magic as a 1st level spell. When you reach 5th level, you can also cast the mute spell as a 2nd level spell. Intelligence is your spellcasting ability for these spells, and you use your mana pool for these abilities (even if you are not normally a spellcaster). While you use such abilities (and after using them for one hour), your eyes glow a pale blue. If you can already cast such spells (and have a sufficiently high caster level), they are always prepared for free."
         },
         "KeenSenses": {
            "Label": "Keen Senses",
            "Description": "You are proficient with the Perception skill."
         },
         "MaskOfTheWild": {
            "Label": "Mask of the Wild",
            "Description": "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
         },
         "MountainBorn": {
            "Label": "Mountain Born",
            "Description": "You're acclimated to high altitude, including elevations above 20,000 feet. You're also naturally adapted to cold weather in the wilderness or while exploring."
         },
         "MysticSenses": {
            "Label": "Mystic Senses",
            "Description": "Whenever you make any check related to the origin of magical items, lore, or spells, you are treated as if you have Expertise in the Arcana skill."
         },
         "NaturalArmor": {
            "Label": "Natural Armor",
            "Description": "Your skin is as hardened leather in toughness. When you aren't wearing armor, your AC is 12 + your Agility modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
         },
         "NaturalHandler": {
            "Label": "Natural Handler",
            "Description": "You have proficiency with Animal Handling. If handling beasts that naturally live in mountains such as gryphons or mountain lions, you gain Expertise instead."
         },
         "NatureResistance": {
            "Label": "Nature Resistance",
            "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> on saving throws against poisons, and have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">resistance</a> against lightning and poison damage."
         },
         "NightfallenMagic": {
            "Label": "Nightfallen Magic",
            "Description": "You know the mage hand cantrip and can cast it normally (caster level equal to your character level). When you reach 3rd level, you can also cast detect magic as a 1st level spell. When you reach 5th level, you can also cast the arcane explosion spell as a 2nd level spell. Intelligence is your spellcasting ability for these spells, and you use your mana pool for these abilities (even if you are not normally a spellcaster). While you use such abilities (and after using them for one hour), your eyes glow a light blue. If you can already cast such spells (and have a sufficiently high caster level), they are always prepared for free."
         },
         "Resilience": {
            "Label": "Resilience",
            "Description": "You have <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> against poisons and <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"FuRFBklCArGIhci8\">resistance</a> to poison damage."
         },
         "Shadowmeld": {
            "Label": "Shadowmeld",
            "Description": "When you are in dim or dark light, you gain <a class=\"entity-link inline\" data-pack=\"warcraft5e.rules\" data-id=\"K4kXNTd9rJoZAHu5\">advantage</a> on Agility (Stealth) checks."
         },
         "Stalker": {
            "Label": "Stalker",
            "Description": "You have proficiency with the Perception and Stealth skills. If you already have proficiency with one of these skills, you gain Expertise instead."
         },
         "Stonecunning": {
            "Label": "Stonecunning",
            "Description": "Whenever you make an Intelligence (History) check or Mining checks related to stonework and minerals, you are considered both proficient and as if having Expertise in either History or Mining (choose one)."
         },
         "Stoneform": {
            "Label": "Stoneform",
            "Description": "You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Stamina modifier to the number rolled, and reduce the damage by that total. If the damage exceeds any ongoing bleed damage you take, you end the effect as well. After you use this trait, you can't use it again until you finish a short or long rest."
         },
         "ToolProficiency": {
            "Label": "Tool Proficiency",
            "Description": "You gain proficiency with one artisan's tool of your choice: smith's tools, brewer's supplies, mason's tools, or mining tools."
         }
      },
      "SkillSheet": {
         "Category": "Category"
      },
      "SkillCategories": {
         "General": "General",
         "Strike": "Strike",
         "Stance": "Stance"
      },
      "SpellSheet": {
         "School": "School",
         "CastTime": "Casting Time",
         "Range": "Range",
         "Components": "Components",
         "Duration": "Duration",
         "Classes": "Classes",
         "Heightened": "Heightened"
      },
      "Spells": {
         "AbandonmentAura": {
            "Label": "Abandonment Aura",
            "Description": "Destructive energy radiates from you in an aura with a 15-foot radius. Until the spell ends, the aura moves with you, centered on you. Each creature hostile to you that is in the aura takes 1 extra point of damage from all weapon attacks. A creature can negate this effect if they succeed on a Spirit saving throw once within the aura‘s area.<br> This spell is suppressed by the protection from good and evil (and similar abjurations). This is an aura bonus.",
            "Heightened": "For each spell level above 1st, the extra damage increases by 1 point (up to 5 extra points of damage at spell level 5).<br> Note. This spell suppresses and is suppressed by the devotion aura spell."
         },
         "AbsorbElements": {
            "Label": "Absorb Elements",
            "Description": "The spell captures some of the incoming energy, lessening its effect on you and storing it for your next melee attack. You have resistance to the triggering damage type until the start of your next turn. Also, the first time you hit with a melee attack on your next turn, the target takes an extra 1d6 damage of the triggering type, and the spell ends.",
            "Heightened": "When you cast this spell using a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each slot level above 1st."
         },
         "AlignedWeapon": {
            "Label": "Aligned Weapon",
            "Description": "You imbue a weapon you touch with power aligned to the Holy Light or the Forgotten Shadow. Until the spell ends, the weapon emits bright light in a 30-foot-radius and dim light for an additional 30 feet, colored golden white (if Holy Light) or pale violet (if Forgotten Shadow). In addition, weapon attacks made with it deal an extra 2d8 extra damage on a hit (holy damage if Holy Light, or shadow damage if Forgotten Shadow). If the weapon isn‘t already a magic weapon, it becomes one for the duration.<br>As a bonus action on your turn, you can dismiss this spell and cause the weapon to emit a lasting blast. Each creature of your choice that you can see within 30 feet of you must make a Stamina saving throw. On a failed save, a creature takes 4d8 damage (holy or shadow), and it is blinded for 1 minute. On a successful save, a creature takes half as much damage and isn‘t blinded. At the end of each of its turns, a blinded creature can make a Stamina saving throw, ending the effect on itself on a success.<br>Special. If aligned to the Forgotten Shadow, the weapon may, at your will, shed no light instead. In that case, releasing the spell deals extra 1d8 shadow damage."
         },
         "AlterSelf": {
            "Label": "Alter Self",
            "Description": "You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts, you can end one option as an action to gain the benefits of a different one.",
            "Options": {
               "1": "<i>Aquatic Adaptation</i>: You adapt your body to an aquatic environment, sprouting gills and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed.",
               "2": "<i>Change Appearance</i>: You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and distinguishing characteristics, if any. You can make yourself appear as a member of another race, though none of your statistics change. You also can't appear as a creature of a different size than you, and your basic shape stays the same; if you're bipedal, you can't use this spell to become quadrupedal, for instance. At any time for the duration of the spell, you can use your action to change your appearance in this way again.",
               "3": "<i>Natural Weapons</i>: You grow claws, fangs, spines, horns, or a different natural weapon of your choice. Your unarmed strikes deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient with your unarmed strikes. Finally, the natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it."
            }
         },
         "AmplifyMagic": {
            "Label": "Amplify Magic",
            "Description": "You amplify magical effects in the area of effect. All spells cast from or into the area of effect are heightened one spell level. If the spell cannot be heightened (or if heightening has no effect), it heals 25% more, damages 25% more, or remains for 25% longer.<br><i>Dampen Magic</i>: This spell may be reversely cast. If so, the spells cast into or from the area of effect are counted one level lower (if eligible) and are reversely affected (heals 25% less, deals 25% less damage, or remains for 25% less time)."
         },
         "AncestralGuardian": {
            "Label": "Ancestral Guardian",
            "Description": "You conjure spirits to guard and advise the target in battle, tapping into the target's ancestral bonds. The target regains 2d4 hit points. At the beginning of every round, the caster must succeed on a sigil roll to affect the target again.<br>Also, so long as this sigil is active, the target also takes 1 less point of damage from weapon and spell attacks and effects for that round. The reduction to damage is an aura effect.<br>Constructs gain no benefit from this spell.<br><i>Special</i>: If the caster and the target share ancestry or share a Blood Oath (see Chapter 10), the damage reduction increases by 1 point.",
            "Heightened": "The healing increases by one dice per every level above 2nd, and reduction to damage increases by one point per every two levels above 2nd."
         },
         "Bane": {
            "Label": "Bane",
            "Description": "Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw.",
            "Heightened": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
         },
         "BerserkerRage": {
            "Label": "Berserker Rage",
            "Description": "You cause one creature to go into a murderous rampage. The target must succeed on a Stamina saving throw or else gains the following benefits. A willing creature can choose to fail on the saving throw.<br><br><ul><li>They have advantage on Strength checks and Strength saving throws.</li><li>When they make a melee weapon attack using Strength, they gain a +2 bonus to the damage roll (this applies only twice per round).</li><li>They have Resistance to bludgeoning, piercing, and slashing damage.</li><li>The suffers the distracted condition (DC is equal to your spell DC).</li></ul><br>The rage ends early if the target is knocked unconscious, or if their turn ends without being attacked or attacking a hostile creature, or if not taking at least one point of damage in that turn. The benefits of this spell are not gained if the target is wearing heavy armor. A creature affected by this spell makes another Stamina saving throw at the end of its turn. On a successful save, the effect ends for it. If the rage continues for more than two rounds, the creature gains one level of exhaustion at the end of the rage.<br> A creature cannot benefit from this spell more than once per their own proficiency bonus per every long rest.",
            "Heightened": "For each 3 spell levels heightened above 2nd level, the bonus to damage rolls increases by 1 (+3 at 5th, +4 at 8th)."
         },
         "BlackTentacles": {
            "Label": "Black Tentacles",
            "Description": "Squirming, ebony tentacles fill a 20-foot square on ground that you can see within range. For the Duration, these tentacles turn the ground in the area into difficult terrain.<br>When a creature enters the affected area for the first time on a turn or starts its turn there, the creature must succeed on a Dexterity saving throw or take 3d6 bludgeoning damage and be  Restrained by the tentacles until the spell ends. A creature that starts its turn in the area and is already  Restrained by the tentacles takes 3d6 bludgeoning damage.<br>A creature  Restrained by the tentacles can use its action to make a Strength or Dexterity check (its choice) against your spell save DC. On a success, it frees itself."
         },
         "CarrionSwarm": {
            "Label": "Carrion Swarm",
            "Description": "You release a torrent of poisonous spiders, beetles and other vermin from hand to bite and infest your opponents. Each creature in a 20-foot cone must make a Stamina saving throw, or take 3d8 bludgeoning, piercing, and slashing damage on a failed save, or half as much damage on a successful saving throw. Targets who failed the saving throw are also infested by the swarm. At the beginning of every round, the caster must succeed on a sigil roll to affect the infested targets again (even if they are no longer within the normal range). Also, as long as the spell is active for that target, they are considered poisoned until the beginning of their turn in the next round. Whenever a creature dies while being poisoned by this spell, a carrion beetle is conjured where they once stood (exploding from the corpse). The DM has the carrion beetle‘s statistics. A creature can end the infestation on them by spending an action.",
            "Heightened": "The damage increases by one dice per every spell level above 3rd. Special. If you are a corporeal undead, you may target one creature that suffers under this sigil, and transfer some of their lost life force to you. You regain hit points equal to one-half the damage dealt by the spell in the same round."
         },
         "CircleOfPower": {
            "Label": "Circle of Power",
            "Description": "Divine energy radiates from you, distorting and diffusing magical energy within 30 feet of you. Until the spell ends, the sphere moves with you, centered on you. For the duration, each friendly creature in the area (including you) has advantage on saving throws against spells and other magical effects.<br><br>Additionally, when an affected creature succeeds on a saving throw made against a spell or magical effect that allows it to make a saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throws."
         },
         "Confusion": {
            "Label": "Confusion",
            "Description": "This spell assails and distorts the minds of creatures, generating illusions and causing uncontrolled actions. Each creature in a sphere of 10-foot-radius centered on a point chosen in the range of the spell must make a Wisdom saving throw otherwise it will be affected by the spell.<br>An affected target can react and it must start at the beginning of 1d10 each of his game rounds to determine its behavior for that round.<br>At the end of each turn, an affected creature can make a saving throw of Wisdom. If successful, the effect of the spell ends for this target.",
            "Heightened": "When you cast this spell using a level spell slot 5 or more, the radius of the sphere increases by 5 feet for each level of higher spell slot to 4."
         },
         "ConjureUndead": {
            "Label": "Conjure Undead",
            "Description": "TODO: Spell missing"
         },
         "Contagion": {
            "Label": "Contagion",
            "Description": "Your touch inflicts disease. Make a melee spell attack against a creature within your reach. On a hit, you afflict the creature with a disease of your choice from any of the ones described below.<br>At the end of each of the target’s turns, it must make a Constitution saving throw. After failing three of these saving throws, the disease’s effects last for the duration, and the creature stops making these saves. After succeeding on three of these saving throws, the creature recovers from the disease, and the spell ends.<br>Since this spell induces a natural disease in its target, any effect that removes a disease or otherwise ameliorates a disease’s effects apply to it.<br><ul><li><i>Blinding Sickness</i>: Pain grips the creature’s mind, and its eyes turn milky white. The creature has disadvantage on Wisdom checks and Wisdom saving throws and is blinded.</li><li><i>Filth Fever</i>: A raging fever sweeps through the creature’s body. The creature has disadvantage on Strength checks, Strength saving throws, and attack rolls that use Strength.</li><li><i>Flesh Rot</i>: The creature’s flesh decays. The creature has disadvantage on Charisma checks and vulnerability to all damage.</li><li><i>Mindfire</i>: The creature’s mind becomes feverish. The creature has disadvantage on Intelligence checks and Intelligence saving throws, and the creature behaves as if under the effects of the confusion spell during combat.</li><li><i>Seizure</i>: The creature is overcome with shaking. The creature has disadvantage on Dexterity checks, Dexterity saving throws, and attack rolls that use Dexterity.</li><li><i>Slimy Doom</i>: The creature begins to bleed uncontrollably. The creature has disadvantage on Constitution checks and Constitution saving throws. In addition, whenever the creature takes damage, it is stunned until the end of its next turn."
         },
         "CreateFoodAndWater": {
            "Label": "Create Food and Water",
            "Description": "You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and doesn't go bad."
         },
         "Cripple": {
            "Label": "Cripple",
            "Description": "You cripple any living target within range. Make a ranged spell attack. On a success, the target takes -2 to AC and to Agility saving throws, can‘t use its reactions, and may make either an action or a bonus action every turn (not both). Regardless of the creature‘s abilities, it may only make one melee or ranged attack on its turn, and they deal only half damage with weapon attacks that use Strength or Agility.<br>If the creature attempts to cast a spell with a casting time of 1 action, roll a d20. On an 11 or higher, the spell doesn‘t take effect until the creature‘s next turn, and the creature must use its action on that turn to complete the spell. If it can‘t, the spell is wasted. At the end of each of the target‘s turns, it can make a Stamina saving throw against the spell. On a success, the spell ends."
         },
         "CurseOfAgony": {
            "Label": "Curse of Agony",
            "Description": "You curse one living target within range with searing agony, setting their nervous system ablaze. Make a ranged spell attack against the target. On a hit, the target suffers 2d4 fel damage. At the beginning of every round, the caster must succeed on a sigil roll to affect the target again.<br>Also, so long as the spell is active, the target is treated as if they gained a level of exhaustion for one round (even if they are normally immune to the condition, so long as they are living) until the beginning of their turn in the next round. If the ranged spell attack misses, the spell deals half the initial damage and has no other effect.",
            "Heightened": "The damage increases by one dice per every level above 2nd.<br><i>Special</i>: Whenever the sigil roll succeeds, the target takes 1d4 additional damage the next round. This stacks up to a number of d4s equal to the spell level."
         },
         "DetectMagic": {
            "Label": "Detect Magic",
            "Description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
         },
         "FalseLife": {
            "Label": "False Life",
            "Description": "Bolstering yourself with a necromantic facsimile of life, you gain 1d4 + 4 Temporary Hit Points for the Duration.",
            "Heightened": "When you cast this spell using a spell slot of 2nd level or higher, you gain 5 additional Temporary Hit Points for each slot level above 1st."
         },
         "FeignDeath": {
            "Label": "Feign Death",
            "Description": "You touch a willing creature and put it into a cataleptic state that is indistinguishable from death.<br>For the spell’s duration, or until you use an action to touch the target and dismiss the spell, the target appears dead to all outward inspection and to spells used to determine the target’s status. The target is blinded and incapacitated, and its speed drops to 0. The target has resistance to all damage except psychic damage. If the target is diseased or poisoned when you cast the spell, or becomes diseased or poisoned while under the spell’s effect, the disease and poison have no effect until the spell ends."
         },
         "FleshToStone": {
            "Label": "Flesh to Stone",
            "Description": "You attempt to turn one creature that you can see within range into stone. If the target’s body is made of flesh, the creature must make a Constitution saving throw. On a failed save, it is Restrained as its flesh begins to harden. On a successful save, the creature isn’t affected.<br>A creature Restrained by this spell must make another Constitution saving throw at the end of each of its turns. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to stone and subjected to the Petrified condition for the Duration. The successes and failures don’t need to be consecutive; keep track of both until the target collects three of a kind.<br>If the creature is physically broken while Petrified, it suffers from similar deformities if it reverts to its original state.<br>If you maintain your Concentration on this spell for the entire possible Duration, the creature is turned to stone until the effect is removed."
         },
         "Fly": {
            "Label": "Fly",
            "Description": "You touch a willing creature. The target gains a flying speed of 60 feet for the Duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.",
            "Heightened": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd."
         },
         "FogCloud": {
            "Label": "Fog Cloud",
            "Description": "You create a 20-foot-radius Sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the Duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.",
            "Heightened": "When you cast this spell using a spell slot of 2nd level or higher, the radius of the fog increases by 20 feet for each slot level above 1st."
         },
         "GaseousForm": {
            "Label": "Gaseous Form",
            "Description": "You transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn't affected.<br>While in this form, the target's only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and Constitution saving throws. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can't fall and remains hovering in the air even when stunned or otherwise incapacitated.<br>While in the form of a misty cloud, the target can't talk or manipulate objects, and any objects it was carrying or holding can't be dropped, used, or otherwise interacted with. The target can't attack or cast spells."
         },
         "Haste": {
            "Label": "Haste",
            "Description": "Choose a willing creature that you can see within range. Until the spell ends, the target’s speed is doubled, it gains a +2 bonus to AC, it has advantage on Dexterity Saving Throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.<br>When the spell ends, the target can’t move or take Actions until after its next turn, as a wave of lethargy sweeps over it."
         },
         "HolyLight": {
            "Label": "Holy Light",
            "Description": "With the grace of the Holy Light, you bring life to the living, and harm to the unsanctified. The creature you target regains a number of hit points equal to 1d8 + your spellcasting ability modifier. If you target an undead or a fiend with this ability, they take holy damage equal to the hit points they would normally gain. If you target an unwilling creature, you require a ranged spell attack.<br>Constructs gain no benefit from this spell.",
            "Heightened": "The healing increases by 1d8 per level above 1st."
         },
         "MageArmor": {
            "Label": "Mage Armor",
            "Description": "You touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action."
         },
         "MageHand": {
            "Label": "Mage Hand",
            "Description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the Duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again. You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it. The hand can't Attack, activate magical items, or carry more than 10 pounds."
         },
         "ManaBurn": {
            "Label": "Mana Burn",
            "Description": "You target a creature that has mana within 30 feet. A ray of black-purple anti-magic leaps out, and strikes the target, draining them of mana. You must make a ranged spell attack with the ray. On a success, the target loses 1d4 + 1 mana points. For every mana point lost, the target takes two points of arcane damage. The target is entitled a Spirit saving throw. On a success, the mana and hit points lost are halved.",
            "Heightened": "The number of mana points drained increases by 1d4 points per every two levels above 2 (2d4 at level 4, 3d4 at level 6, 4d4 at level 8). Special: Demons always have active mana, and can always be targeted with mana burn. If they have no mana, they still take 2 points of arcane damage."
         },
         "ModifyMemory": {
            "Label": "Modify Memory",
            "Description": "You attempt to reshape another creature’s memories. One creature that you can see must make a Wisdom saving throw. If you are fighting the creature, it has advantage on the saving throw. On a failed save, the target becomes Charmed by you for the Duration. The charmed target is Incapacitated and unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and none of the target’s memories are modified.<br>While this charm lasts, you can affect the target’s memory of an event that it experienced within the last 24 hours and that lasted no more than 10 minutes. You can permanently eliminate all memory of the event, allow the target to recall the event with perfect clarity and exacting detail, change its memory of the details of the event, or create a memory of some other event.<br>You must speak to the target to describe how its memories are affected, and it must be able to understand your language for the modified memories to take root. Its mind fills in any gaps in the details of your description. If the spell ends before you have finished describing the modified memories, the creature’s memory isn’t altered. Otherwise, the modified memories take hold when the spell ends.<br>A modified memory doesn’t necessarily affect how a creature behaves, particularly if the memory contradicts the creature’s natural inclinations, Alignment, or beliefs. An illogical modified memory, such as implanting a memory of how much the creature enjoyed dousing itself in acid, is dismissed, perhaps as a bad dream. The DM might deem a modified memory too nonsensical to affect a creature in a significant manner.<br>A Remove Curse or Greater Restoration spell cast on the target restores the creature’s true memory.",
            "Heightened": "If you cast this spell using a spell slot of 6th level or higher, you can alter the target’s memories of an event that took place up to 7 days ago (6th level), 30 days ago (7th level), 1 year ago (8th level), or any time in the creature’s past (9th level)."
         },
         "Mute": {
            "Label": "Mute",
            "Description": "Concentration, up to 1 minute You target a creature within range, forcing it to make a Spirit saving throw. If it fails, the target is isolated from all sound, causing it to be silenced and deafened. This prevents it from performing the verbal components of spells, and rendering it immune to Thunder damage and effects of a spell equal to the spell's level or lower.",
            "Heightened": "You may target another creature within 30 feet of the original target for every 2 spell levels above 2nd (2 creatures at level 4, 3 at level 6, and 4 at level 8)."
         },
         "Polymorph": {
            "Label": "Polymorph",
            "Description": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a Wisdom saving throw to avoid the effect. The spell has no effect on a Shapechanger or a creature with 0 Hit Points.<br><br>The transformation lasts for the Duration, or until the target drops to 0 Hit Points or dies. The new form can be any beast whose Challenge rating is equal to or less than the target’s (or the target’s level, if it doesn’t have a challenge rating). The target’s game statistics, including mental Ability Scores, are replaced by the Statistics of the chosen beast. It retains its Alignment and personality.<br><br>The target assumes the Hit Points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn’t reduce the creature’s normal form to 0 hit points, it isn’t knocked Unconscious.<br><br>The creature is limited in the Actions it can perform by the Nature of its new form, and it can’t speak, cast Spells, or take any other action that requires hands or speech.<br><br>The target’s gear melds into the new form. The creature can’t activate, use, wield, or otherwise benefit from any of its Equipment."
         },
         "ProduceFlame": {
            "Label": "Produce Flame",
            "Description": "A flickering flame appears in your hand. The flame remains there for the Duration and harms neither you nor your Equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again. You can also Attack with the flame, although doing so ends the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell Attack. On a hit, the target takes 1d8 fire damage. This spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
         },
         "Prestidigitation": {
            "Label": "Prestidigitation",
            "Description": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical Effects within range. If you cast this spell multiple times, you can have up to three of its non-instantaneous Effects active at a time, and you can dismiss such an Effect as an action.",
            "Options": {
               "1": "You create an Instantaneous, harmless sensory Effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.",
               "2": "You instantaneously light or snuff out a Candle, a torch, or a small campfire.",
               "3": "You instantaneously clean or soil an object no larger than 1 cubic foot.",
               "4": "You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.",
               "5": "You make a color, a small mark, or a Symbol appear on an object or a surface for 1 hour.",
               "6": "You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn."
            }
         },
         "RayOfEnfeeblement": {
            "Label": "Ray of Enfeeblement",
            "Description": "A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends.<br>At the end of each of the target's turns, it can make a Constitution saving throw against the spell. On a success, the spell ends."
         },
         "ResilientSphere": {
            "Label": "Resilient Sphere",
            "Description": "A sphere of shimmering force encloses a creature or object of Large size or smaller within range. An unwilling creature must make a Dexterity saving throw. On a failed save, the creature is enclosed for the Duration.<br><br>Nothing—not physical Objects, energy, or other spell effects—can pass through the barrier, in or out, though a creature in the sphere can breathe there. The sphere is immune to all damage, and a creature or object inside can’t be damaged by attacks or Effects originating from outside, nor can a creature inside the sphere damage anything outside it.<br><br>The sphere is weightless and just large enough to contain the creature or object inside. An enclosed creature can use its action to push against the sphere’s walls and thus roll the sphere at up to half the creature’s speed. Similarly, the globe can be picked up and moved by other creatures.<br><br>A Disintegrate spell targeting the globe destroys it without harming anything inside it."
         },
         "Revivify": {
            "Label": "Revivify",
            "Description": "You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can't return to life a creature that has died of old age, nor can it restore any missing body parts."
         },
         "RuneArray": {
            "Label": "Rune Array",
            "Description": "You gain one rune of the below array. If any spell of this array is used, you may release the rune, granting you the benefit of a runic strike as if you sacrificed mana for a spell of the rune you chose:<br><br><ul><li><i>Plague Rune (DKN 1)</i>: Your weapon deals 1d6 extra points of damage on its first attack in a given round. The damage can be cold or poison.</li><li><i>Frozen Waste Rune (DKN 1)</i>: Your weapon deals 1d4 extra points of damage on its first attack in a given round. The damage can be cold or shadow.</li><li><i>Blood Rune (DKN 2)</i>: Your weapon deals 1d4 extra points of damage on its first attack in a given round. The damage can be fire or fel.</li><li><i>Vampiric Rune (DKN 2)</i>: After you make this attack, you regain a number of hit points equal to half the total weapon damage you dealt (weapon dice, Strength, plus any bonuses from the weapon only). You may grant this healing to any ally within 30 feet. This healing has no effect on constructs. This applies to your first attack in a given round.</li><li><i>Worm Rune (DKN 4)</i>: While under the effects of this rune, your strikes infuse the enemy with a virulent magical ailment that spawns a worm under the target‘s skin. A living target suffers 2d6 damage every round so long as the target is not healed from the incubating worm. If the target loses at least 10 hit points from the bleeding, the worms increase in size, and form a visible tumor under the target‘s skin. At this point, releasing the rune has an additional effect. If the target is subject to a healing spell, roll 1d4. On the result of a 3 or higher, the worms shrivel and die without effect.</li></ul><br><h4>Release</h4>Releasing the rune has the following effect when released.<br><br><ul><li><i>Frozen Wastes Rune</i>: The target of the Death Knight‘s Runic Strike instantly suffers 2d4 extra points of damage of the rune‘s type, the target is chilled for one round.</li><li><i>Blood Rune</i>: If releasing the rune with a Runic Strike, the target takes bleed damage equal the damage the rune dealt for one minute. A successful Stamina save halves the damage and the duration.</li><li><i>Worms Rune</i>: If the worm deals at least 10 hit points of damage and is released, it explodes into a spray of blood. The target must succeed on a Stamina saving throw or suffer the 2d6 shadow damage. Also, regardless if the target succeeds or fails on the saving throw, the amount of hit points the worm gathered heals all undead creatures you designate within 30 feet, or harms all living creatures you designate within the same range. The amount of healing or harm is equal to the amount of hit points it dealt when incubating.</li></ul>",
            "Heightened": "<ul><li><i>Plague Rune</i>: The base damage increases by 1d6 damage per level above 1st.</li><li><i>Blood and Frozen Wastes Runes</i>: The damage taken per hit increases by 1d4 per spell level.</li></ul>"
         },
         "SeeInvisibility": {
            "Label": "See Invisibility",
            "Description": "For the duration, you see invisible creatures and objects as if they were visible, and you can see into the Ethereal Plane. Ethereal creatures and objects appear ghostly and translucent."
         },
         "Silence": {
            "Label": "Silence",
            "Description": "For the Duration, no sound can be created within or pass through a 20-foot-radius Sphere centered on a point you choose within range. Any creature or object entirely inside the Sphere is immune to thunder damage, and creatures are Deafened while entirely inside it. Casting a Spell that includes a verbal component is impossible there."
         },
         "StinkingCloud": {
            "Label": "Stinking Cloud",
            "Description": "You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.<br>Each creature that is completely within the cloud at the start of its turn must make a Constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don't need to breathe or are immune to poison automatically succeed on this saving throw.<br>A moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round."
         },
         "Stoneskin": {
            "Label": "Stoneskin",
            "Description": "This spell turns the flesh of a willing creature you touch as hard as stone. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage."
         },
         "Strangulate": {
            "Label": "Strangulate",
            "Description": "Choose a humanoid that you can see within range. The target must succeed on a Stamina saving throw or be paralyzed and lifted ten feet above the ground for the duration. On each of their turns, the target may make another saving throw. On a success, the spell ends for the target, and they drop without taking falling damage. While the creature is paralyzed this way, they are also choking. After the spell‘s effects end, the target is affected by the mute spell for one round per round of complete strangulation."
         },
         "TelepathicBond": {
            "Label": "Telepathic Bond",
            "Description": "You forge a telepathic link among up to eight willing creatures of your choice within range, psychically linking each creature to all the others for the duration. Creatures with Intelligence scores of 2 or less aren’t affected by this spell.<br>Until the spell ends, the targets can communicate telepathically through the bond whether or not they have a common language. The communication is possible over any distance, though it can’t extend to other planes of existence."
         },
         "Thaumaturgy": {
            "Label": "Thaumaturgy",
            "Description": "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical Effects within range. If you cast this spell multiple times, you can have up to three of its 1-minute Effects active at a time, and you can dismiss such an Effect as an action.",
            "Options": {
               "1": "Your voice booms up to three times as loud as normal for 1 minute.",
               "2": "You cause flames to flicker, brighten, dim, or change color for 1 minute.",
               "3": "You cause harmless tremors in the ground for 1 minute.",
               "4": "You create an Instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.",
               "5": "You instantaneously cause an unlocked door or window to fly open or slam shut.",
               "6": "You alter the Appearance of your eyes for 1 minute."
            }
         },
         "TrueSeeing": {
            "Label": "True Seeing",
            "Description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet."
         },
         "VampiricTouch": {
            "Label": "Vampiric Touch",
            "Description": "The touch of your shadow-wreathed hand can siphon life force from others to heal your wounds. Make a melee spell attack against a creature within your reach. On a hit, the target takes 3d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action.",
            "Heightened": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd."
         }
      },
      "SpellRules": {
         "SpellSchools": {
            "Abjuration": "Abjuration",
            "Conjuration": "Conjuration",
            "Divination": "Divination",
            "Enchantment": "Enchantment",
            "Evocation": "Evocation",
            "Illusion": "Illusion",
            "Necromancy": "Necromancy",
            "Transmutation": "Transmutation"
         },
         "Range": {
            "Self": "self"
         },
         "Components": {
            "Somatic": "Somatic",
            "Verbal": "Verbal"
         },
         "SpellCategories": {
            "Strike": "Strike spells modify a successful attack. See Chapter 9 for more details on strike effects. Strike and shot effects also usually a potential number of attacks equal to double the spell level. For instance, using kill shot as a 2nd level spell enhances 4 ranged attacks. The caster can have multiple potential strikes active, but cannot apply two shot or strike abilities to the same attack unless otherwise specified."
         }
      },
      "Talents": {
         "ActionSurge": {
            "Label": "Action Surge",
            "Description": {
               "1": {
                  "Value": "You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action. Once you use this feature, you must finish a short before you can use it again. This talent can be taken again at level 17 for another use."
               }
            }
         },
         "Aggressive": {
            "Label": "Aggressive",
            "Description": {
               "1": {
                  "Value": "You may use your bonus action to take the Dash action, but only to approach a hostile creature that you can see."
               }
            }
         },
         "AgileLeap": {
            "Label": "Agile Leap",
            "Description": {
               "1": {
                  "Value": "You may use a bonus action to leap, moving at half your total speed. This movement does not provoke reactions. If you have the ability to glide, hover, or fly (via spell, gadget, or ability), you may choose to use this ability in mid-air (effectively changing your trajectory as a double-jump). This jump also counts as a dash for the purposes of other abilities."
               },
               "2": {
                  "Value": "You are treated as if you always benefit from the jump spell."
               }
            }
         },
         "BerserkerRage": {
            "Label": "Berserker Rage",
            "Description": {
               "1": {
                  "Value": "You may cast the berserker rage spell on yourself as a bonus action. This rage continues until you end it with a bonus action, or until the rage ends early (as per the spell‘s description)."
               },
               "2": {
                  "Value": "This spell cannot be dispelled, but can be overwhelmed by a calm emotions spell or similar effect that would suppress this ability, and does not prevent use of spell-like abilities derived from talents. You can enter a rage this way a number of times equal to your proficiency bonus before replenishing on a long rest."
               },
               "3": {
                  "Value": "You can take this talent again. If you do so, you do not gain a level of exhaustion at the end (regardless of how long you rage)"
               },
               "4": {
                  "Value": "If you reach 9th level of Warrior, your rage only ends if you are knocked unconscious or if you end it willingly."
               }
            }
         },
         "Bladestorm": {
            "Label": "Bladestorm",
            "Description": {
               "1": {
                  "Value": "You may enter this stance with an action. While in this stance, you whirl with your weapon outstretched, automatically dealing your melee weapon damage to all creatures within the weapon‘s reach of you. This damage is treated as an area effect. Affected targets are entitled an Agility saving throw to halve the damage. You can apply strike effects, but they affect only targets who failed their saving throw, and one strike affects one target."
               },
               "2": {
                  "Value": "You cannot take any other actions in this stance other than maintaining it. You can enter this stance a number of times equal to your proficiency bonus before replenishing on a short rest, and the effects of it remaining until the beginning of your turn in the next round unless you extend it using the same actions."
               },
               "3": {
                  "Value": "While in this stance, you have advantage against all movement-impairing effects or effects that result in loss of control for your character, and you do not provoke reactions from movement from a creature who has failed their saving throw to half damage. Your speed, however, is halved in this stance. If you are unable to use your action, or if you cannot move at least 5 feet every round, this stance ends. If you are in this stance more than 3 rounds, you gain the incapacitated condition for after you are finished. The condition remains for 1 round per round you were in the stance beyond the first three."
               }
            }
         },
         "BrutalCritical": {
            "Label": "Brutal Critical",
            "Description": {
               "1": {
                  "Value": "You can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee weapon attack. This talent can be taken again up to two times (resulting in three additional dice)."
               }
            }
         },
         "BurningBlades": {
            "Label": "Burning Blades",
            "Description": {
               "1": {
                  "Value": "As a bonus action, you can ignite any number of weapons you are wielding with magical energies. The weapon acts as if it gained the Elemental Damage Infusion (deals 1d6 extra elemental damage) for 1 minute and becomes magical. If you end your turn without attacking a target (without necessarily hitting them), the weapon loses the infusion and is extinguished. You have a number of uses of this ability (and can ignite a total number of weapons) equal to your Strength or Stamina modifier (minimum 1)."
               },
               "2": {
                  "Value": "Despite the talent‘s name, you can choose which damage type the weapon deals (not necessarily fire) upon gaining this talent. You regain all the uses of this ability at the end of a long rest. You can regain a single use if you kill or reduce a creature to 0 hit points, so long as that creature can deal the same type of elemental damage (such as by spell, attack, or aura)."
               }
            }
         },
         "Camouflage": {
            "Label": "Camouflage",
            "Description": {
               "1": {
                  "Value": "You can use the Hide action as a bonus action on your turn. If you are also proficient with the Agility (Stealth) skill, you may cast the invisibility spell by spending an action and a bonus action. After being used, the spell cannot be used again until after a short rest. Also, you can‘t be tracked by nonmagical means, unless you choose to leave a trail, even outside your favored terrain (if you have one)."
               }
            }
         },
         "CloakOfShadows": {
            "Label": "Cloak of Shadows",
            "Description": {
               "1": {
                  "Value": "You cloak yourself with bits of the fading shadows of mana, hiding even from the effects of spells that affect you."
               },
               "2": {
                  "Value": "As an Action, you can cloak yourself with magical shadows for until the end of your turn in the next round. Any spell of a spell level less than one-half your level (round down) cast upon you can't affect you or anything you hold. Such a spell can target you or something you hold, but the spell has no effect. Similarly, your area is excluded from the areas affected by such spells. You can activate your Cloak of Shadows ability for a total number of rounds equal to one-half your level, replenishing on a long rest, and can extend an active cloak of shadows with no action so long as you have remaining rounds."
               },
               "3": {
                  "Value": "You may cloak yourself as a reaction instead, but each round consumed this way costs double the normal number of rounds of this ability. This effect otherwise acts as a globe of invulnerability spell of a spell level equal to one-half your level (round down). "
               }
            }
         },
         "CunningAction": {
            "Label": "Cunning Action",
            "Description": {
               "1": {
                  "Value": "Your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat to use the following action: Dash, Disengage, or Hide."
               }
            }
         },
         "DangerSense": {
            "Label": "Danger Sense",
            "Description": {
               "1": {
                  "Value": "You gain an uncanny sense of when things nearby aren‘t as they should be, giving you an edge when you dodge away from danger. You have advantage on Agility saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can‘t be blinded, deafened, or incapacitated. You must be able to see the effect before it takes place (such as seeing a character cast a spell or the outer mechanism of the trap)."
               }
            }
         },
         "DarkRanger": {
            "Label": "Dark Ranger",
            "Description": {
               "1": {
                  "Value": "You add the following spells to your hunter spell list: banshee‟s curse, death coil, death pact, drain life, death ward, and silence. You may also add undead to the list of creatures you can bind and conjure (allowing you to also charm and dominate undead)."
               }
            }
         },
         "DefensiveStance": {
            "Label": "Defensive Stance",
            "Description": {
               "1": {
                  "Value": "You may enter this stance with a bonus action. While in this stance, you have resistance against piercing damage."
               },
               "2": {
                  "Value": "This stance is broken if you move more than half your full movement in a single round, or if you are no longer using a shield."
               }
            }
         },
         "DeflectMissiles": {
            "Label": "Deflect Missiles",
            "Description": {
               "1": {
                  "Value": "You can use your reaction to deflect or catch a ranged weapon attack you are hit by. When you do so, the damage you take from the attack is reduced by 1d10 + your Strength or Agility modifier (your choice) + your level."
               },
               "2": {
                  "Value": "If you reduce the damage to 0 and you have at least 2 Monk levels, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack. The range of this ability is 20/60 feet."
               }
            }
         },
         "DireStrike": {
            "Label": "Dire Strike",
            "Description": {
               "1": {
                  "Value": "You strike at a vulnerable place in the target's body when you may deal your sneak attack damage. Instead of dealing extra sneak attack damage, you may impose a condition on the target on a failed Stamina saving throw. The weapon damage type determines the condition, chosen from the below."
               },
               "2": {
                  "Options": {
                     "1": "<i>Blinded (any)</i>: The target is blinded for until the end of their turn in the next round.",
                     "2": "<i>Kidney Shot (piercing or bludgeoning, requires level 5)</i>: The target is stunned until the end of their turn in the next round.",
                     "3": "<i>Rupture (slashing or piercing)</i>: The target gains the bleeding condition for 1 minute, with the value of blood loss equal to your Agility modifier. Furthermore, unless they take precautions, they leave a trail of blood behind them. The creature can attempt another Stamina saving throw at the beginning of every round to end this effect. Creatures that don't have blood (or do not require it to survive) cannot be harmed by bleeding.",
                     "4": "<i>Sap (bludgeoning)</i>: The creature is charmed for one minute and looks visibly dazed and flat-footed. While charmed by this effect, the creature is incapacitated and has a speed of 0. The effect ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor. The creature can attempt another Stamina saving throw once every round to end this effect. Once a creature is affected by this ability, it is immune to it until it performs a short rest."
                  }
               },
               "3": {
                  "Value": "For each saving throw attempt the target makes against a dire strike ability, they gain a cumulative +1 to their saving throws against this ability. This applies to saving throws rolled every round as well as new applications of effects that were already chosen. The bonus to saving throws remains for up to 24 hours. If the rupture strike, for example, has a DC of 14 the first round, the DC decreases to 13 the second round, and 12 the third round. If choosing kidney shot, the DC decreases the more the ability is applied."
               }
            }
         },
         "DreadAmbusher": {
            "Label": "Dread Ambusher",
            "Description": {
               "1": {
                  "Value": "You master the art of the ambush. You gain a bonus your initiative rolls equal to your Spirit modifier. Also, the start of your first turn of each combat encounter, your speed increases by 10 feet, which lasts until the end of that turn. When you retreat from combat, you have advantage to any Agility (Stealth) check to escape being pursued."
               }
            }
         },
         "Elusive": {
            "Label": "Elusive",
            "Description": {
               "1": {
                  "Value": "You are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren‘t incapacitated."
               }
            }
         },
         "EssenceTouch": {
            "Label": "Essence Touch",
            "Description": {
               "1": {
                  "Value": "Whenever you touch a creature with innate special abilities (such as innate spellcasting), you can gain one use of their innate special abilities, usable only once before the essence fades away. This costs no mana, but you cannot steal an ability that is also a spell unless you had the level to cast it normally. Monks referring to their ki spell ability for the purposes of this talent."
               }
            }
         },
         "Evasion": {
            "Label": "Evasion",
            "Description": {
               "1": {
                  "Value": "You can nimbly dodge out of the way of certain area effects, such as a dragon‘s fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make an Agility saving throw to take half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
               }
            }
         },
         "Execute": {
            "Label": "Execute",
            "Description": {
               "1": {
                  "Value": "Your attack carries with it the weight of doom. If you successfully deal damage with this strike effect against a bloodied target, the attack deals 50% extra damage."
               },
               "2": {
                  "Value": "After being used, this cannot be used again until after a short rest. If the target is killed or reduced to 0 hit points by this strike, you regain the use of it. If the target has any ability that would prevent it from being reduced to 0 hit points when it otherwise should have (such as the Relentless talent, the Undead Fortitude trait, or similar ability that would allow an escape) it must make a Stamina saving throw against your DC or else it fails and it is reduced to 0 hit points."
               },
               "3": {
                  "Value": "This talent can be taken multiple times, each time adding another use before requiring a short rest. This is a strike effect."
               }
            }
         },
         "FadingShadow": {
            "Label": "Fading Shadow",
            "Description": {
               "1": {
                  "Value": "You may cast the blink step spell. After being used, this cannot be used again until after a short rest. This talent can be taken multiple times, each time adding another two uses of this ability before a short rest. If your level is 9, each use acts as the dimension door spell instead."
               }
            }
         },
         "FanOfKnives": {
            "Label": "Fan of Knives",
            "Description": {
               "1": {
                  "Value": "Whenever you use an action to attack with a light throwing weapon (such as daggers, darts, light hammers, handaxes, or javelins), you may throw another of the same type as part of the same attack action. You may still use two-weapon fighting to throw a third weapon as a bonus action. This stacks with the Extra Attack feature, if you possess it (adding one thrown attack with the first action for each extra attack)."
               },
               "2": {
                  "Value": "You may instead spend your action and bonus action to release the same number of weapons as a 20-foot sphere (all around you), a 15-foot cone (in a quarter-circle), or a line 30 feet long, 5 feet wide in any direction you choose. This requires throwing up to three weapons, and deals damage as if they all hit, with an Agility saving throw to half damage."
               },
               "3": {
                  "Value": "If you have the Sneak Attack feature, you may add one additional point of damage per sneak attack dice to the total damage, but only if the target qualifies for a sneak attack. This is an area effect."
               }
            }
         },
         "Farsight": {
            "Label": "Farsight",
            "Description": {
               "1": {
                  "Value": "You increase the range of all ranged weapons of one type (crossbows, bows, firearms, axes, etc.) by half."
               }
            }
         },
         "FavoredByElune": {
            "Label": "Favored By Elune",
            "Description": {
               "1": {
                  "Value": "You may add the find familiar spell to your spell list, but may only choose an owl as a familiar. Furthermore, your link to your owl familiar is 250 feet, instead of the normal 100 feet. If you are standing in moonlight, the link becomes 500 feet instead. If you later choose the Beastmaster Hunter archetype, you may make your familiar your bonded creature, in which case the creature is treated as both a familiar and hunter‘s companion."
               }
            }
         },
         "FavoredEnemy": {
            "Label": "Favored Enemy",
            "Description": {
               "1": {
                  "Value": "You may use the Favored Enemy ability as a 1st level Hunter, or choose another favored enemy if you normally have it (such as by being a hunter). You cannot take this talent more than 3 times."
               }
            }
         },
         "FeralSenses": {
            "Label": "Feral Senses",
            "Description": {
               "1": {
                  "Value": "You gain preternatural senses that help you fight creatures you can‘t see. When you attack a creature you can‘t see, your inability to see it doesn‘t impose disadvantage on your attack rolls against it. You also permanently benefit from the see invisibility spell as if you cast it, but only so long as the enemy is within 60 feet."
               }
            }
         },
         "FlashBomber": {
            "Label": "Flash Bomber",
            "Description": {
               "1": {
                  "Value": "You may use a bonus action or reaction to activate or make use of the Use Object action for alchemical items or explosives. This may be used at a number of times equal to your Intelligence modifier before a short rest."
               }
            }
         },
         "FocusedAttack": {
            "Label": "Focused Attack",
            "Description": {
               "1": {
                  "Value": "You may choose to deal focused attacks instead of risking missed attacks. Whenever you score a successful ranged attack and have any remaining attacks (such as from the Extra Attack feature or the haste spell), you may spend the extra attacks to add the minimum possible damage the weapon attack to your damage result. The damage is resolved as made by one weapon attack (and uses one point of ammunition as normal, or one malfunction check). For instance, if you successfully deal a longbow ranged attack for 1d8 + 4, and have an additional attack from the haste spell, you may expend the attack to add 5 points of damage to the initial attack (for a total of 1d8 + 9) damage."
               }
            }
         },
         "Hamstring": {
            "Label": "Hamstring",
            "Description": {
               "1": {
                  "Value": "As a strike, you may cut a target‘s hamstring. The target‘s movement speed is reduced by 10 feet for one minute. Also, whenever they move more than half their speed or whenever they use the Dash action, they fall prone. The target (or an ally) may use an action to roll a Stamina saving throw against this ability, which ends the condition. It ends automatically at the end of a short rest. This speed reduction can be applied multiple times, to a minimum speed of 0 (in which case the target is treated as if restrained). This is a strike effect. This strike can be used a number of times equal to your proficiency bonus, with the uses replenishing at the end of a short rest."
               }
            }
         },
         "HeroicLeap": {
            "Label": "Heroic Leap",
            "Description": {
               "1": {
                  "Value": "You may make a heroic leap, jumping up to twice your normal distance, and can spend an action at the end. If the action is a melee attack roll, it deals damage equal to your normal weapon damage in a 10-foot sphere, centered on the area you landed on, with an Agility saving throw to half damage. The ground is also turned into difficult terrain (such as rubble) if applicable. Once used, this talent cannot be used again until after a short rest."
               }
            }
         },
         "HeroicThrow": {
            "Label": "Heroic Throw",
            "Description": {
               "1": {
                  "Value": "You may throw a weapon further than it can normally go, or throw a melee weapon that does not have that property. You may increase the range of an existing thrown weapon by 60 feet, or give a melee weapon the thrown property (20/60 feet) for one round."
               },
               "2": {
                  "Value": "On a hit, the weapon can either return to you after being thrown at a target, or knock the target prone (Agility save negates), dropping 5 feet from the target. This is a strike effect."
               }
            }
         },
         "HuntersSense": {
            "Label": "Hunter's Sense",
            "Description": "You can cast the scrying spell, but can only affect a creature detected by primeval alertness or a favored enemy. The creature must be within 10 miles of you to be affected by this ability. You may use this ability once per long rest. This talent can be taken multiple times, each time increasing the times this ability can be used per long rest by two."
         },
         "Indomitable": {
            "Label": "Indomitable",
            "Description": "You can reroll a saving throw that you fail. If you do so, you must use the new roll, even if it is lower than the initial roll. You may use this talent a number of times equal to one half your proficiency bonus."
         },
         "IndomitableMight": {
            "Label": "Indomitable Might",
            "Description": "If you roll a Strength check and the results are less than your Strength score, treat the result as your Strength score instead."
         },
         "InsightfulFighting": {
            "Label": "Insightful Fighting",
            "Description": "You gain the ability to decipher an opponent's tactics and develop a counter to them. As a bonus action, you can make a Spirit (Insight) check against a creature you can see that isn‘t incapacitated, contested by the target‘s Charisma (Deception) check. If you succeed, you can use your Sneak Attack against that target even if you don‘t have advantage on the attack roll, but not if you have disadvantage, so long as you spend your bonus action to maintain this effect. This benefit lasts for 1 minute or until you successfully use this feature against a different target."
         },
         "InsightfulManipulator": {
            "Label": "Insightful Manipulator",
            "Description": "If you spend at least 1 minute observing or interacting with another creature outside combat, you can learn certain information about its capabilities compared to your own. The DM tells you if the creature is your equal, superior, or inferior in regard to two of the following characteristics of your choice:<br><br><ul><li>Intelligence, Spirit, or Charisma scores</li><li>Class levels (if any)</li></ul><br>At the DM‘s option, you might also realize you know a piece of the creature‘s history or one of its personality traits, if it has any."
         },
         "IronWilledHunter": {
            "Label": "Iron Willed Hunter",
            "Description": "You have honed your ability to resist mind-altering powers. You gain proficiency in Spirit saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice)."
         },
         "LandsStride": {
            "Label": "Land's Stride",
            "Description": "You may move through nonmagical difficult terrain without spending extra movement, and gain a +10 bonus to your speed. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangling roots spell."
         },
         "MagicUsersNemesis": {
            "Label": "Magic User's Nemesis",
            "Description": "You can thwart someone else‘s magic. When you see a creature casting a spell or teleporting within 30 feet of you, you can use your reaction to try to foil it, either by using your own magic (if you can access spells), or an attack roll (by using a ranged or thrown weapon). The creature must succeed on a Spirit saving throw against your spell save DC or you must succeed on an attack roll, otherwise its spell or teleport fails and is wasted."
         },
         "MasterManipulator": {
            "Label": "Master Manipulator",
            "Description": "You can use the Help action as a bonus action. Additionally, when you use the Help action to aid an ally in attacking a creature, the target of that attack can be within 30 feet of you, rather than within 5 feet of you, if the target can see or hear you. You also gain proficiency with the disguise and forgery kits, and one gaming set of your choice. You also learn two languages of your choice. Lastly, you can unerringly mimic the speech patterns and accent of a creature that you hear speak for at least 1 minute, enabling you to pass yourself off as a native speaker of a particular land, provided that you know the language."
         },
         "Misdirection": {
            "Label": "Misdirection",
            "Description": "You can sometimes cause another creature to suffer an attack meant for you. When you are targeted by an attack while a creature within 5 feet of you is granting you cover against that attack, you can use your reaction to have the attack target that creature instead of you."
         },
         "MutilateStrike": {
            "Label": "Mutilate Strike",
            "Description": "Whenever you can attack as a bonus action with an off-hand weapon, you may instead add the off-hand damage to your main attack action, while retaining your bonus action. Your bonus action cannot be used to attack the same round after using this strike. Once used, this talent cannot be used again for three rounds."
         },
         "NaturalExplorer": {
            "Label": "Natural Explorer",
            "Description": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or caves and underground. When you make an Intelligence or Spirit check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you‘re proficient in. This ability works on any plane so long as it has a terrain of comparable nature (desert covers both Tanaris in Azeroth and Outland‘s Hellfire Peninsula). While traveling for an hour or more in your favored terrain, you gain the following benefits:<br><br><ul><li>Difficult terrain doesn‘t slow your group‘s travel.</li><li>Your group can‘t become lost except by magical means.</li><li>Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger, and have advantage to checks to avoid being surprised in your favored terrain.</li><li>You have advantage to saving throws against natural hazards in your favored terrain.</li><li>You can move stealthily at your normal pace without slowing down.</li><li>When you forage or gather, you find twice as much food as you normally would.</li><li>While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area.</li></ul><br>You may switch an existing favored terrain by performing all the following tasks, focused on one terrain:<br><ul><li>Track a target or explore the area for at least one hour alone</li><li>Spend 7 days in the terrain</li><li>Hunt down and defeat one native creature (though you do not have to defeat it alone).</li></ul><br>This talent can be taken multiple times, each time adding one favored terrain mastered at a given time."
         },
         "PrimevalAlertness": {
            "Label": "Primeval Alertness",
            "Description": "Whenever you are subjected to an effect that attempts to detect or identify you (such as a scrying spell), you gain advantage to all saving throws versus such effects. If you succeed on a contested Spirit saving throw, you can also reverse the spell (if possible, gaining a momentary glimpse of who is attempting to scry on you)."
         },
         "PrimevalAwareness": {
            "Label": "Primeval Awareness",
            "Description": "You gain awareness of your environment on a local scale. You can use your action and expend mana equal to any spell to gain primeval awareness. For 1 minute per level of the spell you expended, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain, are on high ground compared to them, or if the target is a favored enemy): aberrations, celestials, dragons, elementals, fey, fiends,and undead.<br>This feature doesn‘t reveal the creatures‘ location or number, but does hint at their strength in rough terms (weaker, equal to you, or stronger than you, more numerous than you, wounded) and their general direction."
         },
         "PrimevalDisruption": {
            "Label": "Primeval Disruption",
            "Description": "You can sense if a favored enemy is casting a divine or arcane spell (choose one upon gaining this talent) within 3 miles. You are also aware of their general direction. If the target is within 1 mile, you can spend a reaction to force them to roll a Spirit saving throw against being distracted. This ability can be used a number of times equal to your proficiency bonus before replenishing after a long rest. If there are multiple favored enemies within the radius, you get a general awareness of them, but cannot force a disruption, unless you are the closest creature to the target."
         },
         "RecklessAttack": {
            "Label": "Reckless Attack",
            "Description": "When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee attack rolls using Strength on this turn, but attack rolls against you have advantage until your next turn."
         },
         "Relentless": {
            "Label": "Relentless",
            "Description": "If you drop to 0 hit points and don't die outright, you can make a DC 10 Stamina saving throw. If you succeed, you drop to 1 hit point instead. Each time this is used, you increase the DC by 5 points. The DC resets once you complete a short rest. This is known as cheat death by hunters and rogues."
         },
         "ReliableTalent": {
            "Label": "Reliable Talent",
            "Description": "Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."
         },
         "Retaliation": {
            "Label": "Retaliation",
            "Description": "When you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature. This ability can be used a number of times equal to your proficiency bonus, with the uses replenishing after a short rest. This is also sometimes known as counterattack or storm of blades by hunters and rogues, respectively."
         },
         "SecondWind": {
            "Label": "Second Wind",
            "Description": "You have a limited well of stamina you can draw upon to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your warrior level. Once you use this feature, you must finish a short or long rest before you can use it again."
         },
         "Shockwave": {
            "Label": "Shockwave",
            "Description": "You slam your weapon (manufactured or natural) into the ground, creating a ripple of force that shoots outward. This deals damage equal to your weapon damage, and affects a line 5-foot thick and 30 feet long. All creatures in the area in contact with the ground or within 5 feet of it that succeed on an Agility saving throw take half damage. The terrain damaged becomes difficult terrain (such as rubble) if applicable. If you have extra attacks, you may spend them to add the minimum possible damage to your total. Once this talent is used, it cannot be used again until after a short rest."
         },
         "ShockResistance": {
            "Label": "Shock Resistance",
            "Description": "You are more resilient against effects that would otherwise shock or stun a normal creature. You have advantage to saving throws against any effect that would cause the stunned condition. If an effect causes the condition as a secondary effect, the advantage applies only against the condition."
         },
         "Shout": {
            "Label": "Shout",
            "Description": "You can channel your warrior spirit into powerful battlefield commands (called shouts), although it can be anything from a barking command, to a litany, a prayer, or even a song. You can give a number of shouts equal to your Stamina or Charisma modifier (choose one). Using a shout costs a bonus action, and you may maintain an active shout for until the end of your turn in the next round with another bonus action (up to 1 minute). This bonus action still allows you to use strike effects (as if it does not cost an action), but does not allow other abilities. Shouts have a range of 30 feet of the range of the spell specified.<br>Shouts can replicate certain auras or have an entirely unique effect.<br><br><ul><li><i>Battle Shout</i>: You cast the abandonment aura spell.</li><li><i>Defensive Shout</i>: You cast the devotion aura spell.</li><li><i>Disruptive Shout (requires 7th level)</i>: You cast the distraction aura spell.</li><li><i>Halting</i>: One target within range has their speed halved. You can use this shout as a reaction.</li><li><i>Invigorating</i>: You may activate this shout by maintaining it for three rounds against a single target within range. At the start of your turn on the fourth round, the target increases their maximum hit points by one-half your level for one hour (cannot exceed double their maximum hit points), or can spend a single healing dice to heal themselves.</li><li><i>Marching Orders (requires 5th level)</i>: You cast the crusader aura spell.</li><li><i>Rallying</i>: One target within range is affected as if you cast the heroism spell (treat your Stamina modifier as the relevant spellcasting modifier). Maintaining the shout maintains the spell (up to the spell‘s normal limit).</li><li><i>Reordering</i>: One target within range can move up to one-quarter their speed as their reaction. You can change the target of this shout by maintaining it.</li><li><i>Taunt</i>: You cast the compelled duel spell. You can choose an additional target for the spell for every two levels above 5th.</li><li><i>Terrifying Howl</i>: You cast the cause fear spell. You can choose an additional target for the spell for every two levels above 5th.</li><li><i>Startling Cry</i>: One target within range suffers disadvantage to their attack rolls. You can activate this shout as a reaction if the attack takes place outside your turn, and you may maintain it on your turn and choose another target. A creature cannot be affected by this ability more than once until it completes a short rest. This is a fear effect.</li></ul><br><br>If the target of a shout leaves the range or is defeated, the effect ends for them. If a creature is affected by a shout used by you, or succeeds on their saving throw against it, they cannot be affected again by the same shout until after one minute. A shout is a thunder effect that does not function in areas of silence or if you cannot vocalize.<br><br><i>Special</i>: If you have proficiency in musical instruments, you can use them to apply a bonus to your shouts appropriate to the musical instrument type.<br><br><ul><li><i>Brass (trumpet, cornet, tuba) - Clarion</i>: Any saving throw done against your active spells, or any attempts to dispel your spells channeled through a brass instrument suffer disadvantage (if the dispel would be automatic, it instead requires a check regardless of spell level).</li><li><i>Percussion (drums, triangle, bells) - Resonance</i>: The range of your spells channeled through your instrument increases by 50%.</li><li><i>Strings (violin, cello, harp, dulcimer) - Lingering</i>: If you cast a non-instantaneous spell and stop concentrating or channeling it, it lingers for 1d4 rounds after you stop concentrating or channeling. This cannot exceed the maximum duration of the spell, but can allow you to effectively maintain multiple auras or concentration spells.</li><li><i>Woodwinds (flutes, clarinet, ocarina) - Synthesized</i>: If you cast a spell that provides a bonus to a roll or advantage to it, the targets gain a further +1 bonus to the roll.</li></ul>"
         },
         "SlayersCounter": {
            "Label": "Slayer's Counter",
            "Description": "You gain the ability to counterattack when your prey tries to sabotage you. If the target of your Slayer‘s Prey forces you to make a saving throw, you can use your reaction to make one weapon attack against the quarry. You make this attack immediately before making the saving throw. If your attack hits, your save automatically succeeds, in addition to the attack‘s normal effects."
         },
         "SlayersPrey": {
            "Label": "Slayer's Prey",
            "Description": "You can focus your ire on one foe, increasing the harm you inflict on it. As a bonus action, you designate one creature you can see within 60 feet of you as the target of this feature. The first time each turn that you hit that target with a weapon attack, it takes an extra 1d6 damage from the weapon. Once the creature is defeated, you can choose another target."
         },
         "SlipperyMind": {
            "Label": "Slippery Mind",
            "Description": "You have acquired greater mental strength. You gain proficiency in Spirit saving throws.<br>If you are a monk, you gain proficiency in all saving throws instead."
         },
         "SlowFall": {
            "Label": "Slow Fall",
            "Description": "You can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your level. If you would have landed on a target of an attack you would make, you may deal extra damage equal to half the amount of fall damage reduced by this talent, provided you succeedon the attack roll. In some circles, this ability is known as a drop kick. This extra damage is a strike effect."
         },
         "StalkersFlurry": {
            "Label": "Stalker's Flurry",
            "Description": "You learn to attack with such unexpected speed that you can turn a miss into another attack. When you miss with a weapon attack, you can make another weapon attack as part of the same action. This can be done a number of times equal to your Strength or Agility modifier before requiring a short rest."
         },
         "StunningSlam": {
            "Label": "Stunning Slam",
            "Description": "Upon scoring a critical hit with a melee weapon, you can stun your target for until the end of your turn in the next round. This can be negated with a successful Stamina saving throw. This is a strike effect."
         },
         "SuffusedArrows": {
            "Label": "Suffused Arrows",
            "Description": "You master the art of spell-casting through arrows or infusing them. You may choose to gain proficiency in the Infusion Kit, but can only infuse ranged weapons or arrows, or gain the Spell Strike feat (but only for ranged weapons). If you choose to gain proficiency with the kit, you start with three infusion matrices of your choice that you can craft, and may store them in infusion manuals or similar books.<br>Despite the talent‘s name, this can also cover other types of ranged weapons and ammunition, such as crossbow bolts and bullets, as well as larger samples (such as ballistae bolts or cannonballs)."
         },
         "SwiftSlash": {
            "Label": "Swift Slash",
            "Description": "Whenever you use the Dash action, you may make one free melee attack with a finesse weapon, made at any point during movement. This attack is treated as a normal melee attack for all purposes, but is resolved with a -2 penalty to hit.<br>If you reduce a creature to 0 hit points as part of this attack, you benefit from the blur spell until the beginning of your turn in the next round. You can use this talent only once per round, even if you had an ability that allowed multiple Dash actions in one round (such as Cunning Action or Haste)."
         },
         "TemperedHunter": {
            "Label": "Tempered Hunter",
            "Description": "You have advantage versus divine or arcane spells (choose one upon gaining this talent) cast by your favored enemies and advantage to all checks to avoid being subject to the scrying spell, or being detected, or identified by similar magic. Magics of such type also cast by your favored enemies cannot be used to put you to sleep or to read your mind."
         },
         "TerrifyingTracker": {
            "Label": "Terrifying Tracker",
            "Description": "Whenever you succeed on tracking a creature and have them within your line of sight, you gain advantage to any contested skill check against them. You may also intimidate the target without revealing yourself (usually to steer the target into one place or another)."
         },
         "ThunderClap": {
            "Label": "Thunder Clap",
            "Description": "You may use your action to cast the thunderstorm spell by slamming your weapon into the ground, releasing a wave of force. This acts as the spell with the following differences:<br><br><ul><li>The spell deals normal damage, plus your weapon damage roll. If you have extra attacks, you can add +5 to the damage roll for each attack you would normally make beyond the first.</li><li>You can change its area to a 15-foot sphere centered on you, excluding yourself (and a number of targets equal to your Strength modifier) from the damage.</li><li>Targets who fail their saving throware chilled for one minute. A creature may repeat its saving throw at the end of its turn every round to end the condition. You may choose to push the targets as the normal spell instead.</li></ul><br>Targets who fail their saving throware chilled for one minute. A creature may repeat its saving throw at the end of its turn every round to end the condition. You may choose to push the targets as the normal spell instead."
         },
         "Tremor": {
            "Label": "Tremor",
            "Description": "You may use a bonus action to cause a small localized tremor (usually by stomping your foot or slamming your fist down), dealing your unarmed strike damage in a 5-foot sphere centered on you, halved on an Agility save. Those who fail the saving throw are also knocked prone. If you have a natural weapon, you can use it to determine the damage you deal instead. If you use this ability at the end of a Heroic Leap, you may add +5 to the total damage.<br>This talent can be used a number of times equal to your proficiency bonus before replenishing after a short rest."
         },
         "TricksOfTheTrade": {
            "Label": "Tricks of the Trade",
            "Description": "You may cast the compelled duel spell, but instead of drawing the target to you, you can direct them to a secondary target within 30 feet of both of you. The target of the spell has advantage to the saving throw unless the secondary creature is one of your allies or is neutral to both of you. After being used, this cannot be used again until after a short rest. This effect ends if you attack the target, if the third creature does not defend itself, or if you end your turn more than 30 feet away from the target. If the target defeats the secondary target, you regain use of this ability.<br>This talent can be taken multiple times, each time adding another two uses of this ability before a short rest."
         },
         "UmbralSight": {
            "Label": "Umbral Sight",
            "Description": "You gain darkvision out to a range of 60 feet. If you already have darkvision from your race, its range increases by 30 feet. While in darkness, you can hide in plain sight against any creature that relies on darkvision to see you in that darkness."
         },
         "UnarmoredMovement": {
            "Label": "Unarmored Movement",
            "Description": "Your speed increases by five feet per proficiency bonus you have while you are not wearing armor or wielding a shield. This talent can be chosen again at level 5 or higher, allowing you to move along vertical surfaces and across liquids on your turn without falling during the move so long as you benefit from the speed increase."
         },
         "UncannyDodge": {
            "Label": "Uncanny Dodge",
            "Description": "When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack‘s damage against you."
         },
         "UnerringEye": {
            "Label": "Unerring Eye",
            "Description": "Your senses are almost impossible to foil. As an action, you sense the presence of illusions, creatures not in their original form (such as shapechangers), and other magic designed to deceive the senses within 30 feet of you, provided you aren‘t blinded or deafened. You sense that an effect is attempting to trick you, but you gain no insight into what is hiddenor into its true nature. This ability can be used a number of times equal to your Spirit modifier before replenishing after a long rest."
         },
         "WindWalk": {
            "Label": "Wind Walk",
            "Description": "You may use your action to wind-walk, rendering yourself invisible as per the invisibility spell, and increase your land speed by 10 feet. Unlike normal stances, you must continue moving (at least half your speed) or else this effect dissipates. Your first attack while performing Wind Walk is a critical hit, and ends the invisibility effect. This is a supernatural ability. Once this talent is used, it cannot be used again until after a short rest."
         }
      },
      "UI": {
         "Actions": {
            "NoToken": "You have not selected a valid token. Please select a valid token.",
            "CastSpell": "You cast the Spell",
            "CastSpellError": "You're not able to cast the spell",
            "CastSpellInvalidTarget": "Invalid Target. Please select one hostile token.",
            "OutOfRange": "The target is out of range. Distance:"
         },
         "Bond": "Bond",
         "Bonds": "Bonds",
         "BonusAction": "Bonus Action",
         "Consumable": "Consumable",
         "Creature": "Creature",
         "Dialogs": {
            "CancelSkill": "Release",
            "CancelSkillDescription": "Do you really want to release the skill?"
         },
         "Features": "Features",
         "Flaw": "Flaw",
         "Flaws": "Flaws",
         "Ideal": "Ideal",
         "Ideals": "Ideals",
         "MaterialCost": "Material Cost",
         "Phrases": {
            "Skill": "skill",
            "Spell": "spell"
         },
         "PersonalityTrait": "Personality Trait",
         "PersonalityTraits": "Personality Traits",
         "PointCost": "Point Cost",
         "Rarities": {
            "Common": "Common",
            "Uncommon": "Uncommon",
            "Rare": "Rare",
            "Epic": "Epic",
            "Legendary": "Legendary",
            "Artifact": "Artifact"
         },
         "Rarity": "Rarity",
         "Scam": "Scam",
         "SuggestedCharacteristics": "Suggested Characteristics",
         "Units": {
            "Action": "action",
            "Ft": "ft",
            "Gp": "gp",
            "Hour": "hour",
            "Instant": "instant",
            "Minute": "minute",
            "Minutes": "minutes",
            "Turn": "turn",
            "Turns": "turns"
         },
         "UseItem": "Use-Item"
      }
   }
}